[
  {
    "department": "Institutional Advancement",
    "text": [
      "Working with an early-stage organization is an exciting opportunity to make real-world impacts while gaining professional experience in nonprofit management, social entrepreneurship and organizational development.",
      "• Alumni Engagement: Build and maintain relationships with a portfolio of alumni donors through personalized outreach, volunteer assistance, events, fundraising campaigns, and stewardship activities. Manage and utilize records of interactions in the donor database.",
      "• Institutional Giving: Identify and research potential institutional partners aligned with the Foundation's objectives. Craft tailored grant proposals, applications, and reports to secure funding for key initiatives. Cultivate and nurture relationships with a community of institutional donors."
    ],
    "signup": "https://docs.google.com/forms/d/e/1FAIpQLSe1FXakAnYpuk5vsujwN9mLCdzdYlay_Hx_Qu3wKEDbQDdYoA/viewform",
    "highlights": [
      "The DP Alumni Association",
      "DP Futures Capital Campaign",
      "#GivingTuesday",
      "2023 Annual Report",
      "Masthead Madness"
    ],
    "highlight-links": [
      "https://dailypennalumni.com/",
      "https://www.dailypennalumni.com/dp-futures",
      "https://www.classy.org/campaign/shine-a-light/c540107",
      "https://www.dailypennalumni.com/2023report",
      "https://www.mastheadmadness.com/"
    ]
  }, 
  {
    "department": "Media & Technology",
    "text": [
      "The DP Foundation is a valuable training ground for students seeking to strengthen their portfolios with diverse, impactful deliverables. We are looking for innovative thinkers willing to take initiative in helping build the organization’s projects, platforms and identity.",
      "• Content Management: Create, improve and maintain content (using tools such as Adobe InDesign, Illustrator, and Photoshop) to achieve organizational goals, including but not limited to: campaign material, reports, social media content streams, and alumni newsletter. Develop the DP Foundation’s visual branding.",
      "• Web Development: Communicate the DP’s legacy and encourage giving by building and maintaining web platforms: namely the DP Alumni Association site and fundraising campaign pages. Boost campaign outcomes through web analytics and user experience considerations."
    ],
    "signup": "https://docs.google.com/forms/d/e/1FAIpQLSe1FXakAnYpuk5vsujwN9mLCdzdYlay_Hx_Qu3wKEDbQDdYoA/viewform",
    "highlights": [
      "The DP Alumni Association",
      "DP Futures Capital Campaign",
      "#GivingTuesday",
      "2023 Annual Report",
      "Masthead Madness"
    ],
    "highlight-links": [
      "https://dailypennalumni.com/",
      "https://www.dailypennalumni.com/dp-futures",
      "https://www.classy.org/campaign/shine-a-light/c540107",
      "https://www.dailypennalumni.com/2023report",
      "https://www.mastheadmadness.com/"
    ]
  }
]
