{
  "department" : "34th Street Magazine",
  "text" : [
    "34th Street Magazine is your authority on Penn student life. We are a student magazine that empowers student voices, sheds light on student issues, and provides timely commentary on the arts and campus culture. We provide endless opportunities for a creative outlet: you can write cover stories, help envision marketing campaigns, design and lay out issues, attend press movie screenings, review top-rated restaurants, and even pitch your own content ideas.",
    "As the hub for Penn voices and narrative, Street staffers cover arts, culture, and feature content. We are looking for writers, photographers, videographers, artists, and social media whizzes to create, package, and promote Street to the Penn audience. Writers can work for our Features, Focus, Style, Arts, Film & TV, Music, or Ego sections. Multimedia staffers work with either the Photo or Video departments. Illustrators and graphic designers create visuals, including our weekly print product, as part of the Design department. Audience Engagement associates manage our social media and our newsletter, The Toast.",
    "Street provides writers the opportunity to be creative in their pursuit of journalism, teaches Audience Engagement staff how to build and promote a brand online, and gives photographers, videographers, and illustrators experience in creating engaging editorial visuals. Join Street to be part of a tight–knit community and learn from some of the most interesting and dedicated people at Penn—we promise you won’t regret it."
  ],
  "signup" : "https://docs.google.com/forms/d/e/1FAIpQLSfJQEz55SUFAIETHN-evrZuAEeL-c3A2bVeJ-_HuVU2LUcenA/viewform",
  "highlights" : [
    "‘You Can’t Not Take That Home’: Penn Nurses on the Emotional Toll of Coronavirus",
    "LEADERSHIP, COMMITMENT, AND SCHOLARSHIP: PRESENTING THE CLASS OF 2020 PENN 10",
    "Why I Left Greek Life—And Joined CAFSA",
    "Is TikTok creating a musical meritocracy?",
    "From Houston Hall to the Pennsylvania House of Representatives"
  ],
  "highlight-links" : [
    "https://www.34st.com/article/2020/04/covid-coronavirus-healthcare-essential-workers-nurses-ppe-protection-masks-hospitals-penn",
    "https://www.34st.com/article/2020/05/penn-10-profiles-2020-university-of-pennsylvania-34th-street-magazine-special-issue",
    "https://www.34st.com/article/2020/02/upenn-why-i-left-greek-life-cafsa-wots",
    "https://www.34st.com/article/2020/07/tiktok-music-streaming-spotify-record-label-penelope-scott-yoza-lizzy-mcalpine",
    "https://www.34st.com/article/2020/07/rick-krajewski-upenn-alum-west-philadelphia-state-representative"
  ]
}