[
    {
        "department": "Developers",
        "text": [
            "Both mobile & web developers at the DP have the opportunity to work on a number of diverse and complex projects. The DP runs multiple full-stack apps, regularly creates standalone pages for special issues or interactive projects, and builds internal tools for both the editorial and business sides.",
            "As a web developer, you'll get experience working with GitHub, as well as a wide array of programming languages. We use React, GatsbyJS, and NextJS for our project pages, Express, Apollo, and GraphQL for our backend servers, and regularly build tools with JavaScript, Python, and Ruby.",
            "As a mobile developer, you'll get experience working with React Native and improve upon the DP mobile app.",
            "Developers who are experienced in HTML, CSS, Javascript are encouraged to join!"
        ],
        "highlights": [
            "DP Developers Website",
            "DP+: DP Mobile App",
            "DP Projects, a full list of all project pages we've developed",
            "DP mobile GraphQL Server",
            "Check out all of our open source work on our GitHub"
        ],
        "highlight-links": [
            "https://developers.thedp.com/",
            "https://github.com/dailypenn/canada-goose",
            "https://projects.thedp.com/",
            "https://github.com/dailypenn/jay",
            "https://github.com/dailypenn"
        ],
        "background": "linear-gradient(rgba(34, 34, 34, 0.8), rgba(34, 0, 255, 0.4)), url('https://snworksceo.imgix.net/dpn/85611786-a619-4496-9c5c-59ece6432fa5.sized-1000x1000.jpg')",
        "id": "web"
    },
    {
        "department": "Analytics",
        "text": [
            "DP Analytics is the data science and business analytics hub of the Daily Pennsylvanian. In Analytics, we seek to leverage modern tools and technologies to enhance the digital and data analytics capabilities of the DP.",
            "Analytics staffers have the option to work in one of two sub-departments: Core Data Science and Product Analytics. Examples of data science projects include ML-driven recommendation engines and natural language processing analyses of DP articles. Examples of product analytics projects include market segmentation and search engine optimization (SEO).",
            "Whether it’s deeply technical machine learning work or cross-functional business analytics initiatives (or both!), DP Analytics staffers work on projects with direct impact on the DP, the Penn community, and a global readership audience. Apply today!"
        ],
        "highlights": [
            "ML Driven Content Based Recommendation Engine",
            "Advertisement Optimization Through Ad Network Redesign",
            "Geo-based Interactive Dashboard To Facilitate Circulation Path Diagnosis and Analy"
        ],
        "highlight-links": [
            "https://github.com/dailypennanalytics/dpcontentrec"
        ],
        "background": "linear-gradient(rgba(34, 34, 34, 0.8), rgba(34, 0, 255, 0.4)), url('https://snworksceo.imgix.net/dpn/68726eb4-7df0-4e26-9d83-3ad542d33846.sized-1000x1000.jpg')",
        "id": "analytics"
    },
    {
        "department": "Design",
        "text": [
            "The Design Department is looking for designers, artists, and illustrators with all ranges of experience to join us in producing The Daily Pennsylvanian and 34th Street Magazine’s print and online visual content.",
            "We use the full Adobe Creative Suite—mainly Photoshop, Illustrator, and InDesign—along with various online platforms for data visualization.",
            "If you are interested in creating aesthetic content, whether it be front-page print centerpieces, online graphics, or layouts for websites, then the Design department is for you!"
        ],
        "highlights": [
            "The Grad Issue",
            "Coronavirus Project Page",
            "Opinion | Take down the George Whitefield statue",
            "Opinion | Doctors are facing a silent mental health crisis — and they need help",
            "34st Feature | Who Owns Locust?",
            "34st Word on the Street | A Bumble Date That Actually Went Right"
        ],
        "highlight-links": [
            "https://issuu.com/dailypenn/docs/gradissue",
            "https://thedp-covid-19.herokuapp.com/",
            "https://www.thedp.com/article/2020/06/george-whitefield-statue-rizzo-columbus-racism-slavery-penn-georgia",
            "https://www.thedp.com/article/2020/07/doctors-are-facing-a-silent-mental-health-crisis-and-they-need-help-pre-medicine-med-penn-undergrad-residency",
            "https://www.34st.com/article/2020/02/sexual-assault-racism-harassment-fraternities-cafsa-greek-life-upenn",
            "https://www.34st.com/article/2019/02/sydney-gelman-valentines-day-relationship-bumble-study-abroad"
        ],
        "background": "linear-gradient(rgba(34, 34, 34, 0.8), rgba(34, 0, 255, 0.4)), url('https://snworksceo.imgix.net/dpn/90337c0f-5064-4457-917f-c728ffcf8e58.sized-1000x1000.jpg')",
        "id": "design"
    }
]