[
  {
    "department": "News",
    "text": [
      "By joining News, you will learn not only how to report and investigate stories relevant to Penn’s campus and students, but also the intricacies of student life and University operations. Reporters uncover news important to the Penn community by illuminating student stories and holding institutions accountable. Whether it’s breaking news or investigative journalism, your storytelling has the ability to enact real change on campus.",
      "The Real-Time Desk is also housed in the News department and is for those who want to report on breaking news and write aggregated news posts with a lesser time commitment.",
      "Follow in the footsteps of DP News alumni who work for publications like The New York Times, Politico, Vox, and The Washington Post, to name a few. No journalistic experience required — only curiosity and dedication."
    ],
    "highlights": [
      "Penn Med staff among first frontline healthcare workers in U.S. to receive COVID-19 vaccine",
      "Penn Police superintendent utters expletives, accidentally interrupting U. Council meeting",
      "Penn Med's frontline health care workers praised for courage, yet denied COVID-19 tests",
      "Students demand Penn fire anthropology professor who used Nazi phrase and salute",
      "Live Updates — More than 1,000 ballots cast at Houston Hall, ARCH, Walnut Street Library"
    ],
    "highlight-links": [
      "https://www.thedp.com/article/2021/01/covid-19-vaccine-rollout-penn-health-system-staff-researchers-pennsylvania",
      "https://www.thedp.com/article/2020/12/penn-university-council-open-forum-maureen-rush-expletive-comment",
      "https://www.thedp.com/article/2020/12/routine-testing-penn-healthcare-workers",
      "https://www.thedp.com/article/2021/01/penn-professor-hitler-nazi-salute-anthropology-reactions-fire",
      "https://www.thedp.com/article/2020/11/penn-philadelphia-election-day-live-updates"
    ],
    "background": "linear-gradient(rgba(170, 30, 34, 0.8), rgba(170, 30, 34, 0.8)), url('https://snworksceo.imgix.net/dpn/917417c6-2a39-487a-bd75-8913f3427445.sized-1000x1000.jpg')",
    "id": "news"
  },
  {
    "department": "Sports",
    "text": [
      "Sports are about passion — the ability to risk it all, to become emotionally invested, to be a part of a team, and to test the limits of what you’re capable of. DP Sports provides the structure and guidance you need to explore that passion.",
      "Our department is a place where anyone can feel welcome and be a part of the family. We spend valuable time with each and every person on our team to ensure that they can sharpen their storytelling and investigative skills. We’re a team, and we have an amazing time going on road trips, throwing watch parties, and getting immersed in the sports we cover and watch.",
      "So if you like watching, playing, reading, writing, talking, photographing, or learning about sports, DP Sports is totally the place for you. No experience necessary; absolutely anyone is welcome to join!"
    ],
    "highlights": [
      "Brodeur's record-breaking night sees Penn men's basketball through to Ivy Madness",
      "Why didn't Donald Trump play sports at Penn?",
      "Born into a celebrity family, Penn quarterback Ryan Glover forges his own path",
      "An empty cathedral: Why aren't more students attending basketball games at the Palestra?",
      "Freshman year they cried over cheese fries. Now seniors, Grasela and Sterba are captains"
    ],
    "highlight-links": [
      "https://www.thedp.com/article/2020/03/penn-mens-basketball-columbia-aj-brodeur-leading-scorer-ivy-league",
      "https://www.thedp.com/article/2020/07/donald-trump-penn-baseball-football-squash-fordham-sats-bob-seddon",
      "https://www.thedp.com/article/2020/06/ryan-glover-tameka-foster-penn-football-quarterback-mother-son-usher-ivy-league",
      "https://www.thedp.com/article/2020/02/palestra-penn-mens-basketball-attendance-student-culture-ivy-league",
      "https://www.thedp.com/article/2019/11/penn-womens-basketball-senior-leaders-grasela-sterba"
    ],
    "background": "linear-gradient(rgba(170, 30, 34, 0.9), rgba(170, 30, 34, 0.9)), url('https://snworksceo.imgix.net/dpn/cec0e468-8fd7-4820-906d-9981ae887347.sized-1000x1000.jpg')",
    "id": "sports"
  },
  {
    "department": "Opinion",
    "text": [
      "You have the power to decide what the campus conversation ought to be.",
      "At The Daily Pennsylvanian, we are looking for creative, passionate, and hard-working writers to pen columns for Penn's independent student-led news organization. We are also looking for talented artists to create funny, insightful, and poignant cartoons.",
      "Your writing and reporting skills will improve tremendously, you will have the rare opportunity to reach thousands of people with every column you write, and you will learn to make this award-winning media organization your home. Opinion columns often garner the most page views of all DP sections, and columnists are known around campus. Being an opinion artist requires time and dedication, as well as the ability to make a point using few words.",
      "Make conversation, stimulate change, and hold organizations and people accountable. Join us."
    ],
    "highlights": [
      "Surayya Walters | Stop ignoring tokenism at Penn",
      "Alfredo Praticò | David Cohen is Wrong",
      "Varun Saraswathula | Doctors are facing a silent mental health crisis — and they need help",
      "Kaliyah Dorsey | At Penn, fake smiles hurt more than they help",
      "Jessica Gooding | Paying PILOTs will save lives"
    ],
    "highlight-links": [
      "https://www.thedp.com/article/2019/11/tokenism-racism-clubs-ivy-league-upenn-philadelphia",
      "https://www.thedp.com/article/2020/07/paying-pilots-will-save-lives-philadelphia-penn-campus",
      "https://www.thedp.com/article/2020/07/doctors-are-facing-a-silent-mental-health-crisis-and-they-need-help-pre-medicine-med-penn-undergrad-residency",
      "https://www.thedp.com/article/2019/04/mental-health-ivy-league-ariana-grande-jordan-peele-kaliyah-dorsey-upenn-philadelphia",
      "https://www.thedp.com/article/2020/07/paying-pilots-will-save-lives-philadelphia-penn-campus"
    ],
    "background": "linear-gradient(rgba(170, 30, 34, 0.9), rgba(170, 30, 34, 0.9)), url('https://snworksceo.imgix.net/dpn/63f97845-7cb5-49eb-8322-bca5667583bc.sized-1000x1000.jpg')",
    "id": "opinion"
  },
  {
    "department": "Copy",
    "text": [
      "The Daily Pennsylvanian’s Copy Department is now editing 34th Street, Under the Button, and DP Sports content! Join our super fun team in reviewing and fact-checking everything from breaking news to satirical videos to social media captions. Come help us keep our content concise, consistent, and considerate.",
      "From the people who brought the DP the Oxford comma."
    ],
    "highlights": ["The DP's Official Style Guide"],
    "highlight-links": [
      "https://docs.google.com/document/pub?id=14HoU_sCiPxD8SOSH8HvWKsvz1Elv89yzcje-sZGGahs&pli=1"
    ],
    "background": "linear-gradient(rgba(170, 30, 34, 0.8), rgba(170, 30, 34, 0.8)), url('https://snworksceo.imgix.net/dpn/9a678efe-73b0-4fed-9f63-2278da389db8.sized-1000x1000.jpg')",
    "id": "copy"
  },
  {
    "department": "Multimedia",
    "text": [
      "As a member of the Multimedia Department, you will learn how to create engaging visual storytelling content, have the opportunity to cover historic events on campus and throughout the country, and take part in the editing and publishing processes.",
      "In 2020, our staff notably covered Philadelphia’s Black Lives Matter protests, the presidential election throughout Pennsylvania and at the New Hampshire primaries, and explored the University’s efforts to combat COVID-19.",
      "We use the Adobe Creative Suite, as well as high-quality DSLR cameras, lenses, and audio and video equipment. No experience with photography or videography is necessary. No personal equipment is required, but we ask you to use your own if you have it now. Join us in making transformative content for an award-winning media company!"
    ],
    "highlights": [
      "In Photos: Celebrating the Class of 2021 with a commencement unlike any other",
      "Isolation Diaries: Sansom Place West",
      "Photo Essay | Philadelphia protests for George Floyd and racial justice",
      "Word on the Walk | What Does Black History Month Mean to You?",
      "In Photos: After a year off the field, Penn athletics returns to competition",
      "Opinion | How a Penn Grad Turned a Neurobiology Degree into a Professional Magic Career",
      "Photo Essay | Meet seven essential workers keeping Penn’s campus running during the pandemic",
      "Inside the Daily Pennsylvanian | Office Tour"
    ],
    "highlight-links": [
      "https://www.thedp.com/article/2021/05/penn-265th-commencement-graduation-covid-class-of-2021-photo-gallery",
      "https://www.youtube.com/watch?v=Df4YA4vKAz4",
      "https://www.thedp.com/article/2020/06/philadelphia-protests-george-floyd-black-lives-matter-photo-essay",
      "https://www.youtube.com/watch?v=3meNxiAiHHA",
      "https://www.thedp.com/article/2021/04/spring-sports-local-competition-philadelphia-2021-photo-gallery",
      "https://www.youtube.com/watch?v=DQo2yGLT1mw",
      "https://www.thedp.com/article/2020/11/penn-essential-workers-coronavirus-covid19-photo-essay",
      "https://www.youtube.com/watch?v=eKtnt6jwOgI"
    ],
    "background": "linear-gradient(rgba(170, 30, 34, 0.8), rgba(170, 30, 34, 0.8)), url('https://media.giphy.com/media/KHKlf5Cnvzm1HDkVrL/giphy.gif')",
    "id": "multimedia"
  },
  {
    "department": "Audience Engagement",
    "text": [
      "Joining Audience Engagement will put you on the frontline of the DP’s interaction with tens of thousands of readers and develop skills increasingly relevant in the world’s growing digital landscape.",
      "As a rapidly growing department, we are looking for people excited to curate, manage, and develop the DP’s social media presence and interaction through Facebook, Twitter and (especially!) Instagram. We are also seeking writers interested in writing and editing our daily newsletter. This year, we have created a new division under AE in partnership with Analytics for those interested in the more technical side of analyzing audience engagement data.",
      "AE is the right department for anyone looking to work with other departments across the DP on exciting projects such as promotion strategies for special issues and events online.",
      "No prior experience required for the social media and newsletter division — only a fire emoji game and willingness to be part of our close knit family. Familiarity or willingness to learn Google Analytics and Excel is required for the analytics division, and it’s a bonus if familiar with Python or R."
    ],
    "highlights": [
      "The Daily Pennsylvanian Facebook",
      "The Daily Pennsylvanian Twitter",
      "DP Sports Twitter",
      "The Daily Pennsylvanian Instagram"
    ],
    "highlight-links": [
      "https://www.facebook.com/dailypenn",
      "https://twitter.com/dailypenn",
      "https://twitter.com/dailypennsports",
      "https://www.instagram.com/dailypenn/"
    ],
    "background": "linear-gradient(rgba(170, 30, 34, 0.8), rgba(170, 30, 34, 0.8)), url('https://snworksceo.imgix.net/dpn/4c31d16d-8363-41df-80a0-a5564b011215.sized-1000x1000.jpg')",
    "id": "social"
  },
  {
    "department": "Podcasts",
    "text": [
      "Calling all podcast enthusiasts! DP Podcasts is looking for new storytellers, hosts, writers, editors, and assistants! Those looking to edit podcasts or learn the behind the scenes process are especially welcomed by our hosts. Join this burgeoning department as we attempt to expand the breadth and depth of our current podcast offerings. We are looking for storytellers and commentators from diverse backgrounds.",
      "Are you weirdly passionate about something on campus? Do you have interesting opinions? If you join our department, we can turn that into a podcast!"
    ],
    "highlights": [
      "A Legacy of Privilege, Quite Frankly",
      "ivyQueens, Bottoms on Top",
      "Gay Christmas, Bottoms on Top",
      "Disoriented at Penn, 1600 Penn"
    ],
    "highlight-links": [
      "https://www.thedp.com/multimedia/63464",
      "https://www.thedp.com/multimedia/62044",
      "https://www.thedp.com/multimedia/61202",
      "https://www.thedp.com/multimedia/60649"
    ],
    "background": "linear-gradient(rgba(170, 30, 34, 0.8), rgba(170, 30, 34, 0.8)), url('https://snworksceo.imgix.net/dpn/51d7e036-6b77-402a-9d6d-b1f7b8c3ab8c.sized-1000x1000.jpg')",
    "id": "podcasts"
  }
]
