[
  {
    "department": "Marketing",
    "text": [
      "DP Marketing works on developing and enhancing the brand identity of The Daily Pennsylvanian Inc., a $3 million dollar business. Our associates work to create social media campaigns, events, and merchandise that showcase the content of the DP, 34th Street Magazine, and Under the Button. We work closely with all departments in the DP. Associates are also given the resources and opportunities to plan and execute their own marketing projects to promote any section of the publication.",
      "Marketing is the perfect place to develop both your creativity and your business skills because all our projects require a good mix of both. No prior experience is required — just a willingness to learn about branding, promotion, and merchandising. Join us to gain some business experience and be a part of this great organization!"
    ],
    "highlights": [
      "Battle of the Bands",
      "UTB Comedy Night",
      "Puck Frinceton T-shirt Sale"
    ],
    "highlight-links": [
      "https://www.facebook.com/events/2205915566180909/",
      "https://www.facebook.com/events/2137326212971575/",
      "https://www.facebook.com/events/440490923254900/"
    ],
    "background": "linear-gradient(rgba(238, 238, 238, 0.9), rgba(238, 238, 238, 0.9)), url('https://snworksceo.imgix.net/dpn/5803b1e8-72a6-4810-9770-60123f4a066d.sized-1000x1000.jpg')",
    "id": "marketing"
  },
  {
    "department": "Finance",
    "text": [
      "You can study the theory of finance in Wharton, but the DP gives you an ideal business laboratory and the money is real. As a member of our finance team you will:",
      "• Analyze and advise on investments",
      "• Design effective budget models for departments and the entire company",
      "• Analyze financial information (revenues, expenditures & cash management) to ensure all operations are within budget",
      "• Present annual budgets to top leadership",
      "• Review budget requests for approval",
      "• Forecast future budget needs",
      "• Identify variances between actual and budgeted financial results at the end of each reporting period",
      "• Suggest spending improvements that increase profits",
      "• Ensure department managers meet budget submission deadlines",
      "• Design and implement effective budgeting policies and procedures"
    ],
    "highlights": [
    ],
    "highlight-links": [
    ],
    "background": "linear-gradient(rgba(238, 238, 238, 0.9), rgba(238, 238, 238, 0.9)), url('https://cf.ltkcdn.net/antiques/images/orig/226165-2121x1414-Antique-cash-register.jpg')",
    "id": "finance"
  },
  {
    "department": "Consulting",
    "text": [
      "Consulting analysts source potential clients, develop strategic marketing campaigns, and produce pitch materials for client presentations. By working with our outstanding business teams, DP consultants will learn to use creative problem solving and analytical skills to help our clients successfully reach the Penn community. The consulting team promotes quick thinking and strong teamwork."
    ],
    "highlights": [
      "DP Consultants helped clients during the COVID-19 pandemic develop social media strategies to keep up with customers while away from campus."
    ],
    "highlight-links": [],
    "background": "linear-gradient(rgba(238, 238, 238, 0.8), rgba(238, 238, 238, 0.8)), url('https://snworksceo.imgix.net/dpn/7f265244-68c1-4483-b138-8fc49c343444.sized-1000x1000.jpg')",
    "id": "consulting"
  },
  {
    "department": "Product Lab",
    "text": [
      "The DP Product Lab explores new revenue ideas including newsletters and special issues. Some projects we are involved in include Best of Penn, Summer at Penn, and the Visitors Guide. Positions in product lab range from creative writing, marketing, design, web development, and analytics. If you have interdisciplinary interests, this may be the perfect department for you!"
    ],
    "highlights": [
      "Verb Energy Bars Sponsored Video",
      "Meet Parvis and his micro-world at Woven Treasures",
      "Which Gia Pronto Kitchen salad are you?"
    ],
    "highlight-links": [
      "https://www.facebook.com/dailypenn/videos/vb.6356558804/10155858850708805/",
      "https://www.thedp.com/article/2018/04/sponsored-woven-treasures-video",
      "https://www.thedp.com/article/2017/11/sponsored-gia-pronto-quiz"
    ],
    "background": "linear-gradient(rgba(238, 238, 238, 0.8), rgba(238, 238, 238, 0.8)), url('https://snworksceo.imgix.net/dpn/af307706-8ed7-4389-bb37-283cdb2af2d0.sized-1000x1000.jpg')",
    "id": "product-lab"
  },
  {
    "department": "Circulation",
    "text": [
      "Circulation staffers are the DP's street team, and they are the ones you see handing out papers on Locust Walk and across campus every day.",
      "If you’re friendly, dependable, and loud—and want to earn $15 an hour—this is the department for you. Join an incredible team with a great culture filled with good times and social activities."
    ],
    "highlights": [],
    "highlight-links": [],
    "background": "linear-gradient(rgba(238, 238, 238, 0.8), rgba(238, 238, 238, 0.8)), url('https://snworksceo.imgix.net/dpn/06837fc5-f166-414c-8785-9234e35205b0.sized-1000x1000.jpg')",
    "id": "circulation"
  }
]
