{
  "New Student Representative": [
    {
      "name": "Grant Coulson",
      "introduction": "My name is Grant Coulson. I’m running for the Undergraduate Assembly because there’s dignity in their work—the UA works week-in and week-out for the betterment of students. Rather than pretending like I fully understand Penn’s most pressing issues after such a short tenure here, my platform resides on principles that I can confidently deliver for my class:",
      "platform points": [
        "Be approachable to my peers and attentive to their concerns.",
        "Handle problems as they arise and provide expedient solutions.",
        "Communicate progress to the Class of 2027."
      ],
      "image": {
        "src": "../../../images/2023/nec/Grant-Coulson.jpeg"
      }
    },
    {
      "name": "Sacha Baniassad",
      "introduction": "My name is Sacha Baniassad, and I’m from SoCal. I’m studying Economics in The College. I want to run for UA because I’m eager to voice the opinions of my fellow Quakers. I know there are some things that we can make better about Penn. And I know that with this position, I can help us do that. We need to have less hamburgers and more variety at our dining halls. We need to have a greater sense of inclusion among our campus clubs. And we need more funding toward better shower curtains. Together, we can make this happen. ",
      "platform points": [
        "Increase Club Inclusiveness. I plan to increase funding for the SAC, so clubs can more organically grow the size of their committees. ",
        "More Variety in Dining Halls. Healthy eating habits come from access to a variety of meals to eat, and this all stems from our dining halls.",
        "Cleaner Living. Let’s make it our home away from home—cleaner bathrooms, better shower curtains, less cockroaches.",
        "A Closer Community. I will strive to promote athletics games to grow a stronger and more competitive athletic spirit. ",
        "One Voice for All Voices. The UA has 3 million dollars dedicated to making your life better, and as your representative, I will make sure your voice is heard. ",
        "Your Liaison to Administration. Under my platform, administrators will not only hear your requests but also make action upon them."
      ],
      "image": {
        "src": "../../../images/2023/nec/Sacha-Baniassad.jpeg"
      }
    },
    {
      "name": "Hannah Moss",
      "introduction": "Hi everyone! My name is Hannah Moss, and I am from New York. In high school I served as the student council president, and enacted several impactful initiatives that brought our grade closer together. From making cute merchandise to outlining bylaws to make testing weeks more manageable, I loved working with administration to make change. I am running for class president because I can almost guarantee that you will not meet anyone with as much school spirit as I. I will literally do a backflip over how much I love it here (you can hold me to this). ",
      "platform points": [
        "Grade bonding- As a grade of 2,000, it is impossible to know EVERYONE in our class, but I want to implement more fun grade bonding activities.",
        "Community service- Although Penn has numerous community service opportunities, I want to work to expand the groups Penn works with (such as more programs working with children with developmental disabilities)",
        "Centralized databases for new students - creation of a website that has everything students need to know, like path@penn, but from students. The best features of path, rate my professors, and coffee chats all in one place. ",
        " Extended dining hall hours- More late night options! We all know college students are lazy, and do not want to trek across campus when it is dark out to the one open dining hall on campus. ",
        " Lighting in campus intersections - Penn’s myriad of safety resources do not go unnoticed, but some of the side streets off of Locust can get scary at night. "
      ],
      "image": {
        "src": "../../../images/2023/nec/Hannah-Moss.jpeg"
      }
    },
    {
      "name": "Lucas Zhu",
      "introduction": "Hello! My name is Lucas Zhu and I’m running for UA and VP of External Affairs. I am a political science major hailing from Livingston, New Jersey. You may know me as the kid who tries to name all your state and local politicians, and I now hope to be added to that list of your leaders. From transportation to dining, I have a variety of ideas for Penn, but I will always listen to all opinions and concerns. I would be honored to earn your vote so we can improve our school and student body together!",
      "platform points": [
        "Dining: Expanding the number of locations where students can use dining dollars, especially at local restaurants. ",
        "Transportation: Working with SEPTA to obtain greater discounts for Penn students on public transportation.  ",
        "Student Voices: Distributing more surveys and places to leave suggestions where students can express their opinions about various policies and events, whether it be food, housing, or activities.",
        "Events: Hosting more social events in downtown Philadelphia, particularly during stressful times of the school year.",
        "Hydration: Increasing the number of hydration stations in residence halls and around campus.",
        "Health: Including hand sanitizers in every classroom to keep students safe from various germs and viruses."
      ],
      "image": {
        "src": "../../../images/2023/nec/Lucas-Zhu.jpeg"
      }
    },
    {
      "name": "Tyler Ringhofer ",
      "introduction": "Lights, camera, magic. As someone who is deeply devoted to every undertaking that he pursues, I hope to continue to be someone that people can count on and trust in times when it matters most. In particular, I am inspired by the immense power of teamwork in enacting meaningful change in communities. Witnessing this truth first-hand in my magic endeavors, it is always a pleasure getting to connect with people of all different backgrounds and perspectives. I want to bring that same magic that has driven me my whole life to the positions of New Student Representative and College Chair.",
      "platform points": [
        "Making Dining Food Great Again ",
        "Allowing students in CAS and New Students to have a greater say in planning social-related events through outreach and polling. ",
        "Gaining more funding in initiatives that support CAS and New Student-specific events ",
        "Increasing learning initiatives through tutoring resources and connections with faculty  ",
        "Creating a pipeline of transparency and coordination between CAS students and other schools at Penn"
      ],
      "image": {
        "src": "../../../images/2023/nec/Tyler-Ringhofer-.jpeg"
      }
    },
    {
      "name": "Andrew Wong",
      "introduction": "Benjamin Franklin once said, “When you are finished changing, you are finished.” Change is the only constant, but it can go both ways. Since arriving at Penn, I’ve begun to notice the hidden and unresolved problems that subtly induce negative changes in our community, from mental health issues to social injustices. By running for UA’s new student rep, I hope to unite our voices in reversing such negative changes. If you would like to create positive change and build a brighter Penn together, please vote for Andrew Wong. I wish you all the best in midterms, club apps, and life!",
      "platform points": [
        "Wellbeing - place students' mental health and wellbeing as a top priority in policy-making; establish PennGAS, an anonymous suggestion and complaint system; foster an environment where everyone feels they belong",
        "Eat Well - establish meal suggestion system; improve dining hall hygiene; design flexible meal plans; introduce more international food options and food portion system; launch \"Free Food Week\" for retail locations",
        "Relations with Community - Push for Penn administration to fulfill its responsibility towards the West Philly community, social injustices and climate change; increase funding towards community engagement organizations within student body",
        "Diversity and Inclusion - reduce selectivity and complexity of club applications; improve accessibility in older college buildings; review Greek life inclusion policy; actively incorporate LGBTQIA+ voices in policy-making",
        "Nature, Animals, Conservation - install hand dryers in all washrooms; reseed dead lawns and plant trees; establish Campus Wildlife Education Center (CWEC) to protect campus fauna; designate fully pet-friendly college houses",
        "Academic Wellness - initiate “Course Tasting Week” with trial lessons and sample materials before advance registration; offer placement tests, credits and waivers for more courses"
      ],
      "image": {
        "src": "../../../images/2023/nec/Andrew-Wong.jpeg"
      }
    },
    {
      "name": "Musab Chummun",
      "introduction": "I’m Musab Chummun, and I want to take a two-pronged approach to improving campus life!   Socially, I will plan *fun* events that create an integrated class where you can build many lifelong friendships! Whether that is through free merch, mental health days, etc., I will create events people want to attend.   Administratively, I will petition to fix any complaint you may have, even including the dorm bathrooms and food quality.  I have done Student Government for 7 years straight, including being President of my high school so I know exactly how to execute these ideas.  For more: @mchummun__ on Instagram!!",
      "platform points": [
        "MERCH❗️ - More free/discounted merch, 2027 specific designs made by students, higher quality merch.",
        "MENTAL HEALTH❗️- Mental Health Days/Weeks where you spontaneously get small things to make your day a little better. Ex: free flowers, free cookies, etc.",
        "MEETING NEW PEOPLE ❗️- Social events that allow for mixing between cliques, and becoming friends with people you would usually never see on a normal day. ",
        "DORM IMPROVEMENTS❗️- Bathrooms, dining Halls, bug infestations, I will literally petition the administration to get any complaint fixed. ",
        "PUBLICITY❗️- Class wide Instagram with engaging and fun content all in once place. So you can always stay up to date on anything 2027 related! ",
        "CLASS EVENT IMPROVEMENTS❗️- Better event ideas. Dunk tanks, bouncy houses, dorm competitions, etc. And of course, more free food and drinks."
      ],
      "image": {
        "src": "../../../images/2023/nec/Musab-Chummun.jpeg"
      }
    },
    {
      "name": "Niheer Patel",
      "introduction": "Hi! I’m Niheer Patel, and I’m running for Undergraduate Assembly. I am a first-year student in the College planning on majoring in political science. I’m originally from Atlanta, Georgia and am living in Hill House. UA is an incredible opportunity for me to help push the University towards morals that we hold in common, making campus a better place for all of us to learn and grow. UA is responsible for the allocation of $3 million each year, and I want to ensure those dollars go towards causes that align with our values as a robust, diverse cohort of students.",
      "platform points": [
        "Ensuring that campus is a safe and supportive space for student activism to protect student organizers from retribution or threats",
        "Increasing funding for cultural and affinity centers to help facilitate student connections with their identity groups",
        "Protecting the interests of FGLI students, including restoring programs that helped with the acquisition of textbooks",
        "Providing equitable access to class content in the event of sickness to limit the need for students to attend class while sick",
        "Supporting diversity, equity, and inclusion in all aspects of our campus from mental health resources to departmental offerings"
      ],
      "image": {
        "src": "../../../images/2023/nec/Niheer-Patel.jpeg"
      }
    },
    {
      "name": "Mariam Kazmi",
      "introduction": "Hi! My name is Mariam, and I’m running for Vice President of Internal Affairs and New Student Representative. I love planning events that bring students together, and that’s what I hope to do for you all. I have experience in student government and would love to use it to strengthen the class of 2027. Specifically, I want our class to focus on community-building. Getting to know each other, connecting with those beyond only individuals in our houses, is so important to make the next four years as memorable as possible. I will lead to completion projects that fulfill this goal. ",
      "platform points": [
        "I will bring students from different houses together by hosting bonding activities for the entire class of 2027, such as football game prep days and fun filled snow days. ",
        "I hope to increase dining options for students by holding campus-wide cooking classes and providing free food during specific weeks of the school year, such as finals week. ",
        "As specific to my role, I will ensure that all projects are appropriately divided amongst team members and followed through to completion. ",
        "To ensure we make the most out of the city we attend school in, I will lead a project to create a guide of city activities that are easily accessible."
      ],
      "image": {
        "src": "../../../images/2023/nec/Mariam-Kazmi.jpeg"
      }
    },
    {
      "name": "Finn Broder",
      "introduction": "My name is Finn Broder, and I’m running to be one of your New Student Representatives in the Undergraduate Assembly. I’m in the College and still figuring out what I’d like to study. I’m no stranger to representing, and when necessary, standing up for my peers. I served on the Disciplinary Committee at my high school, bringing student input to important conversations that affect us students. At Penn, I’ve looked to meet new friends every day. Please, say hello if you see me out, and I’ll talk to ANYONE about my campaign and vision for Penn! Finn For The Win!",
      "platform points": [
        "Greater variety of food options offered at McClelland. I will advocate that Quad residents shouldn’t have to walk so far to access a general dining hall menu.",
        "Unlimited food per swipe means unlimited food. If you ask for two chicken breasts instead of one, you should receive two.",
        "Transparency and communication. How is Penn actively working to improve itself? My goal is for us to hear from administrators more regularly because questions like this one are important.",
        "Student-athlete representation. I’m a walk-on to the rowing team, so I know how hard Penn’s athletes work. I will fight for more leniency with scheduling appointments, course registration, etc.",
        "Club applications. Future new students shouldn't have to “apply to college again.” I will work with leaders to forge a path forward that maintains clubs’ prestige and creates opportunities.",
        "Finn For The Win. Text me at (646) 703-1321 with any questions! Let’s expand this platform together."
      ],
      "image": {
        "src": "../../../images/2023/nec/Finn-Broder.jpeg"
      }
    },
    {
      "name": "Nia Matthews ",
      "introduction": "Hi everyone! My name is Nia Matthews and I’m ecstatic to be running for the 2027 Class Board President and Undergraduate Assembly New Student Representative! My campaign will be inclusive of the student body while also actively enacting change. I was president of my class for two consecutive years and was able to induce a policy change in my county’s Code of Conduct regarding racism and biases. As a FGLI student, I hope to use my background to represent Penn’s diverse student body and value in advocating for student opinions. My goal is to use my voice, to amplify yours! ",
      "platform points": [
        "1) Diversity and Inclusion- Uplift freshmen voices by hearing all opinions. Address student concerns facilitated through forums and feedback drop boxes. ",
        "2) Prioritizing Mental Health & Wellness- Advocate for more sources of purified water around campus, weekend bathroom cleaning, sanitation stations, and improved accessibility to mental health resources.",
        "3) Academic Reform- Advocate for a more efficient Add/Drop Class system in Path @ Penn, addressing the organization (or lack thereof) of MATH CLASSES, and a more consistent structure of lectures. ",
        "4) Resource Equity- Create equally accessible resources for students in each school including access to free printing and GSR bookings should be available to students in every college. ",
        "5) Accessibility- Provide more information about transportation in the city, a larger variety of meal plan options, longer dining hall hours, and more affordable Penn merch. "
      ],
      "image": {
        "src": "../../../images/2023/nec/Nia-Matthews-.jpeg"
      }
    },
    {
      "name": "Ciella Angel-Lalanne ",
      "introduction": "Hi everyone, my name is Ciella Angel-Lalanne and I am a prospective PPE major from New York. Why am I interested in being on the UA? I was a student government representative for all four years of high school and worked on various academic and social issues to improve the daily lives of students. I’ve had significant experience representing student voice with school administration and local government, including advocating for the successful passage of a contentious school budget. I feel great fulfillment meeting others, hearing their concerns and efficiently seeking solutions, and hope to continue this work on the UA. ",
      "platform points": [
        "Include a TAP module with contact information for upperclassman in various majors who are willing to advise incoming freshmen on planning their course schedules with practical and unfiltered guidance.",
        "Create greater incentives for the student body to engage in community service in order to help the university have a greater positive impact on Philadelphia.",
        "Amplify the voices of marginalized groups on campus by awarding them both the time and opportunity to speak at student government events/important university discussions.",
        "Ensure inclusion of the student perspective as the university continues to navigate guidance on the admissions process in a post SFFA v. Harvard world.",
        "Create a system for freshmen to easily create and join study groups, to alleviate the pressure of not knowing enough students in class to create study groups on their own.",
        "Supply freshman with more resources to deal with the ever-present freshman flu! (Cough drops, tissues, etc.)"
      ],
      "image": {
        "src": "../../../images/2023/nec/Ciella-Angel-Lalanne-.jpeg"
      }
    },
    {
      "name": "Aidan Carroll",
      "introduction": "Hello, Class of 2027! My name is Aidan Carroll, and I am running to be a New Student Representative on the Undergraduate Assembly. The mission of the UA is to improve the lives of all undergraduate students on campus. After being the Student Body Vice President at my high school, I know exactly how to push administrators to improve students' lives. My job is to represent you, so please reach out to me at aidanamc@sas.upenn.edu. I can’t wait to hear from you. Don’t forget to vote at pennstudgov.com starting at 8:45 pm this Wednesday!",
      "platform points": [
        "Dining/Weekend Dining- I have applied to the Dining Advisory Board to work directly with Penn Dining to improve food on campus and advocate for more weekend dining. ",
        "Quad Renovations- I will work with Chris Kern, Penn’s Executive Director of Design and Construction to limit disruptions to students living in the Quad this year.",
        "Inclusion- I will connect with a diverse group of students from all parts of Penn to make sure I represent the needs of everyone.",
        "Safety- I will work with the Department of Public Safety to enhance student security and ensure everyone feels safe.",
        "Sustainability- I will work with Penn Sustainability to strive to make Penn a more environmentally friendly campus.",
        "Funding- I will be creative with our limited resources to fund as many student groups as possible."
      ],
      "image": {
        "src": "../../../images/2023/nec/Aidan-Carroll.jpeg"
      }
    },
    {
      "name": "Julia Kincaid",
      "introduction": "Hi everyone! I’m Julia, and I’m a Neuroscience major from North Carolina. I love playing tennis (hmu if you need a partner), skiing, and baking! As a member of student government in high school, I have a passion for advocating for my peers and working to create a fun environment. At Penn, I would love the opportunity to plan events, create new traditions, and bring excitement to our first year. I’ve already fallen in love with Penn, and I hope to help our class have a voice in improving our school. Don’t be afraid, vote for Kincaid!",
      "platform points": [
        "Enhancing School Spirit: Give out more free merchandise, start a tradition of class trips (beach trip, NYC trip, etc.), hold more festivals ",
        "Supporting Student Needs: Implement ice machines and water fountains in residential buildings, create a mobile form of Penn ID so physical cards aren’t necessary",
        "Celebrating Cultural Diversity: Plan annual international festivals where students of different cultures can organize booths to display their culture with food, artifacts, music, etc.",
        "Making Sports Accessible: Hold monthly tournaments for a variety of intramural sports",
        "Building Community: Organize more social events with free food and opportunities to meet other students"
      ],
      "image": {
        "src": "../../../images/2023/nec/Julia-Kincaid.jpeg"
      }
    },
    {
      "name": "Steve Yang",
      "introduction": "Hello! I’m Steve Yang, candidate for both Internal Vice President and the UA. I’m from New York City and I’m in the College intending to study Political Science. I’m excited to meet you as the campaign season officially kicks off!  Our class deserves people who are dedicated to meaningful change and to improving the student experience, people who have a proven track record of leading initiatives and getting things done. Experience matters. I served on student government throughout high school, where I helped spearhead the launch of a sandwich preordering form, distributed class merchandise, and ran a teacher appreciation initiative.",
      "platform points": [
        "Clubs should not be as exclusive and competitive as they are currently; they are extracurriculars, not eating clubs. I will work with the administration to reform the club application process.",
        "The waitlist process for full classes is confusing, as is the dash for course changes when the add period opens. I will seek to structuralize and clarify the procedures involved.",
        "As a decompressor from schoolwork, I will organize class competitions, including—but not limited to—a Spikeball tournament, a March Madness bracket, a Geo Bee, and a Mixed Doubles tennis tournament.",
        "I will try to increase free printing options across campus; to boot, especially as cold season ramps up, I will lobby for the installation of more tissue dispensers around campus.",
        "Many of the Quad single bathrooms do not have locks. I will look into the process of installing locks to avoid the awkwardness of unknowingly opening an occupied bathroom door.",
        "I’ll also organize friendly bonding activities such as—for example—movie nights, raffles to go to Eagles games, and lots of free food. Class hoodies are on the table too."
      ],
      "image": {
        "src": "../../../images/2023/nec/Steve-Yang.jpeg"
      }
    },
    {
      "name": "Alexza Zaragoza",
      "introduction": "Hello, Class of 2027!!  I am Alexza Zaragoza, a freshman in the College of Arts and Sciences with an intended major in cognitive science. I was born and raised in El Paso, Texas—a fun fact about me is that I can see the United States-Mexico border from my backyard.  I am excited to bring my unique border-town perspectives when working with others to make life at Penn an extraordinary experience. As part of the UA, I will advocate for change, whether it be through making student life more exciting or ensuring students are represented equally and have their voices heard. ",
      "platform points": [
        "PennCard: Add the option to digitize PennCards to be accessible through Apple Wallet or Google Pay. Increase the amount of temporary cards available per semester. ",
        "Dining: Implement an exchange system where extra meal swipes can be used as dining dollars and vice versa. Grab-and-go breakfast options at dining halls for students who have to eat before 7:30. ",
        "Safety: Provide free, optional self-defense and safety knowledge classes to all Penn students.  ",
        "Transportation: Expand Penn shuttle services to provide transportation in the greater Philly area. ",
        "Hydration: Add a water station on each floor of dorms and implement a system to ensure filters are changed constantly. "
      ],
      "image": {
        "src": "../../../images/2023/nec/Alexza-Zaragoza.jpeg"
      }
    },
    {
      "name": "Mackenzie Hill",
      "introduction": "Hi, y’all! My name is Mackenzie Hill. I’m originally from Alabama, but I’ve spent my whole summer at Penn in the Africana Institute, PFP, and PENNacle — which allowed me to explore campus and the things I plan to advocate for during my time here. From late night Canes runs, fro-yo after class, and debriefing in the dining halls (can you tell I like food?!) — community and food are core pillars of the Penn experience. Key pieces of my platform include: options for off-campus dining dollar/swipe usage, intercultural events with free food, and engaging Penn students all year long!",
      "platform points": [
        "Dining: Increase options for dining dollar and meal swipe usage off-campus (+ later dining hall hours) to alleviate the burden on dining hall staff and provide students with more options",
        "Culture: Intercultural and cross-college house social events with free food and (cute) merch",
        "Community: Building a more interconnected campus through events to foster an inclusive community, centralizing Penn’s resources for students to seek assistance, find events, and easily connect with everything on campus",
        "Access: Expand access to supplemental funds for things like textbooks, technology assistance, and other issues that especially affect the FGLI community while offering increased work-study opportunities across campus + improving Path@Penn",
        "Advocacy: Advocate for further resources allocated towards cleanliness and resource replenishment (paper towels, toilet paper, menstrual products) in campus bathrooms, more trash cans, and further options for returning Green2Go containers",
        "Engage: Provide Penn students with more opportunities to define their academic journey — funding towards underrepresented fields of study, events to connect with companies/organizations, and spaces to connect with faculty/peers"
      ],
      "image": {
        "src": "../../../images/2023/nec/Mackenzie-Hill.jpeg"
      }
    },
    {
      "name": "Chance Padlo",
      "introduction": "Chance Padlo is freshman in Wharton from a small town in Western New York.  After holding various leadership positions over the last few years, with his most significant role being his time as the VP of Finance and Communication for New York DECA, he hopes to continue his leadership legacy as a member of Penn’s student government.  Chance is passionate about representing students, serving their needs, and relaying their demands to higher administration.  He also loves embracing school spirit and social fun, whether it be through sporting events, traditions, or just random weekend events.",
      "platform points": [
        "Make new students feel welcome by bringing them out of their comfort zone.  Students should be encouraged to try new things, socialize if they don’t already, and learn to experiment a little.",
        "Strengthen school spirit by boosting morale.  Social media posts, handouts, and maybe some neat merch?  Anything to get students excited about not only repping Penn, but the freshman class as well!",
        "Promote under-represented clubs and lesser-known events in an organized manner.  People can only join or show up they know what is happening and when!"
      ],
      "image": {
        "src": "../../../images/2023/nec/Chance-Padlo.jpeg"
      }
    },
    {
      "name": "Harjasan Singh (Harj) ",
      "introduction": "Hello everyone! I'm Harjasan, your Vice-President of Finances candidate. My background, enriched by Italy's vibrancy and Milwaukee's grounded realism, has molded me into a financial strategist with a distinct flair for the extraordinary. Here's the deal: I'm not just a number cruncher—I'm your fiscal choreographer, making sure our class events dance perfectly between unforgettable experiences and economic sensibility. In voting for me, you're choosing the unique blend of artistry and accountability that every budget deserves. Vote for Harjasan—Turning Budgets into Unforgettable Experiences. ",
      "platform points": [
        "Finals Wellness Initiative: To mitigate heightened anxiety during finals, I'll coordinate with health services to offer specialized mental wellness workshops and resources, aimed at fostering resilience and stress management during critical academic periods.",
        "Transparent Tuition: Ever wonder where your tuition dollars go? I'll fight for a detailed, easy-to-understand breakdown of financial allocation, making sure every penny is accountable.",
        "Inclusive Club Environment: Addressing the hyper-competitiveness within campus clubs, I propose a refined Club Fair that emphasizes organizations committed to inclusivity and developmental growth over exclusive selectivity.",
        "Peer-to-Peer Budgeting App: Leverage the tech talent at UPenn to create a student-centered budgeting app. This app would allow students to set saving goals, track event costs, and even split bills for group activities, all within a UPenn community environment.",
        "Penn Transit Plus: Navigating campus can be a hassle. I propose extending Penn Transit services during exam seasons and adding stops at popular study spots, making student life a little easier.",
        "Therapeutic Animal-Assisted Assistance: In recognition of the heightened stress during critical exam periods, I propose the introduction of certified therapy dogs to designated study spaces. This initiative aims to improve focus and alleviate academic stress through proven therapeutic methods."
      ],
      "image": {
        "src": "../../../images/2023/nec/Harjasan-Singh-(Harj)-.jpeg"
      }
    },
    {
      "name": "Will Pallan",
      "introduction": "Hi! I’m Will Pallan, and here is the boring bio: from Balitmore, MD; College of Arts and Sciences; live on the 4th floor of Hill; enjoy playing tennis, listening to music, and camping.  I am running for Executive Vice President and New Student Rep. Let’s keep it chill, and vote for Will!",
      "platform points": [
        "-work with Penn Dining to expand weekend dining hours",
        "-more free merch!! (Penn '27 quarter zips, t-shirts, etc.)"
      ],
      "image": {
        "src": "../../../images/2023/nec/Will-Pallan.jpeg"
      }
    }
  ],
  "New Student Transfer Representative": [
    {
      "name": "Andrew Lu",
      "introduction": "Hey everyone! My name is Andrew and I am proud to be running to be your transfer representative. I’m a sophomore transfer from Northwestern, originally from Vancouver, Canada. I think we can all agree that being a transfer student is an overwhelming, daunting, and exhilarating shift in our lives. What I want to do is to give the transfer community a voice at Penn and fight for changes that you want to see. I believe in making this campus a better place for us and future transfers, and I’m super excited to help serve our community. ",
      "platform points": [
        "College House Transfer Communities: - Currently, only Rodin has a TSO community - Expansion to every high-rise, as the vast majority of transfers live elsewhere. - More bonding for transfers across campus",
        "Improving XCAT: - Create better documentation and workshops - Discussion with various departments about more efficient processing - Dedicated department contact points to speed up the process",
        "Emphasizing Junior Transfers: \n- More social events and initiatives devoted to Junior transfers\n- More involvement with previous upper class transfers",
        "Club Workshops: - Dedicated resources/mentors to help navigate Penn’s unique and competitive club application system (especially with Wharton clubs)",
        "Transfer Directory: - Access to a list of all participating previous transfers - Easy access to contacts for advice, similar interests, or questions",
        "Expanding the Transfer Critical Writing Seminar: - Create more classes and sections for transfer writing seminar - Curriculum and bonding tailored to the transfer experience"
      ],
      "image": {
        "src": "../../../images/2023/nec/Andrew-Lu.jpeg"
      }
    },
    {
      "name": "Kennedy Kostecki",
      "introduction": "My name is Kennedy Kostecki and I'm running as the UA transfer representative! I’m a sophomore in Wharton from New Jersey and transferred to Penn from BU. At BU, I was in the student governments Executive Branch and Senate where I learned how to effectively represent a student body. I was also Student Body and Class President in high school! Furthermore, I can add valuable perspective to the board as a first-gen student. I want to bring forward my experience and perspective to the UA to help support the transfer community and integrate our voices seamlessly into the student body.",
      "platform points": [
        "Equitable Club Opportunities: Allow transfers to be able to transfer into clubs they were in at previous schools. Open up seats to Junior transfers in clubs typically for freshman/sophomores. ",
        "Priority Tutoring: Give transfers priority access to tutoring services as many are coming from schools where pre-reqs covered different things, content was covered at different paces, etc.  ",
        "XCAT 2.0: Expedite XCAT requests so transfers have clarity when registering for courses. Appoint advisors to ensure requests are being accessed and decisions maximize the amount of credit transferred. ",
        "UA Diversity Engagement: Bolster under-represented voices at Penn by holding meetings/events with advocacy groups and the UA. This will foster conversations allowing the UA to better understand their needs.",
        "Reserved Class Seats: Registering later for classes causes many transfers to not have space in classes they wish to take. Having seats reserved for transfers could help solve this."
      ],
      "image": {
        "src": "../../../images/2023/nec/Kennedy-Kostecki.jpeg"
      }
    }
  ],
  "VP Internal": [
    {
      "name": "Mariam Kazmi",
      "introduction": "Hi! My name is Mariam, and I’m running for Vice President of Internal Affairs and New Student Representative. I love planning events that bring students together, and that’s what I hope to do for you all. I have experience in student government and would love to use it to strengthen the class of 2027. Specifically, I want our class to focus on community-building. Getting to know each other, connecting with those beyond only individuals in our houses, is so important to make the next four years as memorable as possible. I will lead to completion projects that fulfill this goal. ",
      "platform points": [
        "I will bring students from different houses together by hosting bonding activities for the entire class of 2027, such as football game prep days and fun filled snow days. ",
        "I hope to increase dining options for students by holding campus-wide cooking classes and providing free food during specific weeks of the school year, such as finals week. ",
        "As specific to my role, I will ensure that all projects are appropriately divided amongst team members and followed through to completion. ",
        "To ensure we make the most out of the city we attend school in, I will lead a project to create a guide of city activities that are easily accessible."
      ],
      "image": {
        "src": "../../../images/2023/nec/Mariam-Kazmi.jpeg"
      }
    },
    {
      "name": "Nicholas Kwok",
      "introduction": "Heyy, it’s Nick Kwok (no, not my twin Chris) from California :)) I’m running to be your Vice President of Internal Affairs for three reasons: 1) we have a reputation to uphold as the “Social-Ivy” 2) I understand, clubs and classes are intense, I want to ease that stress 3) let’s place our tuition fees towards good use: better food, friendlier staff?! My friends say I’m a screenager (and I cannot lie)… message me @itsnicholaskwok for anything–I will reply in seconds, PROMISE! Join me in making this campus our home away from home. Vote for Nick, He’s Your Pick!",
      "platform points": [
        "Make dining dollars ubiquitous around campus restaurants (i.e. Franklin’s Table), require all shops at Houston Hall to accept swipes (i.e. Bento), and offer more dining options for purchase",
        "Organize intra-Ivy League (and cross-Philly schools) social events for students to make connections outside UPenn, as well as host more off-campus, class-wide social events like those during NSO",
        "Improve student-to-admin interactions, particularly in dorm and dining spaces, by establishing a more effective, anonymous report and response system to address poor and rude service",
        "Enhance the classroom learning environment by replacing online assignments, like video lectures sourced from YouTube, with in-person activities to boost engagement; have professors give more leniency to sick students",
        "EQUITY: Ensure that students are treated equally regardless of race, sexuality… this includes which school we attend and which housing we are in (access to the same amenities and opportunities)"
      ],
      "image": {
        "src": "../../../images/2023/nec/Nicholas-Kwok.jpeg"
      }
    }
  ],
  "VP External": [
    {
      "name": "Lucas Zhu",
      "introduction": "Hello! My name is Lucas Zhu and I’m running for UA and VP of External Affairs. I am a political science major hailing from Livingston, New Jersey. You may know me as the kid who tries to name all your state and local politicians, and I now hope to be added to that list of your leaders. From transportation to dining, I have a variety of ideas for Penn, but I will always listen to all opinions and concerns. I would be honored to earn your vote so we can improve our school and student body together!",
      "platform points": [
        "Dining: Expanding the number of locations where students can use dining dollars, especially at local restaurants. ",
        "Transportation: Working with SEPTA to obtain greater discounts for Penn students on public transportation.  ",
        "Student Voices: Distributing more surveys and places to leave suggestions where students can express their opinions about various policies and events, whether it be food, housing, or activities.",
        "Events: Hosting more social events in downtown Philadelphia, particularly during stressful times of the school year.",
        "Hydration: Increasing the number of hydration stations in residence halls and around campus.",
        "Health: Including hand sanitizers in every classroom to keep students safe from various germs and viruses."
      ],
      "image": {
        "src": "../../../images/2023/nec/Lucas-Zhu.jpeg"
      }
    }
  ],
  "Sas Chair": [
    {
      "name": "Nicole Muravsky ",
      "introduction": "As a New Student Representative during my freshman year and now an Associate Member, I’ve built rapport with administration and students, while navigating the logistics of how student government works. I’ve advocated for minority groups, orchestrated discussions between students and faculty beyond the classroom, gathered input on Penn’s new Sustainability Plan, promoted opportunities for community service, and currently have plans in the working to increase DEI efforts across campus. I want to represent your needs and accomplish what you want to see done. Let's work together to make tangible changes to Penn for the better!",
      "platform points": [
        "Facilitate connections between students and faculty beyond the classroom, especially through the Penn Mentor Meals Program ",
        "Promote DEI in all aspects of Penn, especially through social justice workshops. I’ll work with the minority coalition groups in the 7B to encourage change fitted to the groups’ needs.",
        "Collaborate on the Climate and Sustainability Action Plan 3.0. Serving on SAGE, I will provide to the administrators your input to adjust the plan before it goes into effect.",
        "Bridge the school’s administration with students by making administration and UA efforts more transparent. From today, all of my interactions for UA will be documented on this Doc: https://docs.google.com/document/d/1dOA5UIrWCtYMb4GNFVJsT6-orB2HCUnEQMNh4vmtMtM/edit?usp=sharing",
        "Actively question and listen to students’ wants regarding change and avoid remaining complacent. If you have any questions or concerns or ideas, please reach out to me at nmurav@sas.upenn.edu. "
      ],
      "image": {
        "src": "../../../images/2023/nec/Nicole-Muravsky-.jpeg"
      }
    },
    {
      "name": "Natasha Kobelsky",
      "introduction": "Hi guys! I'm Natasha, and I'm running for Class Board because I love school spirit and would really love the chance to contribute to connecting the Penn community on a deeper, school-wide level. I'm currently on the women's rowing team and am super into singing and writing music, and I just want to make Penn a more fun and exciting place for the future :) Feel free to find me on socials, I'm @natashakobelsky on Instagram and .natasharenee on TikTok. I hope to be able to represent you this year!!! ",
      "platform points": [
        "1. I Want To Encourage More Student-Athlete Representation and Involvement",
        "2. More Cross-College Unity and Connection",
        "3. Start an Initiative for Adding PennCards to an Apple Wallet ",
        "4. Supporting the Performing Arts with More Campus Gigs and Events",
        "5. More Community Service Events in Philadelphia",
        "6. Open Study Support and Improved Peer Tutoring Access"
      ],
      "image": {
        "src": "../../../images/2023/nec/Natasha-Kobelsky.jpeg"
      }
    },
    {
      "name": "Ben Kassan",
      "introduction": "Hello, fellow members of the College! I am Ben. I am from New York City. As the largest and most diverse part of Penn, the College needs a stronger community. We need more aspects of Penn directed towards the betterment of our college life and overall success. Big renovations are needed to make us feel like an important part of the Penn community. I will be your voice for these changes. I hope to stand with you for any issue you feel holds the College back and tackle it in a pragmatic way.",
      "platform points": [
        "College GSRs",
        "Greater use of dining dollars",
        "NSO College bonding",
        "College Mentors",
        "Citi Bikes",
        "CAS Merch"
      ],
      "image": {
        "src": "../../../images/2023/nec/Ben-Kassan.jpeg"
      }
    }
  ]
}