[
  {
    "section": "FOOD",
    "description": "From boba to burgers, these are Penn students’ favorite places to eat and drink. Here are the Best of Penn 2021 winners for the category Food.",
    "items": [
      {
        "category": "BEST BRUNCH",
        "place": "Sabrina’s Cafe",
        "blurb": "Sabrina’s Cafe, located near Drexel University, is known for its extensive brunch menu, including a tasty tofu scramble and multiple savory burger options. It also offers a variety of classic dishes, such as french toast, waffles, and eggs benedict, as well as vegan options.",
        "address": "227 N 34th St.",
        "hours": "Monday  – Sunday: 8 a.m. – 3 p.m",
        "img": {
          "src": "../../../images/2021/best-of-penn-fall/Sabrina's.jpg"
        }
      },
      {
        "category": "BEST VEGAN",
        "place": "Honeygrow",
        "blurb": "Honeygrow, which originated here in Philadelphia, offers a variety of customizable salads and stir-fry noodle options. Due to its proximity to many campus buildings, it's the perfect place to grab lunch with friends between classes. Be sure to try out their signature “honey bar” bowl with your picks of fruit, honey, and toppings!",
        "address": "3731 Walnut St.",
        "hours": "Monday–Thursday: 10:30 a.m. – 11 p.m., Sunday: 10:30 a.m. – 9 p.m.",
        "img": {
          "src": "../../../images/2021/best-of-penn-fall/Honeygrow.jpg"
        }
      },
      {
        "category": "BEST PIZZA",
        "place": "&pizza",
        "blurb": "This year, &pizza’s personalized pizza options are especially lauded by Penn students. With its famous $3 pizza promotions and partnerships for fundraisers with clubs, &pizza has become a crowd favorite. Their crust is done in a thin-crust and oval style, which sets it apart from other pizzas in University City.",
        "address": "3925 Walnut St.",
        "hours": "Monday – Sunday: 11 a.m. – 10 p.m.",
        "img": {
          "src": "../../../images/2021/best-of-penn-fall/&Pizza.jpg"
        }
      },
      {
        "category": "BEST FOOD TRUCK",
        "place": "Lyn’s Breakfast and Lunch Truck",
        "blurb": "Lyn’s serves some of the best breakfast sandwiches, chicken pitas, and cheesesteaks. Not only is Lyn’s food delicious, but she also has a knack for memorizing students’ names and orders — talk about personalized service! So, come down to the Quad, and get a bite at Lyn’s!",
        "address": "36th and Spruce streets, outside the lower Quad",
        "hours": "Monday – Friday: 7 a.m. – 3 p.m.",
        "img": {
          "src": "../../../images/2021/best-of-penn-fall/Lyn's.jpg"
        }
      },
      {
        "category": "BEST CHINESE FOOD",
        "place": "Dim Sum House by Jane G’s",
        "blurb": "Want to try the best Chinese food on campus? Located at 3939 Chestnut St, Dim Sum offers an intimate atmosphere to enjoy authentic Chinese food with friends. You can try their delicious pork soup dumplings, lo mein, and shrimp shumai. Dim Sum House offers lunch specials during weekdays from 12-3PM, so be sure to take advantage!",
        "address": "3939 Chestnut St.",
        "hours": "Tuesday – Thursday, Sunday: 12 p.m. – 8:45 p.m.; Friday – Saturday: 12 p.m. – 9:45 p.m.",
        "img": {
          "src": "../../../images/2021/best-of-penn-fall/DimSumHouse.png"
        }
      },
      {
        "category": "BEST JAPANESE FOOD",
        "place": "Terakawa",
        "blurb": "Want to try some amazing ramen? Go out and try Terakawa Ramen! Terakawa’s specialties are ramen dishes, which are perfect for warming up in the cold weather at Penn. Terakawa also offers vegetarian options for their curry platters and ramen noodles. Terakawa is always booming with customers, as they frequently update their menu with new options, so be sure to stop by often!",
        "address": "125 S 40th St.",
        "hours": "Tuesday – Thursday and Sunday: 11:30 a.m. – 9:45 p.m., Friday – Saturday: 11:30 a.m. – 10:45 p.m.",
        "img": {
          "src": "../../../images/2021/best-of-penn-fall/Terakawa.jpg"
        }
      },
      {
        "category": "BEST LATE NIGHT",
        "place": "Allegro Pizza and Grill",
        "blurb": "Pulling an all-nighter? Looking for a quick, late-night bite? Allegro Pizza and Grill is a convenient place to grab a slice with friends long after midnight. Allegro, located right next to the High Rises, is open to serve many Italian classics. Allegro’s late-night hours, close location, and affordable pizza make it a student favorite for Penn students!",
        "address": "3942 Spruce St.",
        "hours": "Sunday – Wednesday: 9 a.m. – 12 a.m., Thursday – Saturday: 9 a.m. – 3 a.m.",
        "img": {
          "src": "../../../images/2021/best-of-penn-fall/Allegro.jpg"
        }
      },
      {
        "category": "BEST KOREAN FOOD",
        "place": "Koreana",
        "blurb": "Koreana, located at 3801 Chestnut St., offers an expansive menu of Korean dishes, including dolsot and cup bap. Particularly, some Penn student favorites are the triangle kimbap and the wings, which are available in spicy, soy, and half-and-half flavors. Koreana also offers thirst-quenching bubble tea!",
        "address": "3801 Chestnut St.",
        "hours": "Tues – Saturday: 11:30 a.m. – 9 p.m.",
        "img": {
          "src": "../../../images/2021/best-of-penn-fall/Koreana.jpg"
        }
      },
      {
        "category": "BEST INDIAN FOOD",
        "place": "New Delhi",
        "blurb": "Are you looking to try some awesome Indian food at an affordable price? New Delhi, which has been serving Philadelphia for over 30 years, offers an extensive buffet option of Indian cuisine all week long! Come to New Delhi and enjoy the variety of dishes they offer with friends!",
        "address": "4004 Chestnut St.",
        "hours": "Tuesday – Thursday and Sunday: 11:30 a.m. – 9 p.m., Friday – Saturday: 11:30 a.m. – 10 p.m.",
        "img": {
          "src": "../../../images/2021/best-of-penn-fall/NewDelhi.jpg"
        }
      },
      {
        "category": "BEST SOUTHEAST ASIAN",
        "place": "Pattaya",
        "blurb": "Pattaya offers a wide range of Thai dishes, with a hint of French influence. They serve traditional Thai dishes, but also specialty menu options such as a rack of lamb or alligator. Their dessert options include mango sticky rice, crispy banana rolls, and thai coconut pudding. Recently, they moved to a brand new location, so consider checking them out!",
        "address": "4040 Locust St.",
        "hours": "Monday – Thursday: 11 a.m. – 3 p.m. and 5 – 9 p.m., Friday: 11 a.m. – 3 p.m. and 5 p.m. – 10 p.m., Saturday: 5 – 10 p.m., Sunday: 5 – 9 p.m.",
        "img": {
          "src": "../../../images/2021/best-of-penn-fall/Pattaya.jpg"
        }
      },
      {
        "category": "BEST DESSERT",
        "place": "Paris Baguette & Insomnia Cookies",
        "blurb": "Incredibly, there are two winners for the best dessert place this year! Paris Baguette and Insomnia Cookies were both evenly split when it came to Penn student choice. Both have their own unique qualities: Paris Baguette features a variety of cakes and pastries and is a great place to study, catch up with friends, or end the evening. Located inside Houston Hall, Insomnia Cookies offers a variety of warm cookie options until 3 a.m. on Fridays and Saturdays.",
        "address": "Insomnia: 3417 Spruce St.\n Paris Baguette: 3816 Chestnut St.",
        "hours": "Insomnia: Monday – Thursday: 11 a.m. – 1 a.m., Friday: 11 a.m. – 3 a.m., Saturday: 12 p.m. – 3 a.m., Sunday: 12 p.m. – 1 a.m.\nParis Baguette: Monday – Sunday: 8 a.m. – 9 p.m.",
        "img": {
          "src": "../../../images/2021/best-of-penn-fall/ParisBaguette.jpg"
        }
      },
      {
        "category": "BEST BURGER",
        "place": "Shake Shack",
        "blurb": "Shake Shack offers modern, quick dining with a multitude of burger choices, crispy fries, and milkshakes. They also have a refreshing set of juices to choose from. If you’re vegetarian, don’t fret because Shake Shack offers an appetizing shroom burger. Stop by this holiday season to check out their holiday milkshakes, such as their Sugar Plum Fairy Shake.",
        "address": "3200 Chestnut St.",
        "hours": "Sunday – Wednesday: 11 a.m. – 10 p.m., Thursday – Saturday: 11 a.m. – 11 p.m.",
        "img": {
          "src": "../../../images/2021/best-of-penn-fall/ShakeShack.png"
        }
      },
      {
        "category": "BEST SALAD",
        "place": "Sweetgreen",
        "blurb": "Sweetgreen is located at 39th and Walnut streets, below the Radian. Offering both warm bowls and signature salads, sweetgreen is the perfect place to stop for a healthy meal on the go. Check out their selection of seasonal salads!",
        "address": "3925 Walnut St.",
        "hours": "Monday – Sunday: 10:30 a.m. – 8 p.m.",
        "img": {
          "src": "../../../images/2021/best-of-penn-fall/Sweetgreen.png"
        }
      },
      {
        "category": "BEST GRAB AND GO",
        "place": "Chipotle",
        "blurb": "In a time crunch? Stop by Chipotle to create your own bowl, burrito, taco, salad, or quesadilla! It is the perfect lunch or dinner option for college students who are looking for a filling, quick, convenient meal. Be sure to try their new smoked brisket and avoid long lines by ordering ahead of time on their app.",
        "address": "3925 Walnut St.",
        "hours": "Monday – Sunday: 10:45 a.m. – 10 p.m.",
        "img": {
          "src": "../../../images/2021/best-of-penn-fall/Chipotle.jpg"
        }
      },
      {
        "category": "BEST HOUSTON HALL",
        "place": "Bento",
        "blurb": "Overwhelmed by the vast options at Houston Market? Looking for a balanced and healthy meal to get with your Dining Dollars? Check out Bento, this year’s Best Houston Market Place! Bento serves a variety of convenient Asian meals, including sushi, ramen, and rice bowls. We recommend pairing your meal with Ramune, a Japanese soft drink, that’s offered at Bento!",
        "address": "3417 Spruce St.",
        "hours": "Monday – Thursday: 11 a.m. – 7 p.m., Friday: 11 a.m. – 5 p.m., Sunday: 12 p.m. – 7 p.m.",
        "img": {
          "src": "../../../images/2021/best-of-penn-fall/Bento.jpeg"
        }
      },
      {
        "category": "BEST MEXICAN",
        "place": "Don Barriga",
        "blurb": "Located at the corner of 45th and Spruce, Don Barriga offers a variety of Mexican dishes at a very affordable price. Come for the free chips and salsa, and stay for the delicious burritos, tacos, and enchiladas! Stop by for some authentic Mexican cuisine.",
        "address": "4443 Spruce St.",
        "hours": "Mon - Thu 10 a.m. - 10 p.m., Fri - Sat 10 a.m. - 11 p.m., Sunday 10 a.m. - 9:00 p.m.",
        "img": {
          "src": "../../../images/2021/best-of-penn-fall/Don Barriga.jpg"
        }
      }
    ]
  },
  {
    "section": "DRINKS",
    "items": [
      {
        "category": "BEST COFFEE",
        "place": "Starbucks",
        "blurb": "With four locations near or on campus, it is no surprise that Starbucks is Penn’s vote for the best coffee. Starbucks offers convenience on the go, with a mobile app that allows customers to pick up their coffee quickly. With their expansive menu, Starbucks is the perfect place to grab your regular coffee or try one of their seasonal drinks! Consider ordering their newest release: the sugar cookie almond milk latte!",
        "address": "Various",
        "hours": "Various",
        "img": {
          "src": "../../../images/2021/best-of-penn-fall/Starbucks.jpg"
        }
      },
      {
        "category": "BEST BYO",
        "place": "Don Barriga",
        "blurb": "Looking to host your club’s next BYO or get together off campus? Look no further than Don Barriga, located on the corner of 45th and Spruce streets! Bring your favorite drink to pair with Don Barriga’s large selection of Mexican dishes.",
        "address": "4443 Spruce St.",
        "hours": "Mon - Thu 10 a.m. - 10 p.m., Fri - Sat 10 a.m. - 11 p.m., Sunday 10 a.m. - 9:00 p.m.",
        "img": {
          "src": "../../../images/2021/best-of-penn-fall/Don Barriga.jpg"
        }
      },
      {
        "category": "BEST BOBA",
        "place": "TeaDo",
        "blurb": "Looking for a refreshing drink? Stop by TeaDo! Their menu offers an assortment of milk bubble teas and fruity teas, so everyone can discover their new favorite drink. If you are also looking for a quick bite, come try out their onigiris or takoyaki. Grab a drink, a straw, and a comfy seat at TeaDo!",
        "address": "3816-36 Chestnut St.",
        "hours": "Monday – Sunday: 11 a.m. – 10 p.m.",
        "img": {
          "src": "../../../images/2021/best-of-penn-fall/TeaDo.jpg"
        }
      },
      {
        "category": "BEST HAPPY HOUR",
        "place": "Louie Louie",
        "blurb": "Louie Louie is an American bistro with a French flair, located in the lower lobby of the Inn at Penn. Louie Louie operates a large bar and lounge, complete with custom lux seating. Their happy hours are from 3 p.m. – 6 p.m., Monday through Friday, and they offer a range of discounted drink and food options.",
        "address": "3611 Walnut St.",
        "hours": "Monday – Thursday: 11:30 a.m. – 9 p.m., Friday: 11:30 a.m. – 9:30 a.m., Saturday: 10 a.m. – 9:30 p.m., Sunday: 10 a.m. – 8 p.m.",
        "img": {
          "src": "../../../images/2021/best-of-penn-fall/LouieLouie.jpg"
        }
      },
      {
        "category": "BEST STARBUCKS LOCATION",
        "place": "Stommons",
        "blurb": "The Starbucks at 1920 Commons is not only conveniently located near the High Rises, but it also serves as a great place to unwind, study, and enjoy coffee. Whether you order in person or through the Penn Mobile App, you can rest assured that you will be getting quality coffee and the best of the speciality drinks.",
        "address": "3800 Locust Walk, 1920 Commons",
        "hours": "Monday  – Thursday: 8 a.m. – 11:30 p.m., Friday: 8 a.m. – 9:30 p.m., Saturday: 11 a.m. – 6:30 p.m., Sunday: 11 a.m. – 11:30 p.m.",
        "img": {
          "src": "../../../images/2021/best-of-penn-fall/Stommons.jpg"
        }
      },
      {
        "category": "BEST DRINKS",
        "place": "Distrito",
        "blurb": "For the best drinks on campus, visit Distrito on the corner of 40th and Chestnut. Take advantage of the discounts on mixed drinks, appetizers, and other beverages by going during happy hour from 4 p.m. – 6 p.m., Tuesday through Saturday. Distrito offers both indoor and outdoor seating, so check the weather and latest guidelines before you call ahead.",
        "address": "3945 Chestnut St.",
        "hours": "Tuesday – Saturday: 4 p.m. – 9 p.m.",
        "img": {
          "src": "../../../images/2021/best-of-penn-fall/DistritoDrink.jpg"
        }
      }
    ]
  },
  {
    "section": "UNIVERSITY LIFE",
    "description": "Check out Penn students' top picks for date spots, on-campus and off-campus dorms, and places to stay all night studying.",
    "items": [
      {
        "category": "BEST DATE SPOT",
        "place": "Cira Green",
        "blurb": "Labeled as Philadelphia’s Park in the Sky, Cira Green is the perfect spot to have a first date. Whether you choose to attend a big-screen movie night, have a picnic, or drink a few cocktails, you are sure to have a great time. Cira Green is open year-round and offers breathtaking views of the Philadelphia skyline, along with expansive green spaces on which you can lounge.",
        "address": "129 S 30th Street",
        "hours": "Monday – Thursday: 7 a.m. – 10 p.m., Friday – Saturday: 7 a.m. – 11 p.m., Sunday: 7 a.m. – 9 p.m.",
        "img": {
          "src": "../../../images/2021/best-of-penn-fall/CiraGreen.jpg"
        }
      },
      {
        "category": "BEST FIRST-YEAR DORM",
        "place": "The Quad",
        "blurb": "As one of the most recognizable landmarks on campus, the Quad has been the first destination for many Penn first years since 1895. Students living in the Quad are grouped into three college houses: Fisher-Hassenfeld, Ware, and Riepe. Known for providing the “first-year experience,” these college houses may be the perfect place for those looking to explore the social scene at Penn. The Quad will soon undergo a $200 million renovation, which is expected to be completed by 2027.",
        "address": "3700 Spruce St.",
        "img": {
          "src": "../../../images/2021/best-of-penn-fall/Quad.jpeg"
        }
      },
      {
        "category": "BEST UPPERCLASSMEN DORM",
        "place": "New College House West",
        "blurb": "This semester, New College House West opened its doors to 430 sophomores, juniors, and seniors. Layouts include doubles, quads, and five- to six-person suites. Some of the amenities include communal lounge areas, music rooms, an in-house coffee bar, and kitchens. New College House West also offers open spaces to have a picnic or play some spike ball with friends. Last but not least, don’t forget to check out the Quaker Kitchen for cooking classes led by Chef Daniel Stern and Penn Dining.",
        "address": "201 S. 40th St.",
        "img": {
          "src": "../../../images/2021/best-of-penn-fall/NCHW.jpg"
        }
      },
      {
        "category": "BEST NAIL SALON",
        "place": "Luxe Nail Bar",
        "blurb": "Luxe Nail Bar is the perfect place to get a manicure or pedicure before a night out! They offer a variety of services ranging from gel color nails, SNS dipping powder, and acrylic nails. Notable for their friendly and skilled staff, you will definitely have a great experience here!",
        "address": "212 S. 40th St.",
        "img": {
          "src": "../../../images/2021/best-of-penn-fall/LuxeNailBar.jpg"
        }
      },
      {
        "category": "BEST APARTMENT AMENITIES",
        "place": "The Chestnut",
        "blurb": "The Chestnut is a popular apartment complex for upperclassmen who wish to move off campus. It offers one- or two-bedroom apartment plans with floor-to-ceiling windows, open kitchens with islands, and wood floors. The Chestnut also includes amenities such as co-working spaces, a rooftop pool, and a fitness center.",
        "address": "3720 Chestnut St.",
        "img": {
          "src": "../../../images/2021/best-of-penn-fall/TheChestnut.jpg"
        }
      },
      {
        "category": "BEST STUDY SPOT",
        "place": "Van Pelt Library",
        "blurb": "There is a sacred study nook for every student at Van Pelt Library. Want to see views of Philadelphia and Fisher Fine Arts Library as you cram for your midterms? Check out the quiet and secluded sixth floor. Want to get some late-night studying in? The undergraduate study center located on the ground floor is open 24 hours Monday through Thursday. Be sure to grab a quick bite at Mark’s Cafe to refuel!",
        "hours": "Monday – Thursday: 8:30 a.m. – 12 a.m., Friday: 8:30 a.m. – 9 p.m., Saturday: 10 a.m. – 6 p.m., Sunday : 10 a.m. – 12 a.m.",
        "img": {
          "src": "../../../images/2021/best-of-penn-fall/VanPelt.jpg"
        }
      },
      {
        "category": "BEST PENN ATTRACTION",
        "place": "Ben Franklin Statue (College Hall)",
        "blurb": "Justus Clayton Strawbridge, of Strawbridge’s department stores, commissioned the Ben Franklin statue in 1896. It was sculpted by John J. Boyle and was unveiled in front of College Hall on Jan. 21, 1939 with University President Thomas Sovereign Gates on site. Legend says that The Button, located directly across from the statue, popped off the coat of this Ben Franklin statue.",
        "img": {
          "src": "../../../images/2021/best-of-penn-fall/BenFranklinStatue.jpg"
        }
      },
      {
        "category": "BEST PENN ARCHITECTURE",
        "place": "Fisher Fine Arts Library",
        "blurb": "Fisher Fine Arts Library is one of the most recognizable buildings on the University of Pennsylvania’s campus. Designed by Frank Furness in the late 19th century, the red sandstone building is based on Venetian Gothic architecture. This beautiful building was listed on the National Register of Historic Places in 1972 and named a National Historic Landmark in 1985.",
        "img": {
          "src": "../../../images/2021/best-of-penn-fall/FisherFineArts.jpg"
        }
      }
    ]
  },
  {
    "section": "LIVING",
    "description": "Trying to determine the best place to live? Best of Penn 2021 Living section asks the important questions.",
    "items": [
      {
        "category": "BEST OFF CAMPUS HOUSING",
        "place": "Campus Apartments",
        "blurb": "Penn students have named Campus Apartments the Best of Penn Off Campus Housing winner for 2021. Campus Apartments has properties all over University City, making it easy to find the best options for living off-campus. Call the leasing office at (215) 382-1300 or look online at livecampusapts.com to see the properties for yourself.",
        "img": {
          "src": "../../../images/2021/best-of-penn-fall/CampusApartments.jpg"
        }
      },
      {
        "category": "BEST APARTMENT BUILDING AMENITIES",
        "place": "Domus",
        "blurb": "Looking for the best amenities when deciding on an apartment building? Domus, on the corner of 34th and Chestnut, offers access to a pool, fitness center, parking garage, and even a movie theater. Domus is close to both Penn and Drexel’s campuses, and hosts a grocery store, Heirloom Market, on the first floor of the building.",
        "address": "34th and Chestnut St.",
        "img": {
          "src": "../../../images/2021/best-of-penn-fall/Domus.jpg"
        }
      }
    ]
  },
  {
    "section": "BEAUTY",
    "description": "Whether you’re getting ready for a night out in the city or just want to relax with a foot massage, the beauty section gives you insight into student favorites for haircuts and nails.",
    "items": [
      {
        "category": "BEST PLACE TO GET YOUR NAILS DONE",
        "place": "Luxe Nail Bar",
        "blurb": "Luxe Nail Bar, on 212 S 40th St, is the place to go to get your nails done at Penn. The nail salon offers a full suite of services from acrylic, dip powder, 3D design, gel, and more! Customers rave about the friendliness and service of the staff. Luxe Nail Bar offers reservation services, so call ahead to make an appointment today for a truly de-Luxe spa experience.",
        "address": "212 S 40th St.",
        "hours": "Mon-Wed: 10AM-7PM , Thurs-Fri: 10AM-8PM, Sat: 10AM-6PM Sun: Closed",
        "img": {
          "src": "../../../images/2021/best-of-penn-fall/LuxeNailBar.JPG"
        }
      },
      {
        "category": "BEST HAIRCUT",
        "place": "Joseph Anthony Hairstyling",
        "blurb": "Joseph Anthony Hairstyling, on the corner of 38th and Walnut is the Best Haircut at Penn 2021 winner. By appointment or by walk-in, Joseph Anthony’s barbers offer haircuts for women and men, along with tanning and waxing services. The friendly barbers and short wait make Joseph Anthony the perfect place for stylish and quick cut for college students.",
        "address": "38th and Walnut St.",
        "hours": "Mon-Fri: 9AM-6PM, Sat: 9AM-5PM, Sun: Closed",
        "img": {
          "src": "../../../images/2021/best-of-penn-fall/JosephAnthony.JPG"
        }
      }
    ]
  }
]
