{
  "VP Internal": [
    {
      "platform points": [
        "Help develop in-person, class-wide mindfulness programming as we return from the pandemic. ",
        "Facilitate CB planning for a senior year Hey Day in person.",
        "Now that our grade can, partner with local bars to host class-wide discounts and events."
      ],
      "name": "JJ Kampf",
      "introduction": "My name is JJ Kampf, and I'm from Memphis, TN studying computer science and philosophy in Engineering. I'm running for re-election because I love The Class of 2022. I've served on Class Board since sophomore year, and it still makes me smile when I see students walking around in Q-Zips and P-Sweaters because I know how hard CB works to push those distributions out. We've been through so much together, and I'm running again to cap it all off with a senior year that we'll never forget. ",
      "facebook url": "",
      "instagram handle": "",
      "campaign website": "",
      "youtube video url": "",
      "image": {
        "src": "../../../images/2020/NEC/elena-miller.jpeg"
      },
      "image name": "elena-miller.jpeg "
    }
  ],
  "College Chair": [
    {
      "platform points": [
        "1) Unity: 1. Being able to meet more people in our class 2. Sharing our talents and hobbies with others 3. Fostering new friendships and supporting one another",
        "2) Wellness: 1. Spreading awareness and sharing resources for mental health 2. Creating projects/events to decrease stress levels/feelings of loneliness",
        "3) Advocacy for Underrepresented Groups: 1. Being able to support the voices that struggle to be heard by spreading awareness 2. Having table talks/discussions to educate and share our perspectives 3. Donating to organizations that need our support"
      ],
      "name": "Heewon Kim",
      "introduction": "Hey, Juniors! My name is Heewon Kim, and I’m running for re-election for Class Board 2022 College Chair. From P Sweaters to recipe contests and more, I loved seeing your guys’ positive responses, and I want to create more meaningful events for you all, especially for our last year at Penn. I also want to be able to have the voice and the power to represent each and one of you. It has been a privilege to serve such incredible people, and I would love the opportunity to serve once again. Vote HEEWON KIM for College Chair!",
      "facebook url": "https://www.facebook.com/heewon.kim.3152/",
      "instagram handle": "heewoniekim",
      "campaign website": "",
      "youtube video url": "",
      "image": {
        "src": "../../../images/2020/NEC/elena-miller.jpeg"
      },
      "image name": "elena-miller.jpeg "
    }
  ],
  "Nursing Chair": [
    {
      "platform points": [
        "Advocate and represent you!",
        "Celebrate Penn traditions!",
        "Make our last year a memorable one!"
      ],
      "name": "Damaris Chaidez",
      "introduction": "Hi everyone! I'm very excited to run for re-election as Nursing Class Chair for Class Board 2022. I've had the pleasure of representing you all this past year and will hope you allow me to do so for our last year! Here's to making our last year at Penn an unforgettable one! <3",
      "facebook url": "https://www.facebook.com/damarisxchaidez/",
      "instagram handle": "damaris.c",
      "campaign website": "",
      "youtube video url": "",
      "image": {
        "src": "../../../images/2020/NEC/elena-miller.jpeg"
      },
      "image name": "elena-miller.jpeg "
    }
  ]
}
