{
  "President": [
    {
      "platform points": [
        "Entertainment-Based Programming - This year, I experimented with new, creative programming centered around entertainment compared to previous event-based programming. Finding it more engaging, I will continue organizing this type of programming.",
        "Guaranteed Merch - Despite unexpected issues arising from the pandemic, I still delivered you your merch this year. I want to explore new, original merch options when we return to campus.",
        "Local Collaboration - This past year, I collaborated with other student groups and organizations at Penn to offer you additional programming value and opportunities. I will continue the trend next year.",
        "Inter-School Programming - I connected with other 2023 Student Governments at other colleges this year, such as Stanford and Princeton. I plan to host unique collaborative programming with them next year.",
        "More Giveaways - I realized that a considerable portion of our budget, when not used for events, can be repurposed to offer many more exciting giveaways and prizes to the class.",
        "Targeted Events - I want to organize more significant events, using input and feedback from the class, that is much more engaging and indicative of what you truly want."
      ],
      "name": "Derek Nhieu",
      "introduction": "I'm Derek, and I'm running for re-election to serve as your Class Board President. I want to continue doing my very best to serve you and our class. Despite the pandemic, I've strived to adapt our Board to fit your needs and wants by exploring creative options and shifting our programming and events in new directions. This upcoming year will likely be a tricky one as we transition back into normal operations. Nevertheless, I promise you that I will use all my past knowledge and experience, and give it my all, to offer you the service you deserve.",
      "facebook url": "https://www.facebook.com/derek.nhieu",
      "instagram handle": "nhieuandimproved",
      "campaign website": "",
      "youtube video url": "",
      "image": {
        "src": "../../../images/2021/NEC/Derek-Nhieu.jpeg"
      },
      "image name": "Derek-Nhieu.jpeg"
    }
  ],
  "Executive VP": [
    {
      "platform points": [
        "Increasing Engagement: I want to make sure that as many members of our class as possible feel involved or engaged in class-wide activities/events. It's very important that we leave no individual in our class alone.",
        "Supporting Minorities & POC: As a POC, I have found a great community at Penn, and I hope to push for greater inclusion within the UA to amplify minority voices.",
        "Mental Health: I would like to work on a project that helps each of our class members check in on each other throughout the semester, possibly working with CAPS. This could be through forums or platforms such as GroupMe."
      ],
      "name": "Joel Olujide",
      "introduction": "Hi! My name is Joel and I'm back again, running to be your Class Board Executive Vice President! I've really enjoyed serving this past semester to help create programming for our class and facilitate spaces for all of us to come together. I hope to continue to support our class as new challenges arise, and to make sure that we enjoy every moment we have while we're at Penn!",
      "facebook url": "",
      "instagram handle": "joelolujide",
      "campaign website": "",
      "youtube video url": "",
      "image": {
        "src": "../../../images/2021/NEC/Joel-Olujide.jpeg"
      },
      "image name": "Joel-Olujide.jpeg"
    }
  ],
  "VP Internal": [
    {
      "platform points": [
        "Mental health is of utmost importance. Along with emphasizing CAPS resources, I want to partner with on-campus organizations (e.g. Penn Benjamins) and make such resources more known. ",
        "With Spring bringing warm weather, I want to bring more fun, socially-distanced, outdoor events. Goat yoga? Field day? More puppies? I got you. ",
        "More merch options! Stickers, hats, tote bags--the sky's the limit. I will also continue pushing for more financial aid and to incorporate your guys’ amazing designs as well!",
        "Uplifting diversity in our class is extremely important. I will encourage partnership with more multicultural organizations to hold more inclusive events, such as an international food festival and fashion show.",
        "More events with free food (and free merch?!) :)",
        "I plan to emphasize and increase communication. Ultimately, I want to hear what YOU want for a memorable year, and I will do my best to make that happen! "
      ],
      "name": "Abbie Chan",
      "introduction": "Hi guys! I’m Abbie Chan, and I’m excited to be running for re-election as VP of Internal Affairs. This past year has been quite unusual, but it has made me realize the importance of unity as a class and as individuals. Despite this unpredictable situation we are in, I want to ensure that everyone stays connected and included by bringing fun, unique, and safe ideas/events. I hope to continue supporting our class to grow as a community and upholding our morals in diversity and well-being. I want to be a listening ear to make sure your voices are heard :)",
      "facebook url": "",
      "instagram handle": "abbiechan_",
      "campaign website": "",
      "youtube video url": "",
      "image": {
        "src": "../../../images/2021/NEC/Abbie-Chan.jpeg"
      },
      "image name": "Abbie-Chan.jpeg"
    }
  ],
  "VP Finance": [
    {
      "platform points": [
        "For 2 years, I have fought to maximize the CB budget. Next year, I will do the same, so Feb Club and Hey Day are the most fun they can be.",
        "We lowered the price of Harry Potter shirts this year because the board and I worked towards increasing financial aid substantially, and I will continue to do so. ",
        "Along with offering increased financial aid for merch, I want to help offer a boatload of options other than just P Sweaters: sweatpants, fuzzy socks, and whatever you all want.",
        "Socially distanced on campus, we’ll do a painting day! All supplies (canvas/paint) will be provided and if people want to show off their work we'll do a mini art show.",
        "More broadly, I want to continue to supporting and uplifting the diverse voices that make up our class and ensure that people have access to any mental health resource they want.",
        "My last platform point is blank on purpose. I want to hear what you all want. A field day with tug-of-war? More massages/puppies? Cultural food festival? I'm listening!"
      ],
      "name": "Anuva Shandilya",
      "introduction": "Hi everyone! My name is Anuva Shandilya, and I’m super excited to be running for re-election as your VP of Finances. These past 2 years, I have attended budget meetings and budgeted our funds so that we can get the most out of them, such as hosting fun events like Dogs N Donuts and being able to provide hundreds of free bucket hats to you all. I have absolutely loved getting to meet so many of you these past few years and hope that you'll allow me to continue to serve you as VP of Finances. Thank you!",
      "facebook url": "",
      "instagram handle": "anuvashandy",
      "campaign website": "",
      "youtube video url": "",
      "image": {
        "src": "../../../images/2021/NEC/Anuva-Shandilya.jpeg"
      },
      "image name": "Anuva-Shandilya.jpeg"
    }
  ],
  "College Chair": [
    {
      "platform points": [
        "Uniting our class: After being forced to endure physical distance, I am so excited to plan IN PERSON events as soon as they are deemed safe! I am so proud to be a part of the Class of 2023 and am looking forward to planning as many events as possible that will help me get to know you guys.",
        "Transparency: Next year, I want everyone to be aware of what Class Board is planning! We plan these events for you guys and I want you to know about them and have an outlet to offer feedback. Next year, I plan to make our ideas even more4 public and allow students to have a voice on the decisions we make through voting. ",
        "Inclusivity: This year has been an extremely difficult year, particularly for minority groups. That's why, it is my personal goal to make Penn (and the wider community) as inclusive and welcoming as possible to all groups. CB 23 <3's you guys! ",
        "Mental Wellness: In light of this past year, a focus on mental wellness has never been more important. I am looking forward to bringing in speakers to promote self care and caring for one another!"
      ],
      "name": "Jordan Rosenberg",
      "introduction": "Hi SAS Family! My name is Jordan Rosenberg and I am running to be reelected as Co Chair of the College of Arts and Sciences. I have always been passionate about working with and helping others, and I am excited to hopefully continue doing so on Junior Class Board. This year, I was happy to help organize cool merch drops and plan fun virtual events, but I am ready for so much more next year!! As we come to the end of a truly unpredictable (to put it lightly) year, I am looking forward to properly reuniting as a class. I am looking forward to planning fun, engaging in person events with free food and more merch like Spring Fling and Hey Day! Next year, my main priorities are uniting the class, transparency, inclusivity, and mental wellness.",
      "facebook url": "",
      "instagram handle": "rosenbergj4caschair",
      "campaign website": "",
      "youtube video url": "",
      "image": {
        "src": "../../../images/2021/NEC/.jpeg"
      },
      "image name": ".jpeg "
    }
  ],
  "Engineering Chair": [
    {
      "platform points": [
        "Diversity and inclusivity - ALL of your perspectives and inputs matter: more cultural events, more collabs with different clubs etc.",
        " Mental Health Awareness and support - the GRIND never sto-... needs a break once in a while!!! ",
        "You ask, we listen: MORE FREE MERCH +collabs for engineering shirts! Collaborating with y’all for the designs you like best! Currently working on U-NIGHT t-shirts... cannot wait to plan more!",
        "More engineering bonding events (potential collabs with clubs, across departments, ESAC, etc.)",
        "Connection: Isolation was tough, and with the transition back to campus I’m passionate about making up for the lack by rekindling our class through in-person events. Puppies & free food please! ",
        "Ultimately, I want to be your friend that can listen and act on what you think is important. Reach out to me anytime, and I will be there for you! :) "
      ],
      "name": "Jacqueline Aquino",
      "introduction": "Hey Penngineers! We are almost halfway there, and I am incredibly thankful to have been your Engineering Chair for the first half of your Penn experience. Given our hopeful re-transition to being in person, I would love to continue to serve you to ensure your voices are heard and your journey here is extraordinary! The purpose of this year is simply to make the next half of YOUR Penn experience better than the first, and I know we can make this happen! Below lists what I want to continue/begin implementing to make your Junior experience memorable! ",
      "facebook url": "",
      "instagram handle": "j_aquino_",
      "campaign website": "",
      "youtube video url": "",
      "image": {
        "src": "../../../images/2021/NEC/Jacqueline-Aquino.jpeg"
      },
      "image name": "Jacqueline-Aquino.jpeg"
    }
  ],
  "Wharton Chair": [
    {
      "platform points": [
        "Penn Culture - Push for more academic leniency with policies like P/F to target the root of toxic Penn culture",
        "Diverse Recruitment - Make sure the UA targets diverse communities when asking for applications to be UA Associate Members",
        "Transfer Program Community - Next year I plan on focusing on a transfer program community in the high rises to make sure transfers have an easier time making friends.",
        "Traffic light - Fix the traffic light at 38th & Spruce. It is so dangerous! DPS should put more pressure on the city to fix it."
      ],
      "name": "Carson Sheumaker",
      "introduction": "Hey guys, I'm Carson Sheumaker. This year I've served on both the UA as the UA Secretary and Class Board as your Wharton Chair. I'm very passionate about getting the most fire merch for our class and improving student campus life for all classes.",
      "facebook url": "https://www.facebook.com/carson.sheumaker",
      "instagram handle": "sheumakerforwharton",
      "campaign website": "",
      "youtube video url": "",
      "image": {
        "src": "../../../images/2021/NEC/Carson-Sheumaker.jpeg"
      },
      "image name": "Carson-Sheumaker.jpeg"
    }
  ]
}
