{
  "Executive VP": [
    {
      "platform points": [
        "West Philadelphia: We need to support the West Philadelphia community by pushing for adequate PILOTs, expanded community engagement, and proper recognition for the service workers keeping campus clean and safe.",
        "Class Spirit: We can’t just simply move-on from losing our Freshman year. As soon as it’s safe, I will fight to get back the celebrations (and free merch!) we’ve earned.",
        "Student Voice: Penn administration has time-and-time again disregarded students’ best interests. I will always prioritize our voices and challenge admin when we are not being heard. ",
        "Dining: The Sophomore dining plan is outrageous and it must be removed. I will also push for dining dollars to have more functionality, such as at Honeygrow or Franklin’s Table.",
        "Wellness: Penn must re-evaluate student wellness. Students need real mental health days (not a Spring Break replacement), including election day, and professors must recognize when students are being overworked.",
        "Class Board Culture: Many upperclassmen have expressed concerns to me about Class Board being unhelpful for students. Class Board must instill class spirit, but also lobby for change that matters."
      ],
      "name": "Charlie Schumer ",
      "introduction": "Hello! I’m running to build community while uplifting student voices. I pledge to get back our stolen experiences, but also support students and West Philadelphia. Please evaluate candidates based on actions, not just words. I’ve spent the school year working for a Philly-based food bank, contributing community service through the civic house, and learning in an academically-based community service course. I led planning for Econ Scream and class merch orders on the First Year Committee, and I also work with Penn PORES, Hill House Council, and my acapella group. Connect on Instagram @chuck4penn or text 651-900-5061 (Accepting all GamePigeon requests)!",
      "image": {
        "src": "../../../images/2020/NEC/jack-dooley.jpeg"
      },
      "image name": "elena-miller.jpeg ",
      "facebook url": "https://www.facebook.com/charlie.schumer",
      "instagram handle": "chuck4penn",
      "campaign website": "https://sites.google.com/sas.upenn.edu/chuckforpenn",
      "youtube video url": "https://youtu.be/E5Mha0ARdVE"
    },
    {
      "platform points": [
        "Canceling Penn Face – Actively combat the campus norm that is Penn Face and promote an authentic/ healthy environment.",
        "Recreating The Freshmen Year Experience – Plan an in-person NSO week for the class of 2024 to get back the time and experiences we lost to the pandemic. "," Communicate: You can’t take advantage of opportunities that you don’t know about. I’ll make sure that conversations outside and inside the university are concisely conveyed to the class of 2023.",
        "Improved Dining Experience – Abolish the “second year dining experience” and provide more options for vegan/vegetarian/halal/kosher students and more at our dining halls.",
        "School Unity – Connect and unify the student body through various events promoting intra school interaction.",
        "Equity and Inclusion – Advocate for need-blind admissions for international students and mandated implicit bias training for club leaders coordinating recruitment. "
      ],
      "name": "Jessica Hong",
      "introduction": "I, Jessica Hong, am running for the 2024 Class Executive Vice President position with the intent of unifying our class’ voice and pursuing a better quality of life for our class. I seek to hear the students’ voices and work with others to break through social barriers and instill school spirit. I will focus my term on listening to the students and creating opportunities to unify the student body. With my experience of being a class board member all throughout high school and a current 2024 committee member, I hope to use the skills I have developed for this position.",
      "facebook url": "",
      "instagram handle": "Jessica.Hongg",
      "campaign website": "https://jessicahong512.wixsite.com/my-site",
      "youtube video url": "https://youtu.be/nh4X5D2E3KI",
      "image": {
        "src": "../../../images/2020/NEC/elena-miller.jpeg"
      },
      "image name": "elena-miller.jpeg "
    },
    {
      "platform points": [
        "Community Cohesion:  Create a sense of community across all the schools and programs at UPenn to overcome the barriers and obstacles that were caused by the pandemic.",
        "Mental Health:  Implement various initiatives that promote mental and general wellness for students.",
        "Philanthropy:  Ensure that no social issue that concerns the wellness of the student body or community goes unaddressed.",
        "Cultural Inclusion:  Foster a community where diverse backgrounds and perspectives are fully taken into account and sought to be understood.",
        "Accommodations:  Advocate for the compensation of lost experiences and time and work to recreate new experiences in the future.",
        ""
      ],
      "name": "Sarah Kim",
      "introduction": "My name is Sarah Kim and I am a freshman pursuing a concentration in Management and Finance in Wharton.  Outside of my academic interests, while I’m heavily involved with my extracurricular clubwork, I’ll also find the time of day to make jewelry, work on digital art, and enjoy the outdoors. During the fall, I didn’t feel as though our year was able to fully enjoy many Penn traditions despite the online accommodations, and I want to run for our Class of 2024 Board as the Executive VP to ensure that our lost experiences will be recovered in the following years.",
      "facebook url": "https://www.facebook.com/profile.php?id=100009189898245",
      "instagram handle": "sarahkim._",
      "campaign website": "",
      "youtube video url": "https://www.youtube.com/watch?v=mNldJfr7070&ab_channel=CommunityForCB",
      "image": {
        "src": "../../../images/2020/NEC/elena-miller.jpeg"
      },
      "image name": "elena-miller.jpeg "
    }
  ],
  "President": [
    {
      "platform points": [
        "Community Building - Bringing students together for safe social interactions",
        "Culture of acceptance - Foster a culture that acknowledges penn face and weaken its effect on campus",
        "Equity - increase access to social events for the FGLI community",
        "Philanthropy- Raise money for great causes chosen by the community during our social events and leave a positive impact on the community"
      ],
      "name": "Tomas Hernandez Patino",
      "introduction": "Hello everyone, I’m Tomas. I am running for class president because I want to unite our class. Although it is difficult to socialize because we have been presented with difficulties because of the pandemic. As your president, I will make our class stronger than it could ever be throughout these tough times. Since the beginning of freshman year, I have hosted socials. The main outcome I wanted to come from the socials were people to meet and friendships to bloom, which has happened. This Fall, I want to create an inclusive community that reclaims traditions such as NSO. ",
      "facebook url": "",
      "instagram handle": "tomashernandezpatino",
      "campaign website": "https://www.youtube.com/channel/UCluv-ZALzUwDZg6_cLwKu_g",
      "youtube video url": "https://www.youtube.com/watch?v=17xxItcjfgI&ab_channel=CommunityForCB",
      "image": {
        "src": "../../../images/2020/NEC/elena-miller.jpeg"
      },
      "image name": "elena-miller.jpeg "
    },
    {
      "platform points": [
        "Unity: This is my top priority. We have faced so many obstacles to build community and a sense of togetherness, and I want to help overcome that.",
        "In-person events: This will help foster unity and class spirit. As we transition next fall, I want to host as many events in-person as possible.",
        "Inclusion: Unity is not possible without including everyone. I want to ensure that no one is left behind and everyone feels welcome in everything we do.",
        "Social justice: With the recent events, it is up to us to fight for equality and equal treatment. As one of the country’s leading institutions, we can lead this effort.",
        "Transparency: In every interaction, I want all of you to be aware of what is happening and why. I will send monthly updates and host open discussions to do so. "," Communicate: You can’t take advantage of opportunities that you don’t know about. I’ll make sure that conversations outside and inside the university are concisely conveyed to the class of 2023.",
        "Resources: Educational resources and advising advocacy is important, including extending the pass/fail deadline and helping better pre-major advising. Supporting everyone academically is essential, especially at an institution like Penn."
      ],
      "name": "Drake Goodman",
      "introduction": "Hi everyone! My name is Drake Goodman from the Huntsman Program, and I am running for Class President! I am currently involved in 180 Degrees Consulting, Scholars of Finance, Penn Social Entrepreneurship Movement Spire accelerator, and the Huntsman Student Advisory Board. After forming relationships with so many people and witnessing several areas for improvement, I realized there is a lot of potential in our class that I want to help steer. We can be bold, united, and embrace community. The Class of 2024 would not be here if we did not already embody those qualities. Keep being bold. Vote Drake.",
      "facebook url": "https://www.facebook.com/drake.goodman.589/",
      "instagram handle": "drake.good.man",
      "campaign website": "",
      "youtube video url": "",
      "image": {
        "src": "../../../images/2020/NEC/elena-miller.jpeg"
      },
      "image name": "elena-miller.jpeg "
    },
    {
      "platform points": [
        "Host events to raise money for our class",
        "Promote student initiatives to Penn Administration and Alumni",
        "Work with Penn Student Government to improve Penn Dining",
        "Vibe"
      ],
      "name": "Toyosi Abu",
      "introduction": "Hello everyone, I am Toyosi Abu, a freshman in the College studying math and computer science.  I am excited to run for Class Board President and hope to get your vote this upcoming election. In my roles on the First Year Committee and as the Hill House Council President, I have experience planning large-scale events for our class (including Econ Scream, online poker events, and trivia nights). I hope to continue to serve the Penn Community as your President next school year.",
      "facebook url": "https://www.facebook.com/profile.php?id=100010629108731",
      "instagram handle": "Toyosiabu",
      "campaign website": "",
      "youtube video url": "",
      "image": {
        "src": "../../../images/2020/NEC/elena-miller.jpeg"
      },
      "image name": "elena-miller.jpeg "
    },
    {
      "platform points": [
        "Canceling Penn Face – Actively combat the campus norm that is Penn Face and promote an authentic/healthy environment. ",
        "Recreating The Freshmen Year Experience – Plan an in-person NSO week for the class of 2024 to get back the time and experiences we lost to the pandemic. "," Communicate: You can’t take advantage of opportunities that you don’t know about. I’ll make sure that conversations outside and inside the university are concisely conveyed to the class of 2023.",
        "Improved Dining Experience – Abolish the “second year dining experience” and provide more options for vegan/vegetarian/halal/kosher students and more at our dining halls. ",
        "School Unity – Connect and unify the student body through various events promoting intra school interaction. ",
        "Equity and Inclusion – Advocate for need-blind admissions for international students and mandated implicit bias training for club leaders coordinating recruitment. "
      ],
      "name": "Prabh Dhaliwal",
      "introduction": "Hi everyone, my name’s Prabh and I’m excited to run for Class Board 2024 President and UA Wharton Representative! This past year, I’ve had a blast planning our '24 virtual ECON Scream event as a part of the Class Board 2024 First Year Committee and advocating for more equitable club recruitment as a member of the UA. With next semester poised to be more “normal,” I hope I have the opportunity to make OUR Penn experience the best it can be. Thank you so much and remember — Vote Prabh to get your PRABHlems resolved!",
      "facebook url": "https://www.facebook.com/profile.php?id=100007102503333",
      "instagram handle": "prabhsdhaliwal",
      "campaign website": "https://sites.google.com/view/prabhdhaliwal",
      "youtube video url": "https://youtu.be/zrdttSDVc3w",
      "image": {
        "src": "../../../images/2020/NEC/elena-miller.jpeg"
      },
      "image name": "elena-miller.jpeg "
    },
    {
      "platform points": [
        "FGLI inclusion → I'll be graduating with student loan debt. First and foremost, I want to increase affordability and social inclusion for FGLI students, pushing for more representative class events.",
        "Service-oriented merch → I love design. I want to use it for good. I want to partner with West Philadelphia grassroots groups and co-design merch, donating profits to these community-builders.",
        "Inter-college mega-events → Swarthmore, Villanova, Temple, Princeton. I want to extend our Penn pride and work with other Philadelphia-area colleges, creating adrenaline-pumping, high-fun, and far-reaching competitions, celebrations, and events.",
        "Commitment to DEI → Penn's decision to host commencement on Shavuot speaks volumes. I want to coordinate events that consider our unique identities, demands, and necessities and celebrate our differences.",
        "Culture of positivity → I want us to conquer Penn Face. An everyday class event, I want to design personalized support messages, encourage Locust Walk \"free hugs\" campaigns, and more.",
        "Engagement with future classes → I believe it's our duty to guide future classes. I want to create programming that invigorates incoming first-years, deepening their four-year outlook and our own."
      ],
      "name": "Tyler Kliem",
      "introduction": "Hey! I'm Tyler, a first-generation Jewish student from New Jersey. I'm committed to improving Penn's social inclusion and prioritizing marginalized voices, while maintaining the atmosphere of fun and togetherness we all know and love. Because of my background, I'm running to ensure class events are affordable, all-inclusive, and reflective. I'm running to reinvent our approach to events by upscaling, improving our community and service relations, and encouraging student growth. I believe our events should be driven out of meaning and solidarity, and I hope to improve Penn's current traditions and welcome more, all designed out of purposeful interactions with others.",
      "facebook url": "https://www.facebook.com/tylerkliem/",
      "instagram handle": "tylerklm",
      "campaign website": "",
      "youtube video url": "https://youtu.be/xAanwLlEQvE",
      "image": {
        "src": "../../../images/2020/NEC/elena-miller.jpeg"
      },
      "image name": "elena-miller.jpeg "
    },
    {
      "platform points": [
        "Becoming Emotionally Well: As barely matriculated Quakers, we are hurting. I’m advocating for complete reform of student wellness, which starts by making mental health resources more effective and accessible.",
        "Unifying Creators: When we work together, incredible things happen. I’m committed to starting the 24 Power Collective, a platform for students to share opportunities and create projects while feeling supported! ",
        "Intentional Community Building: We have had to reimagine college this year. I’m committed to running social events (with really cool merch!) that help us to thoughtfully connect and grow together!",
        "Leveraging Connections: While we can’t change the history, we can change the culture.  We must commit to advocating for the payment of PILOTS, real civic engagement, and spaces for connection. ",
        "Developing Sustainability: We need to collectively support Philadelphians by cutting down on waste, using the excess amount of swipes we have mindfully, and upcycling resources through a conscious thrifting initiative.",
        "Stopping Student Exploitation: The Sophomore Dining Plan is completely disrespectful of our ability to do what college is for—exploring and adulting! I will advocate for better functionality and flexibility."
      ],
      "name": "Deborah Olatunji",
      "introduction": "Hey! I am running for Class Board President with the intention of and experience in building powerful communities, establishing a culture of collaboration, and giving back to West Philadelphia. I believe that we have a responsibility to bridge resources and opportunities between our class, community, and city. I am an advocate for what’s matters, thoughtful engagement, through over 100 hours of digitally organizing, working as a University Council member on two committees, becoming a Philly Vaccine Champion, and planning Econ Scream. Let’s connect on Instagram, @debbuilds4penn, and redefine what it means to be a member of the class of 2024. ",
      "facebook url": "",
      "instagram handle": "debbuilds4penn",
      "campaign website": "",
      "youtube video url": "https://youtu.be/ChtWjp25RgA",
      "image": {
        "src": "../../../images/2020/NEC/elena-miller.jpeg"
      },
      "image name": "elena-miller.jpeg "
    }
  ],
  "Nursing Chair": [
    {
      "platform points": [
        "Equity & diversity: Lift up and listen to BIPOC voices on campus, as well as bringing female and LGBTQA+ representation to the table. Penn should be a safe and welcoming community for all.",
        "Mental health: Open up the conversation surrounding mental health at Penn and the School of Nursing. Disseminate CAPS information and create new initiatives to promote mental wellness.",
        "Rebuild Penn's social community in the new normal: Organize Penn traditions—from both sophomore and freshman year—to make up for lost time. Unite the four schools as one Penn.",
        "Transparency: Hold the Penn administration accountable to its students and the community of West Philadelphia. Establish and facilitate an open line of communication. Advocate for PILOTs.",
        "Inclusivity: The SON is and always has been an integral part of Penn. I will ensure that nursing students are not only included, but also recognized and celebrated on campus."
      ],
      "name": "Sonia Feil",
      "introduction": "Hi all! Congratulations on the near completion of your first year of college!!! My name is Sonia and I am on the traditional BSN track, minoring in political science. It would be an absolute honor to represent our phenomenal cohort on class board and to serve you all by pushing your interests and concerns to the forefront of my agenda. Prior executive roles have prepared me well for the task of organizing social events, fundraisers, and programming while serving as a bridge and student advocate to the administration. I hope you will find that my platform resonates with you.",
      "facebook url": "https://www.facebook.com/sonia.feil.1",
      "instagram handle": "so.feil",
      "campaign website": "https://bit.ly/39EIfBd",
      "youtube video url": "",
      "image": {
        "src": "../../../images/2020/NEC/elena-miller.jpeg"
      },
      "image name": "elena-miller.jpeg "
    },
    {
      "platform points": [
        "Community Cohesion -- lasting friendships  --bringing students together --safe, social interactions.",
        "Mental Health -- advocate for students --destigmatize seeking out help --promote mental health resources and services.",
        "Philanthropy --serve the greater community --fundraising with fun and inclusive events —support social causes --advocate for justice ",
        "Transparency --open administrative decision making --student involvement --student voices are heard and incorporated ",
        "Inclusivity --fostering a welcoming school environment  --promoting inclusivity in school events and daily student life —Penn should feel like home"
      ],
      "name": "Justin Tran",
      "introduction": "Hey everyone! My name is Justin Tran, and I'm hoping to serve as our class' Nursing Chair. When I'm not grinding out A&P work or taking a nap, you can find me exploring the city, hanging out with friends, or grabbing boba. As the nursing chair, I want to plan exciting events for our class to enjoy. Although we lost a lot of our freshman experience, I am confident that my team can make up for it in the coming year. Specifically, I hope to serve as a liaison for our nursing cohort, further amplifying the voices of nursing students! ",
      "facebook url": "",
      "instagram handle": "justinn.tran",
      "campaign website": "",
      "youtube video url": "https://www.youtube.com/watch?v=shJ9Qxfsp9c&ab_channel=CommunityForCB",
      "image": {
        "src": "../../../images/2020/NEC/elena-miller.jpeg"
      },
      "image name": "elena-miller.jpeg "
    }
  ],
  "College Chair": [
    {
      "platform points": [
        "I aim to foster class unity, and nothing brings people together more than shared love of food. I cannot wait for you to see the Food Truck Days we’ve planned!",
        "Despite our virtual setting, we must continue our Penn traditions, and that means I will do everything possible to have the best U-Night for us sophomore!",
        "Penn is about collaboration, and I’ve worked with our First Year Class Committee since the first semester. I promise to remain committed to our organization and to you!",
        "Class Board is centered around YOU! Any events or activities that you want to see will be considered, and I aim to represent your interests."
      ],
      "name": "Eleni Pisinos",
      "introduction": "Hi everyone! I'm from Tennessee, majoring in Political Science, and I want to use my two semesters of involvement in Class Board to represent you as one of your next College Class Chairs for Class Board 2024. Since being involved in Class Board, I have worked with classmates, Penn admin, and outside vendors to bring you Trivia Night and our upcoming taco and dessert Food Truck Days. As your College Class Chair, I can guarantee you that I will create new and engaging social events, continue our Penn traditions, and most importantly, represent YOU and your voices.",
      "facebook url": "",
      "instagram handle": "eleni_pisinos",
      "campaign website": "",
      "youtube video url": "https://www.youtube.com/watch?v=zsYYCzHG01M",
      "image": {
        "src": "../../../images/2020/NEC/elena-miller.jpeg"
      },
      "image name": "elena-miller.jpeg "
    },
    {
      "platform points": [
        "Becoming a Class of One. While GrpoupMe helps with answering questions and recognizing names, this isn’t a college experience. We need class spirit and opportunities to meet people outside subgroups.  ",
        "Prioritizing Mental Health. CAPS and Reach-a-Peer-Hotline are wonderful resources. Penn needs to work towards the destigmatization of mental health. Administration should recognize burnout and alleviate stress, not cause it.",
        "Experieincing the Social Ivy. From NSO to Spring Fling, safety-permitted, the Class of 2024 deserves a break. Free merch, sports and concert tickets, and special events coming your way.",
        "No More Exploitation. The sophomore dining plan and on-campus mandate goes against public opinion at the worst possible time. Fighting this and preventing future for-profit decisions will be a priority.",
        "Civic Engagement, For Real. Penn gentrifies West Philadlephia. Penn donated the bare minimum to PILOTs. Making easily-accessible initiatives to tutor, donate, and protest helps us reverse the damage.",
        "Security & Safety. There are new stories of harassment on Locust Walk every week. Penn should prevent the same offenders from approaching different students. We need report systems and better intervention. "
      ],
      "name": "Ibrahim El-Morsy",
      "introduction": "Hello! I promise to strengthen the relationship between students and administration by increasing transparency. This unprecedented year taught us most that unsubstantiated feedback produces more anxiety. The process will be gradual, but the work done by the Undergraduate Assembly and University Wide Committees can be the foundation to preventing decisions including the sophomore dining-plan, bare minimum PILOTs donations, and inadequate wellness days. I’ve worked to achieve the goal of bolstering the community through open forums, contributing to West Philadelphia through tutoring and vaccine distribution, Heart Over Hands, and Habitat for Humanity. I believe that to make progress, communication is key.",
      "facebook url": "https://www.facebook.com/ibrahim.elmorsy.942",
      "instagram handle": "ibrahim.el.morsy",
      "campaign website": "",
      "youtube video url": "",
      "image": {
        "src": "../../../images/2020/NEC/elena-miller.jpeg"
      },
      "image name": "elena-miller.jpeg "
    },
    {
      "platform points": [
        "AAPI Mental Health",
        "Bettering food options for those with restrictions",
        "College Class Unity",
        "Event and Traditions Promotion"
      ],
      "name": "Anooshey Ikhlas",
      "introduction": "Hi! My name is Anooshey Ikhlas and I am running to be one out of the two College Class Chairs! I have been involved in class board throughout high school, and for the past year have been a committed member on the UPenn 2024 committee. I helped plan many of the events that took place virtually in the fall and the ones that are upcoming this spring (I also run the instagram @upenn24committee, go check it out!) I really care about this role and helping unify the people in the college and this class while also highlighting our unique perspectives and outlooks on life. I am so excited to be working with you all!",
      "facebook url": "https://www.facebook.com/anooshey.ikhlas",
      "instagram handle": "anoosheyyy",
      "campaign website": "",
      "youtube video url": "https://www.youtube.com/watch?v=yqORK1yt1lg",
      "image": {
        "src": "../../../images/2020/NEC/elena-miller.jpeg"
      },
      "image name": "elena-miller.jpeg "
    },
    {
      "platform points": [
        "Community Cohesion: -Unify our class through frequent social events. -Meet and connect with each other via social programming. ",
        "Mental Health: -Promote mental health and wellbeing across campus. -Get a class therapy dog. -Create opportunities for support groups to help one another.",
        "Diversity, Equity, and Inclusion: -Make sure every student's voice is heard. -Ensure that anyone/anything that conflicts with these three goals gets addressed and handled appropriately. ",
        "Philanthropy: -Give back to the West Philly community. -Hold fundraisers for important causes. -Provide more service opportunities and work with Civic House. ",
        "Social Justice: -Provide a means for open and engaging discussion regarding societal problems. -Address issues in the West Philly community and abroad. ",
        "School Spirit: -Promote school pride and spirit through merch and Penn traditions."
      ],
      "name": "Mason Lumer",
      "introduction": "Hey Penn ‘24! My name is Mason Lumer and I am running to be your CB College Chair. Coming into Penn, I wanted to befriend as many of my classmates as possible. Nevertheless, COVID made this ambition extremely difficult. It is now imperative for our future class board leaders to build a cohesive community through social events and traditions. This is why I am running for college chair– to build a tight-knit class where we share memories together and connect with one another. I believe I can unify our class through various social programming that promotes school spirit and togetherness.",
      "facebook url": "facebook.com/mason.lumer",
      "instagram handle": "mas.lumer",
      "campaign website": "",
      "youtube video url": "https://youtu.be/g_BK38MjvEY",
      "image": {
        "src": "../../../images/2020/NEC/elena-miller.jpeg"
      },
      "image name": "elena-miller.jpeg "
    },
    {
      "platform points": [
        "Community Cohesion: foster a lively, united community through a surplus of inventive social events  ",
        "Mental Health Outreach: combat Penn Face by listening, empathizing, and providing fruitful mental health resources",
        "Fundraising: fundraise at events in order to support social causes and organizations based in the West Philadelphia area and across the country  ",
        "Social Justice: recognize and amplify the voices of marginalized communities within the student body and the surrounding Philadelphia area"
      ],
      "name": "Jack Immanuel",
      "introduction": "My name is Jack Immanuel, and I am a freshman in the College of Arts & Sciences majoring in Philosophy, Politics, and Economics (PPE). I am running to be Class Board College Chair because I truly care about each and every individual in the Class of 2024. Our class has endured a great deal during such an unprecedented time, and we need passionate leaders to facilitate an effective transition into a post-COVID world. I am determined to catalyze positive change, bring innovative ideas to the table, and organize safe social events for everyone to enjoy. ",
      "facebook url": "",
      "instagram handle": "jackimmanuel",
      "campaign website": "",
      "youtube video url": "https://www.youtube.com/watch?v=hOMIzRWvkLs ",
      "image": {
        "src": "../../../images/2020/NEC/elena-miller.jpeg"
      },
      "image name": "elena-miller.jpeg "
    }
  ],
  "Engineering Chair": [
    {
      "platform points": [
        
      ],
      "name": "Venkatesh Shenoy",
      "introduction": "Hey Penn Engineers! My name is Venkatesh Shenoy, and I am running for CB’24 Engineering Class Chair! I’ve served on the First Year Committee the past two semesters planning events like Cram n Jam, and I’m excited to plan more events as we return to some sense of normalcy next year! As SEAS Chair, I want to be a representative for members of the SEAS community to bring up ideas and events that can enhance our second-year experience. Thank you, and please reach out to me if you want to chat. Vote Venkatesh Shenoy for Engineering Class Chair!",
      "facebook url": "",
      "instagram handle": "venkatesh_shenoy",
      "campaign website": "",
      "youtube video url": "",
      "image": {
        "src": "../../../images/2020/NEC/elena-miller.jpeg"
      },
      "image name": "elena-miller.jpeg "
    },
    {
      "platform points": [
        "The first goal is reclaiming NSO. I will work to ensure that there will be a week of NSO for our Class of 2024. ",
        "The second goal is voicing the inputs of Penn Engineering Class of 2024 students for our class events. ",
        "The third goal is providing more opportunities for free Penn Merch. This includes more in-person events (according to COVID guidelines next year) where free Penn Merch is present.",
        "The fourth goal is encouraging Penn Engineering student participation in our class events. I will ensure events are clearly advertised to Penn Engineering Class of 2024 students.",
        "The fifth goal is to facilitate collaboration between UA and Class Board to encourage the distribution of mental health resources to our class, as well as wellness events.",
        "The sixth goal is to ensure that the Class of 2024 gets to participate in the classic Penn traditions, even those we lost."
      ],
      "name": "Nicholas Kuo",
      "introduction": "My name is Nicholas Kuo, and I’m running to be the Engineering Chair for our Class of 2024 Board. My goal as Engineering Chair would be to squeeze 4 years of typical college experiences into the 3 years we have left. This freshman year, I’ve worked on surveying freshmen on mental health, consolidating mental health resources, and organizing virtual department chair lunches for Penn Engineering students. Our Class of 2024 deserves to feel the thrill of college, whether it be the fun of NSO or the amusement of Penn traditions. I’m determined to give our class the fun it deserves.",
      "facebook url": "https://www.facebook.com/nicholas.kuo.56",
      "instagram handle": "nicholaskuo",
      "campaign website": "",
      "youtube video url": "",
      "image": {
        "src": "../../../images/2020/NEC/elena-miller.jpeg"
      },
      "image name": "elena-miller.jpeg "
    },
    {
      "platform points": [
        "Community: In light of the engineering student population being global in this unprecedented virtual semester, everyone has developed a very different definition of what it means to be a Penngineer. I believe I have the agency to arise to the occasion and foster a cohesive community in the fall.",
        "Culture: Engineering courses are notoriously difficult, and I want to relieve some of the pressure placed on us. I strive to eliminate all breakdowns caused by a cold call in next semester’s CIS classes.",
        "Curves: Have you ever been told to check in with a professor to get an idea about how you’re doing in their class? As the SEAS Class Chair, I would forbid the answer “you’ll find out later.” Under my leadership, more curve information will be available to engineering students earlier in the semester.",
        "Charity: SEAS students are provided with many opportunities to give back to underserved schools with STEM-oriented students in West Philly, but much of this is achieved through the semi-selective club-joining process. I plan to organize SEAS-wide philanthropic STEM education events to allow each Penngineer to make an impact on the community and also connections within the Penn network."
      ],
      "name": "Beth Fisher",
      "introduction": "My name is Beth Fisher, and I am running for SEAS class chair this semester to strengthen our community, foster a more caring culture, develop some philanthropic traditions, and provide engineering students with more information about curves in their courses. At Penn, I’m involved in Greek life, club field hockey, Tech It Out, and the M&T Student Board. I moved in on the first day and made sure to bring my speaker everywhere with me during move-in days. I harassed a lot of amazing people during that time, and I’d really like to create the sophomore experience they deserve.",
      "facebook url": "https://www.facebook.com/beth.fisher.7906932/",
      "instagram handle": "_bethfisher_",
      "campaign website": "",
      "youtube video url": "",
      "image": {
        "src": "../../../images/2020/NEC/elena-miller.jpeg"
      },
      "image name": "elena-miller.jpeg "
    }
  ],
  "VP Finance": [
    {
      "platform points": [
        "24 Hour Waffle House - I know that every single person reading this has found themself thinking \"Waffle House would smack right now\" at 4 in the morning.  Let's make that a possibility.",
        "Canceling Penn Face – Like I always say, keep it real. Let's actively combat the campus norm that is Penn Face and promote an authentic/ healthy environment. ",
        "Recreating The Freshmen Year Experience – Brennan Huff and Dale Doback never lost their dinosaur, so why should we? AsPlan an in-person NSO week for the class of 2024 to get back the time and experiences we lost to the pandemic. ",
        "Improved Dining Experience – Abolish the “second year dining experience” because, as much as we love our cooks (shoutout Hill Dining Hall staff), we need our food freedom (and we don't like Penn taking our money).",
        "School Unity – Everybody likes to have fun, so let's connect and unify the student body through various events promoting intra school interaction. ",
        "Equity and Inclusion – Advocate for need-blind admissions for international students and mandated implicit bias training for club leaders coordinating recruitment. "
      ],
      "name": "Jay Brown",
      "introduction": "Hello everybody. My name is Jay Brown. In my home town of Chanute Kansas, we care about having a good time and saying what needs to be said. Our experience so far at Penn has shown us that we need more good times and louder student voices. That’s why I’m running for Class Board, because I’m not afraid to speak a blunt truth to administrators (like how our class is getting screwed by all the new rules), and because we only get four years of college, so I'm going to make every day a great one.",
      "facebook url": "",
      "instagram handle": "jaytbrown_",
      "campaign website": "",
      "youtube video url": "",
      "image": {
        "src": "../../../images/2020/NEC/elena-miller.jpeg"
      },
      "image name": "elena-miller.jpeg "
    },
    {
      "platform points": [
        "I believe that more activities should be hosted for students with an international background, especially students hailing from similar locations. ",
        "Especially with the ongoing pandemic, I believe a stronger focus should be placed on the mental health of students.",
        "I believe that Penn hasn't given back to the community it exists in. For this reason, I want to host fundraisers for different organizations in Philadelphia. ",
        "I believe that Penn needs to cut down on its plastic waste, which includes switching to biodegradable utensils. ",
        "I want to work on planning events for sophomores to also participate in a version of NSO."
      ],
      "name": "Emre Duvenci",
      "introduction": "My name is Emre Duvenci, and I am running to be your VP of Finances! I’m from Atlanta, Georgia, but I was raised in Istanbul, Turkey, and to the disappointment of my parents I am studying International Relations in the SAS. I’ve seen that during this global pandemic, Penn has been failing to uphold its responsibility to international students and to the greater student body. I believe that the funds given to us can better be spent on activities that help connect students, rather than pillowcases, as comfy as they are.",
      "facebook url": "https://www.facebook.com/emre.duvenci.56/",
      "instagram handle": "emduvenci",
      "campaign website": "",
      "youtube video url": "https://youtu.be/RTbkDia2pA4",
      "image": {
        "src": "../../../images/2020/NEC/elena-miller.jpeg"
      },
      "image name": "elena-miller.jpeg "
    },
    {
      "platform points": [
        "I will develop more budget transparency for Class Board’s expenses and revenue streams so that members of the Class of 2024 know how funds are being allocated.",
        "I will seek additional funding for Class Board’s traditions and initiatives by seeking corporate sponsorships and donations in order to help make Class Board events engaging and worthwhile.",
        "I will diligently plan initiatives to provide additional revenue streams for Class Board, such as selling merchandise designed by members of the Class of 2024.",
        "In order to maximize UA’s monetary allocation, I will create a diligent yearly budget to fund more creative initiatives such as contests, art showcases, and business start-up showcases.",
        "I will promote the financial stability of Class Board by saving money for more in-person events in future semesters, keeping long-term goals in mind for our class.",
        "I will promote and budget for philanthropic initiatives and events allowing our class to collectively engage in social impact, sustainability, and causes that are meaningful to our class."
      ],
      "name": "Annabelle Noyes",
      "introduction": "My name is Annabelle Noyes, and I am studying management and finance at Wharton.  As an experienced wedding/event coordinator and member of the First Year Committee, I have extensive leadership, revenue management, and budgetary oversight skills, which makes Class Board the perfect continuation of my passions, interests, and deep dedication to serving our class. With a campaign focus of creativity, establishing additional revenue streams, and giving members of the class a voice, I am an ideal candidate for VP of Finances.   I will do my part to strengthen the Class of 2024 community through administering initiatives that unite us.",
      "facebook url": "",
      "instagram handle": "",
      "campaign website": "",
      "youtube video url": "",
      "image": {
        "src": "../../../images/2020/NEC/elena-miller.jpeg"
      },
      "image name": "elena-miller.jpeg "
    }
  ],
  "Wharton Chair": [
    {
      "platform points": [
        "Canceling Penn Face – Actively combat the campus norm that is Penn Face and promote an authentic/ healthy environment. ",
        "Recreating The Freshmen Year Experience – Plan an in-person NSO week for the class of 2024 to get back the time and experiences we lost to the pandemic. ",
        "Improved Dining Experience – Abolish the “second year dining experience” and provide more options for vegan/vegetarian/halal/kosher students and more at our dining halls.",
        "School Unity – Connect and unify the student body through various events promoting intra school interaction.",
        "Equity and Inclusion – Advocate for need-blind admissions for international students and mandated implicit bias training for club leaders coordinating recruitment. "
      ],
      "name": "Jun Sun",
      "introduction": "Hey guys, I'm running for Wharton Chair for the freshman class with a great group of people. I'm positive in the upcoming semesters, we will help create a fun and enjoyable return to normalness.",
      "facebook url": "",
      "instagram handle": "juanbugsun",
      "campaign website": "",
      "youtube video url": "",
      "image": {
        "src": "../../../images/2020/NEC/elena-miller.jpeg"
      },
      "image name": "elena-miller.jpeg "
    },
    {
      "platform points": [
        "Addressing mental health, I will be utilizing data I have collected throughout the last semester to encourage more conversations to admin about the mental health concerns of the student body. ",
        "With many feeling lost communal ties due to covid, a large initiative I will undergo will be for events, as allowable as possible, to reconnect with and meet people.",
        "Looking directly towards my potential responsibilities as Wharton Class Chair, I will fight for the traditions and key events that the Class of 2024 lost.",
        "With internships and the job market in shambles, I will work to connect the two positions to market common and unknown Penn resources in helping students with these fields. ",
        "In specific regards to the Class of 2024, I have been and will continue to fight for exceptions to the rule requiring second year dining and housing."
      ],
      "name": "Tristan Maslar",
      "introduction": "Hey everyone, I want to be your Wharton Class Chair as well as a Wharton representative on the Undergraduate Assembly. I am a FGLI student and am currently a freshman. This past year, I have been an Associate Member of the UA and worked on a mental health campaign designed at promoting awareness for the new struggles of the freshman class. I am very passionate about mental health at Penn and will be working to connect the duality of responsibilities of each position to embrace more community throughout the Class of 2024, Wharton, and larger student body.",
      "facebook url": "",
      "instagram handle": "tristan_m20",
      "campaign website": "",
      "youtube video url": "",
      "image": {
        "src": "../../../images/2020/NEC/elena-miller.jpeg"
      },
      "image name": "elena-miller.jpeg "
    },
    {
      "platform points": [
        "Community: Creating an inclusive community and eliminate Penn Face.",
        "Mental Health: Combatting the mental health crisis by providing students proper resources.",
        "Philanthropy: Donating money to social causes that are imperative and striking in the Philadelphia community.",
        "PILOT's: Advocate for Penn to give back more money to the West Philadelphia community as its education system is impacted due to PILOT's.",
        "Food and Dining: Work with business services in order to provide a better selection of restaurants and usage of dining dollars."
      ],
      "name": "Danny Coale",
      "introduction": "Hello everyone, my name is Danny Coale, and I am running for Wharton Chair for the Class Board of 2024. Here on campus, I am involved with the Sprint Football Team and Undergraduate Sports Business Club, and through student government and representing other students’ best interest I look to represent the members of our class. Personally, I value punctuality as a critical character trait of mine as I consistently work to better myself and the community surrounding myself. At Penn, I have discovered that it is imperative for the Class of 2024 to have a great group of leaders to plan events socially, and to provide the necessary structure to achieve a successful 4 years at Penn. ",
      "facebook url": "https://www.facebook.com/profile.php?id=100002810668387",
      "instagram handle": "dannycoalejr",
      "campaign website": "https://www.youtube.com/channel/UCluv-ZALzUwDZg6_cLwKu_g",
      "youtube video url": "https://youtu.be/18MoRkyHi2Y",
      "image": {
        "src": "../../../images/2020/NEC/elena-miller.jpeg"
      },
      "image name": "elena-miller.jpeg "
    },
    {
      "platform points": [
        "Improve Club Recruitment Process",
        "Working closely with mental health and wellness groups for easily accessible resources for all students.",
        "Hosting events both in person and virtually in the upcoming semester",
        "Class merch giveaways and selling quarter zips"
      ],
      "name": "Claire Zhong",
      "introduction": "Hi everyone! My name is Claire and I'm hoping to run to be your Wharton Class Chair. As Class Chair, I hope to voice all of your concerns to the executive board and help create class events to promote unity in times of separation. I want to help make this year the best it can be despite the circumstances and difficulties of this unique semester. If you have any questions or concerns, please feel free to reach out to me at (206)-240-5717 or @claireezhong on Instagram.",
      "facebook url": "",
      "instagram handle": "clairezhong4whartonchair",
      "campaign website": "",
      "youtube video url": "",
      "image": {
        "src": "../../../images/2020/NEC/elena-miller.jpeg"
      },
      "image name": "elena-miller.jpeg "
    }
  ],
  "VP External": [
    {
      "platform points": [
        "Plan our own form of NSO geared towards sophomores only to orient ourselves with the school and meet as many sophomores as possible before classes start",
        "Work with the 2025 class board to plan and expand Penn traditions, like Cram and Jam, that we missed this past year ",
        "Work with Philly restaurants, vendors, and performers to create an event to “explore” Philly in one place with free food and entertainment ",
        "Increase access to mental health resources and plan events centered on decreasing stress and spreading awareness about mental health issues ",
        "Collaborate with other clubs to plan events and activities that are co-sponsored and geared towards all different types of people and interests ",
        "And of course, increase class unity and community by talking and working with students to create opportunities to meet and get to know everyone in our class "
      ],
      "name": "Brianna Fisher",
      "introduction": "Hi! My name is Brianna Fisher and I'm running for VP of External Affairs! I’m someone who has an outpouring of school spirit and love for bringing people together and creating a community. With the pandemic altering our freshman year, I want to be able to make up for the lost traditions and events throughout next year, as well as build a greater sense of class unity. I also want to be a contact and representative for any freshman who has an issue that need to be addressed or has ideas to make our sophomore year the best that it could be. ",
      "facebook url": "https://www.facebook.com/brianna.fisher.3150/",
      "instagram handle": "brifisher2",
      "campaign website": "",
      "youtube video url": "",
      "image": {
        "src": "../../../images/2020/NEC/elena-miller.jpeg"
      },
      "image name": "elena-miller.jpeg "
    },
    {
      "platform points": [
        "Planning events and bringing the social traditions of your college experience back to life",
        "Taking the initiative to form relationships with external sources to help make our future events as exciting as possible",
        "Large focus on building a sense of community given the virtual nature of our freshman year",
        "Making sure your voices are heard, as Class Board is an organization solely based off of you and your needs",
        "Maintaining a sense of transparency when it comes to what is going on within Class Board and taking suggestions from the student body"
      ],
      "name": "Rawan Wadi",
      "introduction": "Hi I'm Rawan! I hope you all have been enjoying the freshman year experience as much as possible. And if not, I can guarantee that electing me is one step forward in changing that. In essence, I feel that being a student here at Penn is not my only role. I'm also a peer, friend, club member, and hopeful candidate for your CB '24 VP of External Affairs. With my experience on Class Board this year and emphasis on the creation of a sense of community amongst my peers, I am more than excited to kick off my campaign!",
      "facebook url": "",
      "instagram handle": "rawanwadi02",
      "campaign website": "",
      "youtube video url": "https://youtu.be/c-myPYt3xoE",
      "image": {
        "src": "../../../images/2020/NEC/elena-miller.jpeg"
      },
      "image name": "elena-miller.jpeg "
    },
    {
      "platform points": [
        "Community- I really want to make up for our COVID freshman year with more free food, free merch, and free events than you can imagine.",
        "Mental Health- The pandemic has revealed the gap in mental health programs that Penn offers, and I’ll advocate for more mental health resources and peer-to-peer support.",
        "Sustainability- You’ll never catch me without my reusable blue bag, but I’m still concerned about the overwhelming plastic and waste on campus, which I’m working with Penn Environmental Group to change.",
        "Penn Math- I’ve been working with the Penn math department to improve communication/feedback between students and professors.",
        "Dining- No one wants to be forced to eat on the dining plan. Enough said."
      ],
      "name": "Shan Shan Liang",
      "introduction": "My name is Shan Shan Liang, and I’m a freshman studying Finance and Business Analytics in Wharton. As an Undergrad Assembly rep, I’ve loved my experience pushing for change at Penn, along with the friends/mentors I found in the process. After working with Penn math and environmental groups this past year, I’m running for both UA Wharton Chair and Class Board VP of External because I can leverage my experiences and use both roles together to improve community, mental health, sustainability, academics, and dining. In my free time, I enjoy baking, hiking, and exploring food places in Philadelphia. ",
      "facebook url": "",
      "instagram handle": "shanshanliang_",
      "campaign website": "",
      "youtube video url": "https://youtu.be/XDY19nqui7I",
      "image": {
        "src": "../../../images/2020/NEC/elena-miller.jpeg"
      },
      "image name": "elena-miller.jpeg "
    }
  ],
  "VP Internal": [
    {
      "platform points": [
        "Community Cohesion: We want to promote social interactions and unify student body in safe environments",
        "Mental Health: We want to prioritize workshops that raise awareness about mental",
        "Fundraising: We want to combine fun social events with charity fundraisers so that we can support social causes while having fun",
        "FGLI Outreach: We want to listen to the experiences of our FGLI peers and take their feedback and incorporate it into our inclusive social events"
      ],
      "name": "Cody Eskandarian",
      "introduction": "Hi everyone! My name is Cody Eskandarian and I’m running for Class Board because I want to dedicate myself to giving back to a community that I love. We are all enduring a unique obstacle this year, and we need to provide more support for each other, both inside and outside of social events. I want to share innovative ideas to create inclusive and unifying events that build a stronger sense of community and develop a new culture. Mental health outreach will be a top priority as I want all of my peers to strive for greatness in healthy ways.",
      "facebook url": "",
      "instagram handle": "codyesk",
      "campaign website": "",
      "youtube video url": "https://www.youtube.com/watch?v=nHqoQciyFuo",
      "image": {
        "src": "../../../images/2020/NEC/elena-miller.jpeg"
      },
      "image name": "elena-miller.jpeg "
    },
    {
      "platform points": [
        "Wellbeing Above All - We shouldn’t laugh about getting no sleep because of homework or think about Penn as a means to a career. We prioritize wellbeing before addressing other issues.",
        "Shifting the Culture - Consider this a second prong: mental health and open conversations should be at the forefront of Penn education—not thrown on the backburner. We need to listen.",
        "Elevating Voices - All Penn students should feel heard. I will amplify the voices of minority groups—whether they be racial, socioeconomic, sexual, or otherwise. Imposter syndrome should not be the norm.",
        "Engagement - Say it with me: WE HAVE AN EFFECT ON OUR COMMUNITY. We need to do our part in uplifting Philadelphia by paying PILOTS and being conscious of our impact.",
        "Listening - We must listen to the needs of others, but Penn administrators also must listen to us. Let’s get rid of the second-year Dining Plan and implement more student breaks.",
        "Making Up - No one is happy about our far-less-than-ideal first year at Penn. Through my planning experience on the First Year Committee, I will keep fostering our class’ student body."
      ],
      "name": "Brinn Gammer",
      "introduction": "Hey everyone! I’m running for Vice President of External Affairs to grow as an activist. We, as Penn students, need to reprioritize what is most important, beginning with our own wellbeing and then needs of our community: throughout the past few years, I’ve dedicated myself to putting mental health first and devising awareness projects for students to do so. I’ve been a leader on First Year Committee in creating projects like the Econ Scream and We’re Not Really Strangers, and—as a FGLI student—I understand how we must make others heard in Philly. Hit me up @brinn4thewin or (570)861-7085!",
      "facebook url": "https://www.facebook.com/brinn.gammer/",
      "instagram handle": "brinn4thewin",
      "campaign website": "",
      "youtube video url": "https://youtu.be/v2Axe7SBIyE",
      "image": {
        "src": "../../../images/2020/NEC/elena-miller.jpeg"
      },
      "image name": "elena-miller.jpeg "
    },
    {
      "platform points": [
        "Mental Health: Attending a prestigious university doesn’t have to make you miserable. I will fight for a serious reevaluation and expansion of the mental health resources currently available to us.",
        "Transparency: We deserve to know when decisions are made regarding our Penn experience!! I will work to ensure admin makes decisions about dining and breaks with us, not for us.",
        "Spirit: This year has flown by without fun traditions to counteract academics. As soon as it’s safe, I will organize events--with food and merch!!--to reclaim the year we’ve lost.",
        "ASAM program: Admin’s contributions to the Asian community on campus have been seriously lacking. I promise to advocate for the retention and expansion of the ASAM program.",
        "West Philadelphia: We have the power to support our new West Philly community beyond simple Instagram story bingo boards--through the payment of PILOTs, community service projects, and political advocacy. ",
        "Communication: Student government representatives are just that: representatives for your voice and ideas!! I promise to constantly communicate with you guys, keeping you informed and involved in conversations with administration."
      ],
      "name": "Summer Maher",
      "introduction": "Hello!! My name’s Summer Maher & I’m super excited to be running for CB VP of Internal Affairs, as well as UA College Representative. Through fun events as a break from rigorous academics, advocacy on behalf of students and the West Philly community, and an insistence on transparency from administration, I'm looking forward to the chance to shape our Penn experience by always placing power in the hands of students, not administration. Please share your visions for this campaign with me on Instagram @summerranna or text 609-500-2176--because what’s a priority for you, is a priority for me!!",
      "facebook url": "https://www.facebook.com/summerrannamaher",
      "instagram handle": "summerranna",
      "campaign website": "",
      "youtube video url": "",
      "image": {
        "src": "../../../images/2020/NEC/elena-miller.jpeg"
      },
      "image name": "elena-miller.jpeg "
    },
    {
      "platform points": [
        "Reinvent old Penn traditions to create Penn pride",
        "Organize and oversee the progress of meetings so we can create events that the Penn 24’ class deserves ",
        "Host events that connect Penn to the Philly community ",
        "Use my position to create a sense of belonging and community for my fellow peers "
      ],
      "name": "Joyce Davis",
      "introduction": "My name is Joyce David and I am a freshman in the college studying neuroscience. I am running for VP of internal affairs because I want to use my position to amplify the year and plan fun event for the class. I also hope to use my position to connect Penn to the Philly community so that we can give back to those in need. Despite not getting the freshman year we envisioned I hope to create and re-invent new ways to enjoy our Penn experience.",
      "facebook url": "",
      "instagram handle": "jd_dz12",
      "campaign website": "",
      "youtube video url": "https://youtube.com/shorts/8Xkxjr3B1Wg",
      "image": {
        "src": "../../../images/2020/NEC/elena-miller.jpeg"
      },
      "image name": "elena-miller.jpeg "
    }
  ]
}
