{
  "SEAS Representative": [
    {
      "platform points": [
        "Engineering Introductory Classes: increase opportunities for collaboration in introductory Engineering classes and advocate for more late-day passes.",
        "Summer Opportunities: Create a better network of internship and research opportunities for Engineering students (hopefully extend this project to the entire student body).",
        "Alumni Relations: Improve the current Penn Engineering alumni network to create a more symbiotic and fulfilling community for Engineering students.",
        "More! Engineering! Merch!"
      ],
      "name": "Chiadika Eleh",
      "introduction": "Hello! My name is Chiadika Eleh, and I am a freshman studying Bioengineering and Computer Science. During my time at Penn, I have served as the Director of the Advocacy Committee on SEAS Wellness, a Board Member on the Engineering Deans Advisory Board, and the Freshman Representative on Nigerians at Penn. I have also had the great honor of serving on the Undergraduate Assembly as an Associate Member. In my tenure, I helped SAC refine their club recruitment guidelines to better support students, helped organize free merchandise distribution for the student body, and am currently involved in designing the new PennInTouch software. As a member of the UA, I hope to continue to further improve the Penn experience for students and continue acting as a voice for the greater student body. ",
      "facebook url": "https://www.facebook.com/chiadika.eleh/",
      "instagram handle": "chiadika.e",
      "campaign website": "",
      "youtube video url": "",
      "image": {
        "src": "../../../images/2021/NEC/Chiadika-Eleh.jpeg"
      },
      "image name": "Chiadika-Eleh.jpeg "
    },
    {
      "platform points": [
        "Expanding mental health access and support in Penn Engineering - through increased mindfulness/fitness workshops, initiatives, and resources",
        "Highlighting diversity, equity, and inclusion - to ensure under-represented minorities, FGLI, and LGBTQ+ students are adequately represented in UA decision-making",
        "Encouraging a culture of open, honest communication within Penn Engineering - including safe spaces and town halls to voice frustrations and ideas/opportunities for change"
      ],
      "name": "Akshitha Vijay",
      "introduction": "Hi! I’m Akshitha, and I’m running to continue to serve you as one of your SEAS UA representatives! This past year, I delivered on my promise to make strides in wellness within Penn Engineering through the Fall 2020 Wellness Week Challenge and various mindfulness/fitness workshops. I would absolutely love the opportunity to continue to serve you to make tangible progress towards positive change in wellness and DEI initiatives as well as fostering a culture of open communication. Some additional fun facts about me: I love vegan baking, gaming, Bollywood, long walks, and graphic design. ",
      "facebook url": "",
      "instagram handle": "",
      "campaign website": "",
      "youtube video url": "",
      "image": {
        "src": "../../../images/2021/NEC/Akshitha-Vijay.jpeg"
      },
      "image name": "Akshitha-Vijay.jpeg "
    },
    {
      "platform points": [
        "Make Penn a more inclusive and accepting community for all folks",
        "Wellness Initiatives like Wellness TAs and more understanding late policies",
        "Reserving classrooms after school hours for students to study—so much of Penn’s collaboration space goes unused simply because its availability isn’t known to students",
        "Wellness Spaces/Reflection Rooms around campus, in particular in the Engineering Quad"
      ],
      "name": "Sarthak Jain",
      "introduction": "Hi! My name is Sarthak Jain, and I’m a CIS & Econ major from Jaipur, India. I'm running for re-election to the UA, where I have served as the Director of Student & Campus Life last year and worked on projects related to wellness. Next year, I want to continue working on these initiatives and advocate for a more accepting and inclusive Penn. ",
      "facebook url": "",
      "instagram handle": "",
      "campaign website": "",
      "youtube video url": "",
      "image": {
        "src": "../../../images/2021/NEC/Sarthak-Jain.jpeg"
      },
      "image name": "Sarthak-Jain.jpeg "
    },
    {
      "platform points": [
        "Equity & Inclusion - Penn has a few summer bridge programs like PFP, STEP, etc. - Programs are not large enough to invite all incoming underrepresented students - Working to expand these programs",
        "Academics - Worked on encouraging professors to send out mid-semester feedback forms - Want to continue to ensure students feel that their opinions and concerns are being heard by their professors.",
        "Wellness - Mandate a presentation on wellness resouces available at Penn for all introductory classes - Create a comprehensive guide that students can use to determine resources that are most appropriate for them."
      ],
      "name": "Neha Krishnaswamy",
      "introduction": "Hi! I'm a sophomore from New Jersey studying bioengineering and I’m super excited to be running for the Undergraduate Assembly as a SEAS Representative. I have already served one year on the UA and have worked on initiatives that help foster inclusivity on campus. I am currently working on expanding the PFP/STEP programs so that more underrepresented students have the opportunity to successfully transition to Penn’s rigorous coursework. I'm excited to continue working on this project next year if elected and also other DE&I and wellness based projects to ensure that all Penn students find a welcome space on campus. ",
      "facebook url": "",
      "instagram handle": "",
      "campaign website": "",
      "youtube video url": "",
      "image": {
        "src": "../../../images/2021/NEC/Neha-Krishnaswamy.jpeg"
      },
      "image name": "Neha-Krishnaswamy.jpeg "
    }
  ],
  "Nursing Representative": [
    {
      "platform points": [
        "The establishment and implementation of efficacious, no-cost mental health programs and resources for the entire student body",
        "Ensuring that funding is allocated to students in a way that benefits them regardless of university profit",
        "Building solutions to social problems and providing the necessary education for all to understand these problems",
        "Bringing about a more positive relationship between Penn and the Philadelphia community.  ",
        "Advocate for students in the School of Nursing to feel they work in a fair, safe environment and always address any needs they have"
      ],
      "name": "Sarah Klepesky",
      "introduction": "I am Sarah Klepesky, a freshman in the School of Nursing, and I am running for the UA Nursing Representative position.  I am running for this position to advocate for the students in the School of Nursing, and seek to improve life at Penn for all students.  I also intend to help improve the relationship Penn has with the Philadelphia community as it is especially important to me being from Philadelphia.  Through years of leadership and community experience, I believe that I will be a great fit for this position. ",
      "facebook url": "https://www.facebook.com/sarah.klepesky",
      "instagram handle": "sarahklepesky",
      "campaign website": "",
      "youtube video url": "",
      "image": {
        "src": "../../../images/2021/NEC/Sarah-Klepesky.jpeg"
      },
      "image name": "Sarah-Klepesky.jpeg "
    }
  ],
  "Wharton Representative": [
    {
      "platform points": [
        "I will push Penn administration towards a revamp of the Sophomore Dining Experience",
        "I will not shy away from criticizing Penn policies according to your thoughts, and I will not back down until students see the results they require.",
        "I will be a voice for First Generation, Low Income students.",
        "I will work to improve first-year Wharton advising, making advice more helpful and accessible.",
        "Most importantly, I will actively seek Wharton student opinions, ensuring that issues you face are on the agenda."
      ],
      "name": "Faith Bochert",
      "introduction": "I was inspired to run for Wharton Rep when I realized just how much change needed to happen here - and how much Penn administration needed to be pushed to make those changes. I started a petition that garnered over 700 signatures to cancel next year's sophomore dining plan, and the support I received from the student body demonstrated just how important it is that students are better involved in Penn's decision-making process. I want to take the thoughts of students and put them into action, making Penn and Wharton a place we have the power to shape.",
      "facebook url": "https://www.facebook.com/faith.bochert",
      "instagram handle": "faithbochert",
      "campaign website": "",
      "youtube video url": "",
      "image": {
        "src": "../../../images/2021/NEC/Faith-Bochert.jpeg"
      },
      "image name": "Faith-Bochert.jpeg "
    },
    {
      "platform points": [
        "Penn Culture - Push for more academic leniency with policies like P/F to target the root of toxic Penn culture",
        "Diverse Recruitment - Make sure the UA targets diverse communities when asking for applications to be UA Associate Members",
        "Transfer Program Community - Next year I plan on focusing on a transfer program community in the high rises to make sure transfers have an easier time making friends.",
        "Traffic light - Fix the traffic light at 38th & Spruce. It is so dangerous! DPS should put more pressure on the city to fix it."
      ],
      "name": "Carson Sheumaker",
      "introduction": "Hey guys, I'm Carson Sheumaker. This year I've served on both the UA as the UA Secretary and Class Board as your Wharton Chair. I'm very passionate about getting the most fire merch for our class and improving student campus life for all classes.",
      "facebook url": "https://www.facebook.com/carson.sheumaker",
      "instagram handle": "sheumakerforwharton",
      "campaign website": "",
      "youtube video url": "",
      "image": {
        "src": "../../../images/2021/NEC/Carson-Sheumaker.jpeg"
      },
      "image name": "Carson-Sheumaker.jpeg "
    },
    {
      "platform points": [
        "Addressing mental health, I will be utilizing data I have collected throughout the last semester to encourage more conversations to admin about the mental health concerns of the student body. ",
        "With many feeling lost communal ties due to covid, a large initiative I will undergo will be for events, as allowable as possible, to reconnect with and meet people.",
        "Looking directly towards my potential responsibilities as Wharton Class Chair, I will fight for the traditions and key events that the Class of 2024 lost.",
        "With internships and the job market in shambles, I will work to connect the two positions to market common and unknown Penn resources in helping students with these fields. ",
        "In specific regards to the Class of 2024, I have been and will continue to fight for exceptions to the rule requiring second year dining and housing."
      ],
      "name": "Tristan Maslar",
      "introduction": "Hey everyone, I want to be your Wharton Class Chair as well as a Wharton representative on the Undergraduate Assembly. I am a FGLI student and am currently a freshman. This past year, I have been an Associate Member of the UA and worked on a mental health campaign designed at promoting awareness for the new struggles of the freshman class. I am very passionate about mental health at Penn and will be working to connect the duality of responsibilities of each position to embrace more community throughout the Class of 2024, Wharton, and larger student body.",
      "facebook url": "",
      "instagram handle": "tristan_m20",
      "campaign website": "",
      "youtube video url": "",
      "image": {
        "src": "../../../images/2021/NEC/Tristan-Maslar.jpeg"
      },
      "image name": "Tristan-Maslar.jpeg "
    },
    {
      "platform points": [
        "Community- I really want to make up for our COVID freshman year with more free food, free merch, and free events than you can imagine.",
        "Mental Health- The pandemic has revealed the gap in mental health programs that Penn offers, and I’ll advocate for more mental health resources and peer-to-peer support.",
        "Sustainability- You’ll never catch me without my reusable blue bag, but I’m still concerned about the overwhelming plastic and waste on campus, which I’m working with Penn Environmental Group to change.",
        "Penn Math- I’ve been working with the Penn math department to improve communication/feedback between students and professors.",
        "Dining- No one wants to be forced to eat on the dining plan. Enough said."
      ],
      "name": "Shan Shan Liang",
      "introduction": "My name is Shan Shan Liang, and I’m a freshman studying Finance and Business Analytics in Wharton. As an Undergrad Assembly rep, I’ve loved my experience pushing for change at Penn, along with the friends/mentors I found in the process. After working with Penn math and environmental groups this past year, I’m running for both UA Wharton Chair and Class Board VP of External because I can leverage my experiences and use both roles together to improve community, mental health, sustainability, academics, and dining. In my free time, I enjoy baking, hiking, and exploring food places in Philadelphia. ",
      "facebook url": "",
      "instagram handle": "shanshanliang_",
      "campaign website": "",
      "youtube video url": "https://youtu.be/XDY19nqui7I",
      "image": {
        "src": "../../../images/2021/NEC/Shan-Shan-Liang.jpeg"
      },
      "image name": "Shan-Shan-Liang.jpeg "
    },
    {
      "platform points": [
        "Canceling Penn Face – Actively combat the campus norm that is Penn Face and promote an authentic/healthy environment. ",
        "Recreating The Freshmen Year Experience – Plan an in-person NSO week for the class of 2024 to get back the time and experiences we lost to the pandemic. ",
        "Improved Dining Experience – Abolish the “second year dining experience” and provide more options for vegan/vegetarian/halal/kosher students and more at our dining halls. ",
        "School Unity – Connect and unify the student body through various events promoting intra school interaction. ",
        "Equity and Inclusion – Advocate for need-blind admissions for international students and mandated implicit bias training for club leaders coordinating recruitment. "
      ],
      "name": "Prabh Dhaliwal",
      "introduction": "Hi everyone, my name’s Prabh and I’m excited to run for Class Board 2024 President and UA Wharton Representative! This past year, I’ve had a blast planning our '24 virtual ECON Scream event as a part of the Class Board 2024 First Year Committee and advocating for more equitable club recruitment as a member of the UA. With next semester poised to be more “normal,” I hope I have the opportunity to make OUR Penn experience the best it can be. Thank you so much and remember — Vote Prabh to get your PRABHlems resolved!",
      "facebook url": "https://www.facebook.com/profile.php?id=100007102503333",
      "instagram handle": "prabhsdhaliwal",
      "campaign website": "https://sites.google.com/wharton.upenn.edu/prabhdhaliwal",
      "youtube video url": "https://youtu.be/zrdttSDVc3w",
      "image": {
        "src": "../../../images/2021/NEC/Prabh-Dhaliwal.jpeg"
      },
      "image name": "Prabh-Dhaliwal.jpeg "
    },
    {
      "platform points": [
        "Embedding DEI into the all areas of Penn life",
        "Ensuring that students can succeed at Penn no matter their background",
        "Bringing more innovative tools in for student use to make the student experience more seamless ",
        "Encouraging transparency between faculty, admin, and students"
      ],
      "name": "Xavier Shankle",
      "introduction": "As an associate member for the past year, I have made student advocacy my top priority. I created PSA announcements encouraging professors to be conscious of course costs. I’ve lobbied for the repeal of the second-year dining requirement. I worked to raise awareness for discrepancies in Math course naming. Building a better, more equitable Penn has been my goal since coming to Penn, and despite these advancements, my work is not finished. Students deserve a representative who will stop at nothing to make a change, and I would love the opportunity to continue to do so in the next session.",
      "facebook url": "https://www.facebook.com/xavier.shankle/",
      "instagram handle": "",
      "campaign website": "",
      "youtube video url": "",
      "image": {
        "src": "../../../images/2021/NEC/Xavier-Shankle.jpeg"
      },
      "image name": "Xavier-Shankle.jpeg "
    },
    {
      "platform points": [
        "Increasing Engagement: I want to make sure that as many members of our class as possible feel involved or engaged in class-wide activities/events. It's very important that we leave no individual in our class alone.",
        "Supporting Minorities & POC: As a POC, I have found a great community at Penn, and I hope to push for greater inclusion within the UA to amplify minority voices.",
        "Mental Health: I would like to work on a project that helps each of our class members check in on each other throughout the semester, possibly working with CAPS. This could be through forums or platforms such as GroupMe.",
        "",
        "",
        ""
      ],
      "name": "Joel Olujide",
      "introduction": "Hi! My name is Joel and I'm back again, running to be your Class Board Executive Vice President! I've really enjoyed serving this past semester to help create programming for our class and facilitate spaces for all of us to come together. I hope to continue to support our class as new challenges arise, and to make sure that we enjoy every moment we have while we're at Penn!",
      "facebook url": "",
      "instagram handle": "joelolujide",
      "campaign website": "",
      "youtube video url": "",
      "image": {
        "src": "../../../images/2021/NEC/Joel-Olujide.jpeg"
      },
      "image name": "Joel-Olujide.jpeg "
    },
    {
      "platform points": [
        "Improving the dining experience and providing realistic feedback to administrators",
        "Equity in treatment for all students on campus and allocating resources towards uplifting minority groups",
        "Making Penn a sustainable institution",
        "Holding Penn accountable for its impact on the Philadelphia community",
        "Transparency between the administration and the student body regarding administrative decisionm",
        "Paying attention to issues that affect the entire student body, and acute issues that affect a small number of students"
      ],
      "name": "Caroline Li",
      "introduction": "I'm a freshman, and I'm currently an associate member on the UA doing work with the sophomore dining plan, dining workers, religious holidays policy, and sustainability. I'm running for the UA because I care a lot about clear communication between the administration, the UA, and the student body, and I believe that the UA is capable of holding the administration accountable to justify their decisions, as well as leverage extensive school resources in a way that benefits students. ",
      "facebook url": "",
      "instagram handle": "en.il.orac",
      "campaign website": "",
      "youtube video url": "",
      "image": {
        "src": "../../../images/2021/NEC/Caroline-Li.jpeg"
      },
      "image name": "Caroline-Li.jpeg "
    },
    {
      "platform points": [
        "Reformation of Academic Policies",
        "Working with FGLI and International Students"
      ],
      "name": "Thomas Kyong",
      "introduction": "During my time as a UA Representative, I will be working on alleviating academic policies next fall. I plan to gather the voices of our student body and fight for equitable academic opportunities that will enhance the quality of our education. Moreover, I hope to continue working with first generation/low-income and international students on changing Penn for the greater good. Vote Thomas Kyong for UA! ",
      "facebook url": "",
      "instagram handle": "mrkyong",
      "campaign website": "",
      "youtube video url": "",
      "image": {
        "src": "../../../images/2021/NEC/Thomas-Kyong.jpeg"
      },
      "image name": "Thomas-Kyong.jpeg "
    }
  ],
  "College of Arts & Sciences Representative": [
    {
      "platform points": [
        "Postpone the Pass/Fail Deadline so that we can see our grades before deciding whether or not to pass/fail. ",
        "Implement a wait list for courses on Penn inTouch so we don't have to decrease stress associated with trying to get courses.",
        "Reach out to faculty to organize open forums to promote better communication between students and faculty.",
        "I value your input and would be open to suggestions! :D"
      ],
      "name": "Amy Wu",
      "introduction": "Hi everyone! I'm Amy, a freshman in the College studying neuroscience! :D Having served as an associate member on the UA this year, I want to run for election as a SAS representative for the 2021-2022 academic year. During my term as an associate member this year, I actively reached out to faculty, the Registar's Office, Career Services, and others to fight to change math course names on transcripts; conducted surveys to evaluate what concerns members of the student body have; helped organize the Freshmen Forum; was involved with the creation of the Freshmen Committee on the UA; and was involved with extension of unlimited pass/fail grading for the Spring 2021 semester. If elected to serve on the UA next year, I will continue working on academic initiatives to promote a more fulfilling experience for everyone. If you have any questions, comments, or concerns, please reach out to me at amwu3@sas.upenn.edu! :D",
      "facebook url": "",
      "instagram handle": "awu3.14",
      "campaign website": "",
      "youtube video url": "https://drive.google.com/file/d/11glGIiEgAenX1nAIMgUvkVUJdPDuU8G5/view",
      "image": {
        "src": "../../../images/2021/NEC/Amy-Wu.jpeg"
      },
      "image name": "Amy-Wu.jpeg "
    },
    {
      "platform points": [
        "West Philadelphia: We need to support the West Philadelphia community by pushing for adequate PILOTs, expanded community engagement, and proper recognition for the service workers keeping campus clean and safe.",
        "Class Spirit: We can’t just simply move-on from losing our Freshman year. As soon as it’s safe, I will fight to get back the celebrations (and free merch!) we’ve earned.",
        "Student Voice: Penn administration has time-and-time again disregarded students’ best interests. I will always prioritize our voices and challenge admin when we are not being heard. ",
        "Dining: The Sophomore dining plan is outrageous and it must be removed. I will also push for dining dollars to have more functionality, such as at Honeygrow or Franklin’s Table.",
        "Wellness: Penn must re-evaluate student wellness. Students need real mental health days (not a Spring Break replacement), including election day, and professors must recognize when students are being overworked.",
        "Class Board Culture: Many upperclassmen have expressed concerns to me about Class Board being unhelpful for students. Class Board must instill class spirit, but also lobby for change that matters."
      ],
      "name": "Charlie Schumer",
      "introduction": "Hello! I’m running to build community while uplifting student voices. I pledge to get back our stolen experiences, but also support students and West Philadelphia. Please evaluate candidates based on actions, not just words. I’ve spent the school year working for a Philly-based food bank, contributing community service through the civic house, and learning in an academically-based community service course. I led planning for Econ Scream and class merch orders on the First Year Committee, and I also work with Penn PORES, Hill House Council, and my acapella group. Connect on Instagram @chuck4penn or text 651-900-5061 (Accepting all GamePigeon requests)!",
      "image": {
        "src": "../../../images/2021/NEC/Charles-Schumer.jpeg"
      },
      "image name": "Charles-Schumer.jpeg ",
      "facebook url": "https://www.facebook.com/charlie.schumer",
      "instagram handle": "chuck4penn",
      "campaign website": "https://sites.google.com/sas.upenn.edu/chuckforpenn",
      "youtube video url": "https://youtu.be/E5Mha0ARdVE"
    },
    {
      "platform points": [
        "Promote campaigns and events with Student Financial Services that allow students to better understand their financial aid and financial programs they’re entitled to at Penn. ",
        "Promote initiatives that help better accommodate FGLI students with unstable access to internet / unreliable access technology. ",
        "Create a new class review system similar to Penn Course Review where students can provide commentary on their individual experiences in courses at Penn.",
        "Continue to support the expansion and relocation of Cultural Centers from the ARCH basement."
      ],
      "name": "Tyler McCormick",
      "introduction": "Hi, My name is Tyler McCormick, and I am running for re-election on UA for College Representative. As a college representative, I hope to represent the voice of all Penn students and especially FGLI and minority students who are often underrepresented. We are currently living in very different times and with this many new problems have arisen in the realm of equity and access to education. If I elected I will put forth initiatives that will help students better handle the new form of schooling we are experiencing. I also will make sure to continue to support current initiatives dedicated to making underrepresented students feel more comfortable here at Penn. ",
      "facebook url": "",
      "instagram handle": "t_mac221",
      "campaign website": "",
      "youtube video url": "",
      "image": {
        "src": "../../../images/2021/NEC/Tyler-McCormick.jpeg"
      },
      "image name": "Tyler-McCormick.jpeg "
    },
    {
      "platform points": [
        "Amplifying the voices and needs of students of color on Penn’s campus with prioritization of the 6B’s initiatives to promote inclusivity through centralized spaces for these communities on Locust Walk.",
        "Working with our administration to ensure that the class of 2024 and forthcoming years feel a sense of belonging within the Penn community in our socially-distant new normal.",
        "Organizing active, sustained partnerships with the West Philadelphia community based on the needs they describe to us, giving students the opportunity to serve in meaningful and impactful ways.",
        "Working to enhance the diversity of CAPS and the identities represented in their offices, fostering a more welcoming and representative environment for students of color.",
        "Advocating for a bolstering of the Asian American Studies Program through the hiring of more professors and seeing overall greater support from administration for the program.",
        "Increased transparency between the UA and student body. We should know what you want us to advocate for and you should know how we are doing that. "
      ],
      "name": "Alex Eapen",
      "introduction": "Hello! My name is Alex Eapen and I am excited to be running for UA SAS Representative! A child of immigrants and product of public schools, I believe in the power of diverse voices and equity in education to foster change. What makes Penn great is our students and their different walks of life. With the UA, I have worked alongside administration to transform NSO to highlight this diversity. As a UC representative, I have also lobbied administration on behalf of the 6B’s equity-focused initiatives. I would be grateful for the opportunity to continue this important work as your representative. ",
      "facebook url": "https://www.facebook.com/AlexEapenForUA",
      "instagram handle": "alex.eapenn",
      "campaign website": "",
      "youtube video url": "",
      "image": {
        "src": "../../../images/2021/NEC/Alexander-Eapen.jpeg"
      },
      "image name": "Alexander-Eapen.jpeg "
    },
    {
      "platform points": [
        "Mental Health: Attending a prestigious university doesn’t have to make you miserable. I will fight for a serious reevaluation and expansion of the mental health resources currently available to us.",
        "Transparency: We deserve to know when decisions are made regarding our Penn experience!! I will work to ensure admin makes decisions about dining and breaks with us, not for us.",
        "Spirit: This year has flown by without fun traditions to counteract academics. As soon as it’s safe, I will organize events--with food and merch!!--to reclaim the year we’ve lost.",
        "ASAM program: Admin’s contributions to the Asian community on campus have been seriously lacking. I promise to advocate for the retention and expansion of the ASAM program.",
        "West Philadelphia: We have the power to support our new West Philly community beyond simple Instagram story bingo boards--through the payment of PILOTs, community service projects, and political advocacy. ",
        "Communication: Student government representatives are just that: representatives for your voice and ideas!! I promise to constantly communicate with you guys, keeping you informed and involved in conversations with administration."
      ],
      "name": "Summer Maher",
      "introduction": "Hello!! My name’s Summer Maher & I’m super excited to be running for CB VP of Internal Affairs, as well as UA College Representative. Through fun events as a break from rigorous academics, advocacy on behalf of students and the West Philly community, and an insistence on transparency from administration, I'm looking forward to the chance to shape our Penn experience by always placing power in the hands of students, not administration. Please share your visions for this campaign with me on Instagram @summerranna or text 609-500-2176--because what’s a priority for you, is a priority for me!!",
      "facebook url": "https://www.facebook.com/summerrannamaher",
      "instagram handle": "summerranna",
      "campaign website": "",
      "youtube video url": "",
      "image": {
        "src": "../../../images/2021/NEC/Summer-Maher.jpeg"
      },
      "image name": "Summer-Maher.jpeg "
    },
    {
      "platform points": [
        "“Penn Face” is real. My goal is to act on the 300+ responses I compiled regarding experiences in this virtual environment and implement more resources on the Penn Mobile app.",
        "I’ve been fortunate enough to get involved in PAACH and South Asia Society. I plan to fight for increased funding and facilities for ALL cultural communities here at Penn.",
        "As UA Communications Director, I’ve seen how disconnected the student body can be from student government. I hope to host monthly forums for all SAS students to discuss current issues.",
        "As an elected member, I will work with my peers to advocate for increased guidance from faculty and more technology resources to FGLI students.",
        "The Dining experiences here have not been ideal. I plan to fight for the removal of the mandatory dining plan for sophomores, as well as increased diversity of meal options.",
        "As a dancer, I value all forms of art. I will work with the Performing Arts Council and other artistic groups to fight for increased funding/resources of arts communities."
      ],
      "name": "Pranav Tadikonda",
      "introduction": "Hi everyone! As a member of the UA Reopening and Response committee, I’ve worked hard with fellow first years to foster an inclusive environment and advocate for increased mental health resources. Additionally, as the only first year member of the UA Cabinet, I have been able to fight for initiatives that the Class of 2024 cares about, from eradicating the expensive dining plan to implementing valuable resources for a smooth transition to college life. As an Associate Member and Communications Director, my biggest goal has been outreach and inclusivity, and I hope to continue this fight as an elected member.",
      "facebook url": "",
      "instagram handle": "PranavTadikonda",
      "campaign website": "",
      "youtube video url": "",
      "image": {
        "src": "../../../images/2021/NEC/Pranav-Tadikonda.jpeg"
      },
      "image name": "Pranav-Tadikonda.jpeg "
    },
    {
      "platform points": [
        "Modified Pass/Fail Policies: Students should have a greater length of time before the pass/fail deadline approaches, as the prior deadline does not allow for accurate knowledge of one's class grade.",
        "Increased Pre-Major Advising: I will emphasize the need for improved pre-major and pre-professional advising, including increased frequency of communication between advisors and advisees.",
        "Class Hybridity Features: Once classes resume in person, certain class features like office hours or review sessions should be offered online, as such options can improve convenience and attendance. ",
        "College Community Sessions: Offer social and pre-professional events for College students to interact with one another in fun, safe, and consistent manner."
      ],
      "name": "Yash Rajani",
      "introduction": "My name is Yash Rajani, and I am a first-year student in the College intending to major in Mathematical Economics. Outside the classroom, I am involved in the College Dean’s Advisory Board, Wharton Undergraduate Finance Club, and Undergraduate Economics Society, and I enjoy traveling, cooking, playing tennis, and spending time with family and friends. As your UA SAS Representative, I will bring forth a strong sense of proactivity, determination, and sociability to foster fluid communication. Your problems and concerns will become my priorities, and – together – we will enact meaningful change and strengthen our community.",
      "facebook url": "https://www.facebook.com/yash.rajani.7549",
      "instagram handle": "yashrrajani",
      "campaign website": "www.yashrajani.com",
      "youtube video url": "https://youtu.be/Mk_UAF32dkE",
      "image": {
        "src": "../../../images/2021/NEC/Yash-Rajani.jpeg"
      },
      "image name": "Yash-Rajani.jpeg "
    },
    {
      "platform points": [
        "Representation: Worked with minority groups to ensure that the UA was advocating for issues that students actually care about. I will open even more lines of communication so UA Projects are direct responses to student problems",
        "Transparency: I focused on the Morton collection and student demands for more transparency. Successfully established continual communication with the Museum to establish Undergraduate representation moving forward. I will utilize my experience to address transparency issues with the two-year dining plan",
        "Engagement: Planned and hosted a freshman forum. Planned and co-hosted a series of DEI career events. I will work to ensure there is nothing blocking students from engaging with Penn’s resources"
      ],
      "name": "Daniela Uribe",
      "introduction": "My name is Daniela Uribe and I am running for the position of School of Arts and Sciences Representative to the Undergraduate Assembly. As a proud Latina and first Generation American,I know how important it is to use my voice to uplift others. As an associate member on the UA this year, I worked hard to uplift student voices and fight for their needs on every zoom call. I am ready and willing to give 100 percent of my energy to this important work so that we all feel valued within the Penn community and fulfilled by our Penn experience. ",
      "facebook url": "https://www.facebook.com/DanielaforUArep/",
      "instagram handle": "danielaforUArep",
      "campaign website": "",
      "youtube video url": "",
      "image": {
        "src": "../../../images/2021/NEC/Daniela-Uribe.jpeg"
      },
      "image name": "Daniela-Uribe.jpeg "
    },
    {
      "platform points": [
        "Advocacy: Especially during a time that prompts many concerns, it will be my priority to make sure that the concerns of students are being addressed and resolved.",
        "Transparency: It is incredibly important to keep undergraduate students informed about the projects undertaken by the Undergraduate Assembly.",
        "Accessibility: Information is only valuable if it is accessible. It is imperative to make sure that work done in the Undergraduate Assembly is readily available to all who need it.",
        "Engagement: There is a plethora of opportunities in West Philadelphia for undergraduates to participate in civic engagement. I  hope to promote ABCs courses and programs in Penn Centers to volunteer. "
      ],
      "name": "Keerthi Jayaraman",
      "introduction": "Having previously served as a SAS Representative for the Undergraduate Assembly, Keerthi Jayaraman has strived to voice student concerns and work with administrators to remedy them. The COVID-19 pandemic continues to create numerous challenges and prompt endless questions. If elected, it will be a priority to provide students with prompt, accessible, and up-to-date information about academic policies and COVID-19 safety protocol. She also hopes to increase civic engagement on campus by providing information about a diverse array of opportunities. Finally, Jayaraman hopes to continue her work with the Academic Initiatives Committee to advocate for the academic rights of students. ",
      "facebook url": "",
      "instagram handle": "keerthi.jayaraman",
      "campaign website": "",
      "youtube video url": "",
      "image": {
        "src": "../../../images/2021/NEC/Keerthi-Jayaraman.jpeg"
      },
      "image name": "Keerthi-Jayaraman.jpeg "
    },
    {
      "platform points": [
        "Address the ominous gap in financial resource availability between FGLI students and students that come from backgrounds of wealth. ",
        "Collaborate with the Penn administration to host monthly town hall meetings to address financial and mental health concerns, because I STILL have not run into Amy Gutmann on Locust <3.",
        "Carefully assess what we consider the new “normal” after COVID-19; address new issues such as the second year dining plan, two year housing requirement, and the new block scheduling system.",
        "Expand mental health resources past just CAPS. Collaborate more with professors and those actually assigning work to students to ensure we are maintaining reasonable and realistic expectations. ",
        "As a powerful, established branch of the student government, we will continue to pressure Penn to truly fund PILOTs and hold themselves accountable for the historical gentrification of Western Philadelphia. "
      ],
      "name": "Alex Wenig",
      "introduction": "Hi everyone! My name is Alex Wenig and I am a freshman in the CAS. I am running for UA with two main focuses: mental health and financial/FGLI-related resources. These are relevant because though Penn is at the top of college rankings lists, it also ranks high with mental illness and socioeconomic inequality. Many in Penn’s administration make decisions that reflect this idea that we have to choose between our ranking and our humanity, but we do not. We can retain our strength as an institution while improving issues that seem to have defined the student body for decades. ",
      "facebook url": "",
      "instagram handle": "alexxwenig_",
      "campaign website": "",
      "youtube video url": "https://youtu.be/iDawpXnWW2U",
      "image": {
        "src": "../../../images/2021/NEC/Alexander-Wenig.jpeg"
      },
      "image name": "Alexander-Wenig.jpeg "
    },
    {
      "platform points": [
        "CAPS - Wellness check-ins for all students, ensuring each student has a point of contact in CAPS Expand services to provide support and address the impact of current events on students",
        "Popping the Penn Bubble - Acknowledging the consequences of Penn’s decisions beyond campus, especially within Philadelphia Pay PILOTS Divest from fossil fuels and focus on creating a sustainable campus",
        "Sexual Assault - Re-evaluating the way Penn responds to sexual assault and student misconduct Cheating shouldn’t be what gets a student kicked out of the university when sexual assault remains unpunished ",
        "Transitioning In-Person Successfully - Create opportunities for Class of 2024 to engage with one another and become comfortable on campus Collaborating with career services to create additional opportunities for students",
        "Inclusivity of All Students -Increasing economic and racial diversity in the student body Making sure that FGLI students feel welcome on campus and Penn services are accessible Accommodating dining needs ",
        "Affordability at Penn Recognizing the implications of obligatory dining and housing plans, creating more affordable options for students Combating tuition inflation Expanding financial aid packages for students impacted by COVID"
      ],
      "name": "Ranim Albarkawi",
      "introduction": "Hello everybody! My name is Ranim Albarkawi and I am freshman in the college. I am passionate about making Penn a more equitable and nurturing community for all its students. I would love to run for UA to be a part of an organization that can more directly advocate for change and influence decisions made at Penn. Thank you so much! Please contact me if you have any questions or concerns (ranimalb@sas.upenn.edu)",
      "facebook url": "",
      "instagram handle": "ranima4ua",
      "campaign website": "",
      "youtube video url": "https://www.youtube.com/watch?v=YksH-8KTELk",
      "image": {
        "src": "../../../images/2021/NEC/Ranim-Albarkawi.jpeg"
      },
      "image name": "Ranim-Albarkawi.jpeg "
    },
    {
      "platform points": [
        "Dining Swipes for MERT volunteers ",
        "Networking events ",
        "Remote and In-Person Research/Internship Opportunities ",
        "Making the Dining Plan for Sophomores optional ",
        "Reorganization of the Student Employment Portal"
      ],
      "name": "Makaeel (Mikey) Sheikh",
      "introduction": "Hi all! My name is Mikey and I’m running for re-election to be one of your SAS representatives. The College encompasses students of a wide variety of study and thought, which is one reason why its students are so unique in their own ways. As a SAS rep this year, I had the pleasure of working with so many of our peers on various projects. With this Fall projected to be in person, I look forward to working with your other representatives to plan various events and programs to allow for networking opportunities as well as finding internships/research opportunities throughout an important year for many of us in our time at Penn. I hope to count on your vote and if you have any questions or potential projects you wish to see carried out please contact me: msheikh@sas.upenn.edu",
      "facebook url": "",
      "instagram handle": "mikeysheikh",
      "campaign website": "",
      "youtube video url": "",
      "image": {
        "src": "../../../images/2021/NEC/Makaeel-Sheikh.jpeg"
      },
      "image name": "Makaeel-Sheikh.jpeg"
    },
    {
      "platform points": [
        "Make class recordings mandatory even when we return to in-person learning",
        "Improve UA accessibility through increased publicity, office hours and anonymous drop-boxes",
        "MORE ACCESSIBLE PREMED ADVISING ",
        "Phone charger stations in the dorm lobbies. I hate when my phone dies and the security guards lecture me for 20 minutes about it"
      ],
      "name": "Sarah A. Ramadan",
      "introduction": "Sarah is a first-generation Brazilian-Egyptian studying Neuroscience. This was her first session with the UA, but it was quite eventful. During her time on the Equity and Inclusion committee, she and Joel successfully spearheaded an effort to expand dining hall food donations and to ensure that every one of Penn’s dining halls are able to sustainably donate unserved food to Philabundance. Though her time was short due to a late start to the UA session, she hopes to be reelected to continue efforts to improve the Penn community.",
      "facebook url": "",
      "instagram handle": "sarah.ram",
      "campaign website": "",
      "youtube video url": "",
      "image": {
        "src": "../../../images/2021/NEC/Sarah-Ramadan.jpeg"
      },
      "image name": "Sarah-Ramadan.jpeg "
    },
    {
      "platform points": [
        "International student advocacy - continue working with SRFS and ISSS to advocate for International student needs, including continuing to push for need blind admissions for international students.",
        "Increase funding for underrepresented student groups - push for Penn to allocate more resources to organizations for underrepresented student groups like the 6B organisations.",
        "Penn Dining initiatives - expand the use of dining dollars to more stores and food places around campus, as well as dietary restriction advocacy (Halal, Vegan, Vegetarian).",
        "PennLabs - work with PennLabs to make Penn related resources, like CAPS, Career services, the Tutoring center, etc. more accessible to Penn students through the PennMobile app.",
        "Morton Collection - This is a collection of human skulls owned by the Penn Museum and is explicitly linked to the university's historical ties with racism. I want to keep pushing for undergraduate voices to be added to the conversation surrounding this collection, and advocating for repatriation of these remains.",
        "Better communication - improve transparency and feedback between the UA and the student Body, as well as partnerships between the UA and other branches of student government, such as CB’24 to build community."
      ],
      "name": "Josias Zongo",
      "introduction": "Hey! I’m Josias Zongo (he/him/his), a freshman in college, from Accra, Ghana, hoping to major in Economics and International Relations. I loved working on projects as an Associate Member on the UA this academic year, which is why I'm hoping to continue the work I’ve been doing next year as a College Representative. As a FGLI, black, international student, I am truly passionate about addressing the needs of underrepresented groups & minorities around campus and making the Penn experience more enjoyable for all students. Next year, I also hope to listen more to the students and advocate for issues that matter the most to you!",
      "facebook url": "https://www.facebook.com/Josias.Zongo.015/",
      "instagram handle": "zongo_josias",
      "campaign website": "",
      "youtube video url": "",
      "image": {
        "src": "../../../images/2021/NEC/Josias-Zongo.jpeg"
      },
      "image name": "Josias-Zongo.jpeg "
    },
    {
      "platform points": [
        "Establish a fair conversion rate from meal swipes to dining dollars that is more flexible and reasonable than the current punitive structure.",
        "Reduce the amount of clubs that require both an application and interview process for acceptance.",
        "Revamp and renovate Houston Hall to be a more social space on campus for the fall.",
        "Create more mindfulness spaces on campus for when student return.",
        "Expand the amount of dining plan options available to students (especially sophomores).",
        "Finally, remember Isabella HASSETT HAS what IT takes."
      ],
      "name": "Isabella Hassett",
      "introduction": "My name is Isabella Hassett, and I am running for re-election on the Undergraduate Assembly as an SAS representative. I am a rising junior majoring in Communications. My experiences of serving as a representative on the UA the past two years and, in high school, as President of my class for three years and one year as Student Body President gives me the experience necessary to do the job well. I believe that to maximize our experience this year, Penn must remain interconnected (virtually for now of course), regardless of one’s race, gender, religion, sexual orientation, or nationality.",
      "facebook url": "",
      "instagram handle": "",
      "campaign website": "",
      "youtube video url": "",
      "image": {
        "src": "../../../images/2021/NEC/Isabella-Hassett.jpeg"
      },
      "image name": "Isabella-Hassett.jpeg "
    }
  ],
  "Undergraduate Assembly President": [
    {
      "platform points": [
        "Tackling Student Needs: Uplifting the work of the 6B organizations with cultural houses and gender-inclusive restrooms; continuing free menstrual product provision across campus",
        "Bolstering Representation: Challenging administrators on their efforts to boost faculty diversity and retention, notably in ethnic studies departments (ie ASAM); pushing for more diverse queer and trans CAPS counselors",
        "Reopening Effectively: Urging for timely fall plan correspondence; putting safety at the forefront with more Penn Violence Prevention trainings for student groups; insisting on transparency regarding campus compact disciplinary action",
        "Championing Wellness: Expanding CAPS Let’s Talk hours and staff across campus locations; broadening dining plan options under the new mandate; driving utilization of the new PSG fund for social inclusivity ",
        "Holding Penn Accountable: Advocating for the payment of PILOTs and divestment from fossil fuels during our meetings with the President and Provost, echoing the demands of diverse student groups"
      ],
      "name": "Nikhil Gupta",
      "introduction": "Hello! The UA has been my primary involvement since my first semester, and I’m excited to lead the student body to new heights. As the only candidate who has served on the Executive Board, I possess the necessary experience and institutional knowledge to execute the role successfully. Initiatives I’ve led range from free menstrual products to a new weekly Chinatown shuttle. I’ve developed strong relationships with student groups, helping them receive funding with the $2.7 million I oversee as Treasurer. I’ve served on the Equity & Inclusion, Student & Campus Life, and Reopening & Response committees. It’s (U)S for (A)LL!",
      "facebook url": "https://www.facebook.com/gu.nikhil",
      "instagram handle": "nikhilgupta_",
      "campaign website": "",
      "youtube video url": "",
      "image": {
        "src": "../../../images/2021/NEC/Nikhil-Gupta.jpeg"
      },
      "image name": "Nikhil-Gupta.jpeg "
    },
    {
      "platform points": [
        "Diversity & Community Advancement: 1) Increased funding for POC events and opportunities, 2) Connecting each 6B group directly to administrators, 3) Increased Faculty diversity, 4) Addressing Penntrification, PILOTS, and Penn’s Environmental Impact",
        "Wellness & Mental Health: We need to dismantle Penn stereotypes to create a better and healthier student. 1) Hiring more POC Therapists & Psychiatrists for CAPS, 2) Hosting a Faculty and Student Town Hall about Mental Health in the Classroom",
        "Academic Reform: 1) Amending our schedule, including breaks, pass/fail, and add/drop dates, 2) Improving professor accountability and reducing course costs, 3) Replacing academic class requirements with more relevant topics (racial and environmental education)",
        "Administrative Accountability: 1)Improving transparency with financial aid especially for International and Transfer students, 2) Transparency as it pertains to Penn’s investment practices, 3) Ensuring that all students can be incorporated into university decisions"
      ],
      "name": "Tori Borlase",
      "introduction": "Hi y’all!  My name is Tori Borlase (she/her) and I’m running for President of the UA.  Growing up in the South as the queer, Latina daughter of an immigrant, I know that advocacy work requires tenacity, especially when institutions (like Penn) are resistant to change. As president, I will continue to be an advocate first, focusing on community concerns rather than pushing my own agenda.  Whether it was securing pass/fail grading, funding cultural student groups, or holding a Climate Seminar, I have shown I can make real change at Penn.  Visit http://bit.ly/toriandjanice4ua for more information!",
      "facebook url": "https://www.facebook.com/toriandjanice4ua",
      "instagram handle": "tborlase4",
      "campaign website": "http://bit.ly/toriandjanice4ua",
      "youtube video url": "",
      "image": {
        "src": "../../../images/2021/NEC/Victoria-Borlase.jpeg"
      },
      "image name": "Victoria-Borlase.jpeg "
    }
  ],
  "Undergraduate Assembly VP": [
    {
      "platform points": [
        "Tackling Student Needs: Uplifting the work of the 6B organizations with cultural houses and gender-inclusive restrooms; continuing free menstrual product provision across campus",
        "Bolstering Representation: Challenging administrators on their efforts to boost faculty diversity and retention, notably in ethnic studies departments (ie ASAM); pushing for more diverse queer and trans CAPS counselors",
        "Reopening Effectively: Urging for timely fall plan correspondence; putting safety at the forefront with more Penn Violence Prevention trainings for student groups; insisting on transparency regarding campus compact disciplinary action",
        "Championing Wellness: Expanding CAPS Let’s Talk hours and staff across campus locations; broadening dining plan options under the new mandate; driving utilization of the new PSG fund for social inclusivity",
        "Holding Penn Accountable: Advocating for the payment of PILOTs and divestment from fossil fuels during our meetings with the President and Provost, echoing the demands of diverse student groups"
      ],
      "name": "Gaby Montes",
      "introduction": "I’m Gaby Montes, running to be your UA Vice President! I have led a variety of projects since my freshman year while representing female, Latinx, Asian, FGLI, and LGBTQ+ populations. By using my UA experience on the Communications Team and as the Reopening & Response Committee Director with concrete administration connections, I will reinforce the relationship between the UA and student groups and continue to amplify the voices of the student body alongside Nikhil Gupta. Our teamwork has demonstrated success for the past 2 years and we cannot wait to enact tangible change next session; it’s (U)S for (A)LL!",
      "facebook url": "facebook.com/gaby.montesdeoca.52",
      "instagram handle": "gabymdo",
      "campaign website": "",
      "youtube video url": "",
      "image": {
        "src": "../../../images/2021/NEC/Gabriela-Montes.jpeg"
      },
      "image name": "Gabriela-Montes.jpeg "
    },
    {
      "platform points": [
        "Diversity & Community Advancement: 1) Increased funding for POC events and opportunities, 2) Connecting each 6B group directly to administrators, 3) Increased Faculty diversity, 4) Addressing Penntrification, PILOTS, and Penn’s Environmental Impact",
        "Wellness & Mental Health: We need to dismantle Penn stereotypes to create a better and healthier student. 1) Hiring more POC Therapists & Psychiatrists for CAPS, 2) Hosting a Faculty and Student Town Hall about Mental Health in the Classroom",
        "Academic Reform: 1)Amending our schedule, including breaks, pass/fail, and add/drop dates, 2) Improving professor accountability and reducing course costs, 3) Replacing academic class requirements with more relevant topics (racial and environmental education)",
        "Administrative Accountability: 1) Improving transparency with financial aid especially for International and Transfer students, 2) Transparency as it pertains to Penn’s investment practices, 3) Ensuring that all students can be incorporated into university decisions"
      ],
      "name": "Janice Owusu",
      "introduction": "Hi! I’m Janice (she/her), I’m running for VP of the UA. I want to reemphasize the student voice here at Penn. After three years of working to address student concerns, I worked on the Black Fund this summer, changed guidelines to make clubs more equitable, and served on administrative focus groups for Cultural houses. I want to elevate student concerns and not my own agenda . As a black, queer, FGLI student at Penn, I want to bring you into the room sour communities can be heard. Visit our site:http://bit.ly/toriandjanice4ua. Thanks for reading, happy voting!",
      "facebook url": "https://www.facebook.com/toriandjanice4ua",
      "instagram handle": "simply.gracious",
      "campaign website": "http://bit.ly/toriandjanice4ua",
      "youtube video url": "",
      "image": {
        "src": "../../../images/2021/NEC/Janice-Amoh.jpeg"
      },
      "image name": "Janice-Amoh.jpeg "
    }
  ]
}
