{
  "President": [
    {
      "name": "Derek Nhieu",
      "introduction": "Hello there! It's so crazy to believe that we are nearing the end of our time here at Penn. Time flies by so fast, and the pandemic definitely didn't help. It's been a pleasure serving as your President, and I am incredibly grateful to have had the opportunity to do so. Hopefully, with things beginning to return to normal, I want to use everything I've learned over the past three years to continue serving you as best as possible. I want to ensure that our last year at Penn is the most incredible one yet. Let's do this!",
      "platform points": [
        "Feb Club - Feb Club, Feb Club, Feb Club. Feb Club is my #1 priority for our senior year. Planning for it begins as early as this spring and is where much of my time and effort will go. Think cooler events with a cheaper price tag: more fun for everyone. After these past three years, we deserve it.",
        "More Merch - Class Board historically has not offered any merch during senior year. Let's change that. Remember all the merch you got the past few years? Why not complete the whole set? I want to continue offering cheaper and higher-quality merch to everyone. I'll make sure you're fitted up for the Gram - expect a lot of freebies, too.",
        "Free Food - Who doesn't love free food? COVID interfered with the plan this year, but times are changing. I'm looking to offer as much free food as I possibly can this upcoming year. Errbody eats, and we all know food tastes better when it's on someone else's money. (P.S. I especially love food trucks.)",
        "Outdoor Events - We've been in quarantine and on Zoom for long enough. It's time for us to (responsibly) go outside and touch some grass. I want to make a more significant push for outdoor events since we've been indoors too long. Say goodbye to isolation, and hello to social connection.",
        "School Collaborations - One of my biggest dreams I've had since freshman year is to push boundaries and expand beyond the traditional scope of Class Board by hosting events with other colleges. As far as I know, this hasn't really ever happened yet. COVID complicated things, but now we are back on track. The more, the merrier!",
        "Advocacy - I want to continue supporting the causes that our class cares about through Class Board. Whether through collaborations, partnerships, fundraising, or raising awareness, there are many important causes where we can dedicate our time, effort, and attention. I am very open to hearing and working with student groups and members of our class to make this happen."
      ],
      "image": {
        "src": "../../../images/2022/nec/Derek_Nhieu_DPPhoto.jpeg"
      },
      "instagram handle": "nhieuandimproved",
      "facebook url": "http://www.facebook.com/derek.nhieu",
      "campaign website": ""
    }
  ],
  "Executive VP": [
    {
      "name": "Joel Olujide",
      "introduction": "I've honestly had a blast working with the class board and having a part to play in the future of our class as well as upholding many of Penn's traditions, as well as creating new experiences that resonate with our unique college experience. From Zoom University, to having our FIRST in person Spring Fling, we've come a long way! Now that we're entering our senior year, I want to be able to wrap up and finish everything that we started ever since I joined Class Board as a sophomore as your Executive Vice President.",
      "platform points": [
        "New Experiences: I'm 1000% for Penn's traditions, but I want to gauge interests of our class to see what new events you all would like us to host!",
        "Positivity Platform: Recently, people have been sending me jokes and I've smiled through a rough week. Next year, I want to foster a platform where we can smile through jokes, words of affirmation, and more.",
        "Feb Club: Party of the year. I want you all to be part of the process. The goal is to host regular sessions gaining input from you all to meet your desires!"
      ],
      "image": {
        "src": "../../../images/2022/nec/Joel_Olujide_DPPhoto.jpeg"
      },
      "instagram handle": "joelolujide",
      "facebook url": "",
      "campaign website": ""
    }
  ],
  "VP Internal": [
    {
      "name": "Abbie Chan",
      "introduction": "Hi Class of 2023! It's been an absolute pleasure serving as your VP of Internal Affairs since freshman year, and I'm so excited to be re-running one last time! It baffles me that we're going to be SENIORS soon, and to see how far we've come is truly remarkable. There's no doubt we've all been through a lot--especially these past two years--but I'm determined to make sure we get our last hurrah! I will work hard to make sure your voices are heard and help plan events that YOU want--events that will create memories that will stay with you for years to come. Here's to an unforgettable senior year of more food, more pop-ups, more merch, and most importantly, a PHENOMENAL Feb Club. As always, thank you so much for your continuous support, and I hope you give me the opportunity to continue fostering connection and community within our class! :)",
      "platform points": [],
      "image": {
        "src": "../../../images/2022/nec/Abbie_Chan_DPPhoto.jpeg"
      },
      "instagram handle": "abbiechan_",
      "facebook url": "",
      "campaign website": ""
    }
  ],
  "VP Finance": [
    {
      "name": "Anuva Shandilya",
      "introduction": "Since coming to college, I've maintained a protein-only diet. Why is that, you may ask? Well, I am proud to say that I am no longer 5'1, but 6'8 (when standing on OUR money). Gains szn never left- for the past 3 years, I have successfully negotiated budget increases, so we can give out more free merch, more free food, and create more good vibes. Next year, Feb Club is going to take an insane amount of planning, especially financially, but I know my experiences as VP of Finance have prepared me well!! Let's do this.",
      "platform points": [
        "How can we talk about class spirit and not mention FREE MERCHHHH (run back the bucket hats but instead make it sweats?!)",
        "Free food! And *juice* haha now that we are gonna be seniorsss",
        "More puppies!! This is always our most popular event, and we love it as much as you do!",
        "Would love to do a cultural event next year where people can sign up in groups to bring various cultural foods/drinks/desserts!",
        "I will keep fighting for CB budget increases for next year so many Class Boards to come can keep giving out free merch/food/maybe even renting out downtowns loll.",
        "Feb Club is no joke. It's time to RAGE. Downtowns, ski trips, free byos, six flags, heck I'm even thinking Lady Gaga. Let's *send it.*"
      ],
      "image": {
        "src": "../../../images/2022/nec/Anuva_Shandilya_DPPhoto.jpeg"
      },
      "instagram handle": "anuvashandy",
      "facebook url": "",
      "campaign website": ""
    }
  ],
  "Engineering Chair": [
    {
      "name": "Jacqueline Aquino",
      "introduction": "Hey Penngineers! My name is Jacqueline Aquino and I am asking to be re-elected as your Engineering Chair for the last time! I am incredibly thankful to have been your Engineering Chair these past three years, and I would love to continue to serve you until the end of our time here at Penn. I plan to help make YOUR Penn experience end on a high note and be one to remember! Together,  I know we can make this happen. Let’s make some memories!",
      "platform points": [
        "More free merch",
        "More free food",
        "More dogs",
        "Epic events to make your senior year a blast",
        "Support, collaborations, and outreach with more student groups",
        "Ultimately, I want to be your friend that can listen and act on what you think is important. Reach out to me anytime, and I will be there for you! :)"
      ],
      "image": {
        "src": "../../../images/2022/nec/Jacqueline_Aquino_DPPhoto.jpeg"
      },
      "instagram handle": "",
      "facebook url": "",
      "campaign website": ""
    }
  ],
  "Nursing Chair": [
    {
      "name": "Marissa Kesse",
      "introduction": "Marissa is a first-generation Ghanaian student from LI, NY who loves exploring food in Philly! In the short term, she’s interested in trauma/emergency care but hopes to transition into law and attend law school. She is a familiar face around the nursing school who her classmates can often turn to when in need. She is VP of MNO, Program Director for Penn Model Congress, President of Penn Ghana, and a Black Student League board member. She loves teaching and mentoring younger students and is a part of philanthropy in West Philadelphia through the Netter Center. She is running because she finds her unique experience at Penn has informed her of her classmates' diverse perspectives and concerns and she hopes to bring this to the forefront and amplify the voices of the ordinarily extraordinary who may often be overlooked.",
      "platform points": [
        "Wellness in nursing students as they navigate intense clinical rotations - Delivering babies… suicide these are all intense themes we may experience as we navigate clinical often without foundational wellness pre-setup",
        "Increasing visibility of nursing students across campus- How do we shape the timing and types of events so nursing students can actually attend despite clinical/lab?",
        "Improving networking within the School of Nursing (SON)- Many times we stay within our class year, how can we create more fluidity with the SON to emphasize mentorship and community",
        "Free printing for nursing students- Care plans, lab assignments, etc. these are all documents we must print for school yet FGLI students have no method of reduced cost printing",
        "Promoting cross-disciplinary studies- It isn’t until late in our time at Penn do we find ways we can explore minors and classes we like outside of SON",
        "Ultimately, I want to be your friend that can listen and act on what you think is important. Reach out to me anytime, and I will be there for you! :)"
      ],
      "image": {
        "src": "../../../images/2022/nec/Marissa_Kesse_DPPhoto.jpeg"
      },
      "instagram handle": "",
      "facebook url": "https://www.facebook.com/marissa.kesse/",
      "campaign website": "mk.always_"
    }
  ]
}