{
  "New Student Representative": [
    {
      "name": "Eric Lee",
      "introduction": "Hi everyone! My name is Eric, and I'm a CAS Biochem major from New Jersey running for College Chair and Undergraduate Assembly. I really enjoyed serving my classmates in my high school's student government, and this year at Penn, I'm running because I have big expectations for the amazing things that PSG will accomplish. As the young blood of Penn's campus and the most competitive class in history, we should be ready to make some NOISE. We already had the most memorable convocation, so come along with me and let's make establish ourselves as the most memorable first-years!",
      "platform points": [
        "Kiosk to convert dining dollars and swipes to cash",
        "Extended break for Lunar New Year weekend to accommodate students who celebrate",
        "No classes on Election Day to promote voter engagement among students",
        "More social events for CAS with free food and opportunities to meet other CAS students",
        "More CAS merchandise and distribution of Penn hoodies before winter break for the cold weather",
        "Raising the 4.5 c.u. cap for CAS freshmen during the first semester"
      ],
      "image": {
        "src": "../../../images/2022/nec/Eric-Lee.jpeg"
      }
    },
    {
      "name": "Tiana Wang",
      "introduction": "Tiana is a first-year Wharton student studying finance, running for UA and Vice President of Finance (Class Board). She is passionate about providing all Penn students with access to financial resources, both academically and socially, and has had a lot of previous experience holding leadership positions at a state level and beyond. In the past, she’s organized many wide-scale fundraisers, donation drives for hospitals during the height of the pandemic, and social events, and hopes to bring that experience to Penn’s student government and the Penn community at large.",
      "platform points": [
        "Allocating class funds and resources to individual Penn students (unaffiliated with any club or organization) for the purpose of social/academic events, initiatives they want to start, etc.",
        "Encouraging student engagement by increasing the visibility and accessibility to class events, opportunities, and resources.",
        "Diversifying social and academic events to create a non-traditional university experience.",
        "Prioritizing student feedback before and after initiatives/events by establishing open communication channels via email, in-person, and through online forms.",
        "Emphasizing community engagement and branching out to planning class events beyond Penn’s campus.",
        "Creating a unified platform to access all student government resources and info."
      ],
      "image": {
        "src": "../../../images/2022/nec/Tiana-Wang.jpeg"
      }
    },
    {
      "name": "Mehreen Syed",
      "introduction": "Hi! My name is Mehreen Syed (she/her) and I’m running for UA New Student Representative. I’m in the College majoring in Health and Societies. As a daughter of immigrants and an FGLI student, my goal is to create change by encouraging the active participation of diverse voices. Coming from an underfunded public high school, I understand the consequences of when students’ interests are disregarded. At Penn, I will aim to represent the needs of the student body while striving toward a more inclusive environment. If you have any questions, feel free to message me on Instagram @mehreen.s.s",
      "platform points": [
        "Diversity and Inclusivity: Provide more support and funding to cultural resource centers. Ensure administration hears the concerns of cultural centers and minority groups on campus. Improve faculty diversity.",
        "Student Health: Connect students to more POC psychiatrists/therapists in CAPS. Expand access to free menstrual products in campus bathrooms. Address the competitive nature of club applications.",
        "Civic Engagement and Community Service: Encourage partnerships between the university and local organizations. Organize issue specific town halls. Increase awareness of opportunities from groups like Civic House or Netter Center.",
        "Amplifying Student Voices: Ensure students' opinions are taken into consideration when administration makes important decisions on issues such as the academic calendar or dining/housing.",
        "Accessibility: Organize a centralized calendar with events and application deadlines for clubs. Provide more information about SEPTA and other public transportation. Have more efficient dining plan options.",
        "Accountability: Advocate for the payment of PILOTS to the Educational Equity Fund and Penn’s divestment from fossil fuels. Have Penn acknowledge its responsibility to the West Philadelphia community."
      ],
      "image": {
        "src": "../../../images/2022/nec/Mehreen-Syed.jpeg"
      }
    },
    {
      "name": "Shivam Raja",
      "introduction": "Hi! My name is Shivam Raja and I want to be your Vice President of Finance. I am from a small town in Arkansas, and I love to dance, play football, and volunteer for community service activities. I believe the Vice President of Finance position is the best fit for someone who has an analytical mindset, is organized and responsible, and can appropriately represent our student body, and I genuinely believe that that is me. I am committed to serving the Class of 2026 and making sure that we have the best freshman year possible! Thank you!",
      "platform points": [
        "Greater clarification of Financial Transactions and Budget Allocations",
        "Greater Unification of Student Body and Class Board",
        "Greater Representation of Minority Student Groups"
      ],
      "image": {
        "src": "../../../images/2022/nec/Shivam-Raja.jpeg"
      }
    },
    {
      "name": "Leo Solga",
      "introduction": "Salutations! I’m Leo Solga and I’m running to serve as your bow-tie-wearing Class President and UA Representative. I want to coordinate outstanding class events and improve student life at Penn, and I have the experience and drive to make it happen. We deserve an excellent and unique freshman experience starting with a phenomenal Econ Scream! Additionally, I intend to work to improve and support our currently ineffective psychological counseling services. If elected, I would be committed to serving as your President and UA Rep and would take on no more extracurricular responsibilities. Thank you, and godspeed!",
      "platform points": [
        "I have years of experience getting things done in Student Government, including serving as my High School’s Student Body President.",
        "I will be committed to serving you. I will take on no more extracurricular responsibilities.",
        "I will work on improving Penn’s psychological counseling services. Penn should not have the most depressed student body in American higher education.",
        "I will plan and host memorable and unique freshmen events!",
        "I will listen to your voice and remain easily accessible for thoughts, suggestions, or concerns."
      ],
      "image": {
        "src": "../../../images/2022/nec/Leo-Solga.jpeg"
      }
    },
    {
      "name": "William Rubin",
      "introduction": "I was not a student council kid by any means in high school. Shaking my head at the cliches in my classmates’ speeches and daydreaming about last night’s dinner the rest of the time, I was probably the furthest thing from a student council kid. But as I have spent the last month on this campus–people watching on Locust, listening to the Kelly Writers’ House Speakeasy, attending Hillel Shabbat–something has inspired me. I want to be a representative for everyone at this school. A vote for me will be a vote for the unification of the student body.",
      "platform points": [
        "Transparency",
        "Accountability",
        "Community Outreach",
        "Diversity, Equity, and Inclusion",
        "Civic Engagement",
        "Student Voice"
      ],
      "image": {
        "src": "../../../images/2022/nec/William-Rubin.jpeg"
      }
    },
    {
      "name": "Abhay Srivastava",
      "introduction": "I’m Abhay Srivastava and I’m running for Class President and UA New Student Rep because I hope to create a more diverse, inclusive, and sustainable Penn. As a first-generation American, I recognize the importance of appreciating and celebrating the many identities that Penn students embody. If elected, I will consider student voices from all backgrounds to host class events that unify the Penn community through their differences. As someone who values others’ opinions, I will work alongside Penn’s administration to accommodate the asks of the student body, and to ensure student feedback lies at the core of our initiatives.",
      "platform points": [
        "Hosting opportunities for students to engage with local non-profits and environmental organizations to reduce environmental waste, promote sustainability, and encourage community engagement",
        "Giving students a voice and their own platform through surveys, suggestion boxes, etc. and incorporating feedback to create exciting and relevant events and changes",
        "Developing a greater breadth of diverse and inclusive events for Penn students to appreciate everyone's unique background and gain unique cultural perspectives",
        "Creating a more robust mental health support system for students by making resources and assistance more accessible and equitable for students who need it",
        "Working directly with Penn administration and incorporating student opinion and feedback on ways to enact change on pressing issues affecting Penn and the local community",
        "Extending the range of dining dollars to a greater amount of local food stores/restaurants"
      ],
      "image": {
        "src": "../../../images/2022/nec/Abhay-Srivastava.jpeg"
      }
    },
    {
      "name": "August Crane",
      "introduction": "Hello! My name is August Crane. Some of you may know me as the kid with a ferret. Although Penny is integral to my personality, I can assure you that by being elected to Class Board and Undergraduate Assembly, I have more to offer than just my pets. As a FGLI student, I will work to make our university more equitable for students of all economic backgrounds. As a PennGreen alum, I will challenge Penn’s idea of sustainability to encourage true reform. I hope that you will join me in imagining a new future for our class.",
      "platform points": [
        "Encouraging administration transparency: Ensuring that Penn is explicit with the student body in regards to their goals for students and the greater Philadelphia community",
        "Improving quality of dining hall food: Implementing student feedback boxes in each dining hall and utilizing more local and sustainable sources",
        "Enhancing on-campus facilities: Creating proactive ways for Penn Residential Services to solve the cleanliness issues, especially in freshman housing",
        "An emphasis on sustainability: Partnering with Penn Sustainability Clubs and Organizations to curate events that encourage sustainable practices on campus",
        "Strengthening cultural centers: planning intercultural events to emphasize a sense of community between different cultural groups on campus",
        "Financial support for students: Ensuring that all students can participate in class and school-wide events that require spending"
      ],
      "image": {
        "src": "../../../images/2022/nec/August-Crane.jpeg"
      }
    },
    {
      "name": "Jaideep Grewal",
      "introduction": "Hey everyone! My name is Jaideep Grewal but I also go by “deep”, “dj deep dog”, and “jai-shallow”. If those names don’t ring a bell, I am easily identifiable as the kid who is always running through the quad and loudly singing and speaking to every person I see (as a means to procrastinate from work). Ok, I am getting off topic (as you can see my crippling ADHD is shining through), but I think I have the perfect mix of experience, diligence, enthusiasm, optimism, and drive to lead our class this year.",
      "platform points": [
        "FUN: Classes, clubs, and school in general are stressful. I commit to establishing as many fun social events as possible (with free food, of course).",
        "PRINTERS: Especially for those in the quad and in CAS, we have to take a long trek to find a printer. I commit to making printers more accessible everywhere.",
        "FACILITIES: I commit to establishing more routine cleanings of bathrooms and all public areas. Temperature fluctuations will also be taken care of.",
        "MENTAL HEALTH: Many general resources are listed on campus pages, but are they really accessible? I commit to making mental health resources easily accessible through virtual consults.",
        "FOOD/DRINKS: I commit to having vending machines in every house, and easy pick-up points for food deliveries at the entrances of every house.",
        "CLUBS/CLASSES: I commit to concentrating all club apps into one common application and making Path@Penn easier to use."
      ],
      "image": {
        "src": "../../../images/2022/nec/Jaideep-Grewal.jpeg"
      }
    },
    {
      "name": "Michelle Chen",
      "introduction": "Hey, Class of 2026! My name is Michelle Chen (a.k.a. your local Trader Joe’s enthusiast & avid karaoke singer), and I am so excited to be running as your VP of External Affairs and UA New Student Rep! As a former member of student government in high school, my passion for advocating on behalf of my peers and working to create an inclusive and welcoming community runs deep. I believe my background as a First-Generation/Low-Income student will bring a diverse and valuable perspective to the board. For more information on my platform, follow my campaign journey @chen4penn!",
      "platform points": [
        "Represent and advocate for first-Generation/low-Income community.",
        "More wellness resources to help with the transition to college.",
        "Bridging the gap between students in different colleges & creating a more tightknit community.",
        "Continuing past Penn traditions & creating new ones!"
      ],
      "image": {
        "src": "../../../images/2022/nec/Michelle-Chen.jpeg"
      }
    },
    {
      "name": "Nicole Muravsky",
      "introduction": "My name is Nicole Muravsky and I’m running for the Undergraduate Assembly. When elected, I’ll advocate for decreasing disparities within minority and underrepresented communities, ensuring that all voices are being heard, reforming the mental health system, optimizing student club benefits, and unifying the student body. As a fervent zealot of maintaining an open mindset to evaluate what needs to be changed, I’ll take tangible action steps to get the needs of the students met inside the academic and social realms. I look forward to getting to know all of you better. My priority is based on YOUR priorities. Vote Nicole4UARole!!",
      "platform points": [
        "Inclusiveness & Diversity: I’ll promote a stronger culture of inclusiveness and equity. I’ll work with cultural houses to break down microaggressions that Penn students face. Diversity should be celebrated—not negated.",
        "Voices: I’m focused on bridging the school’s administration with those who feel that they don’t have a voice; everyone should be heard, and I aspire to make sure of that.",
        "Integrating intercultural knowledge into change: I will ensure that students of all ethnic origins and backgrounds have equal opportunities within the school and encourage change fitted on different cultural needs.",
        "Mental Wellness: I aspire to improve accessibility to mental health resources, create a guidance system with faculty members besides peer-focused groups, and make changes that’ll make YOUR college career smoother.",
        "School Club Committee: Creating a monthly-meeting committee of club leaders will allow the clubs to have a chance to ask for help with resources, funding, organization, or anything at all.",
        "Actively Questioning: I’ll improve the impression of PSG through making changes based on YOUR priorities. I’ll actively meet with students to hear what they want changed and avoid remaining complacent."
      ],
      "image": {
        "src": "../../../images/2022/nec/Nicole-Muravsky.jpeg"
      }
    },
    {
      "name": "Tommy Enstice",
      "introduction": "Hey! I am Tommy Enstice. I’m from Buffalo, New York and am studying Econ and CIS. I most look forward to meeting those of you that I haven’t yet met. Now let’s be honest: the cliché of student government everywhere is that it’s filled with empty promises, even with great leaders. As a UA representative we can catalyze true change though discussing the minute details of daily student life. In my time here thus far, I’ve loved speaking with you all, and I look forward to learning more about your lives here and how we can improve it together.",
      "platform points": [
        "I want to coordinate our pre-existing online services towards streamlining Student Body needs directly to PSG. Ideally, they’re directly passed into the discussion notes of PSG meetings.",
        "Clubs are a prevalent part of the Penn experience. I’d like to build a club mentorship program that will ease the stress of applications and help find your niche.",
        "Simply getting used to living demands on campus can be enough of a burden. We can develop a student service dedicated to helping new students get accustomed to campus life.",
        "I’d like to bridge the gap between college houses by reallocating more social opportunities to less social houses and more cleanliness and efficiency to those lacking in that category.",
        "I’d love to devise a system to provide more free printing locations while avoiding printer abuse that will waste resources. This can be achieved if we can facilitate mindful printer use.",
        "I will be a mouthpiece of all current student issues. A pressing one is the toilet paper famine. Student commodities must be properly handled to ensure our welfare (and sanity)."
      ],
      "image": {
        "src": "../../../images/2022/nec/Tommy-Enstice.jpeg"
      }
    },
    {
      "name": "Diego A. Font",
      "introduction": "With the experience I—Diego Font—have accumulated throughout the leadership roles I held in high school, such as Student Council President, I can unequivocally assert my readiness to lead you as Class President. Effectively, I will fight for your interests and work for you with the utmost sense of responsibility, excellence, professionalism, and goodwill. Now, I am not a quitter, and I will be the 24/7 President that you need and want. Ultimately, it would be an honor to be able to serve and work for what I love and treasure most about Penn: the people that make it up.",
      "platform points": [
        "I will organize social gatherings, namely barbecues, music festivals, excursions, balls, Freshmen Winter and Summer Olympics, etc., to foster camaraderie among us. I also pledge to uphold Penn’s deep-rooted traditions.",
        "I will bring about adaptations of popular game shows, such as America’s Got Talent, Family Feud, Jeopardy!, and Countdown, among others, for you to participate and indulge in at Irvine Auditorium.",
        "I will lay the foundations for a yearbook that reminisces our Academic Year 2022/23 by establishing a Yearbook Committee you could join. The Official Class Board 2026 Instagram will be created too.",
        "I will actively pursue sponsorships and arrange fundraisers. Most will be aimed at procuring you a faster and more efficient method of transportation of your choosing, like skateboards and scooters.",
        "I will assemble a study group for each course that you are presently taking; these groups will convene weekly. Freshmen from each course will moderate and chair their respective sessions as volunteers.",
        "Lastly, my central purpose is to provide you with the representation you justly deserve, for your voice matters; your concerns, initiatives, and suggestions will be taken into account. Reach me: 787-379-7373."
      ],
      "image": {
        "src": "../../../images/2022/nec/Diego-A.-Font.jpeg"
      }
    },
    {
      "name": "Su Ah Kim",
      "introduction": "Hello everyone, my name is Su Ah Kim, and I’m running to be your next UA New Student Representative! In past years, I lived in Korea, China, Washington, Oklahoma, and more. Therefore, I possess unparalleled cultural competency that will allow me to effectively meet the diverse needs of our freshmen class. In high school, I served on my School Board’s Advisory Council, co-founded a global education nonprofit, and led various student organizations, cultivating core leadership skills. As your UA Rep, I promise to make your voices heard by administrators at Penn and outsiders to produce tangible change.",
      "platform points": [
        "Facilitate the transition from high school to Penn",
        "Navigate affording college",
        "Prioritize mental health and well-being",
        "Improve living conditions across dorms",
        "Build a platform for social change"
      ],
      "image": {
        "src": "../../../images/2022/nec/Su-Ah-Kim.jpeg"
      }
    },
    {
      "name": "Koustav Datta (Stav)",
      "introduction": "Hi everyone! My name is Koustav Datta, I am from New Hampshire, and I am interested in running for Class Board Executive Vice President, as well as a representative of the Undergraduate Assembly. Student Government has always appealed to me, and I am thoroughly interested in becoming involved with such an organization at Penn because it would bless me with the opportunity to foster connections with the members of my Class, incorporate activities that the Class of 2026 would want to see take place, and to create a tighter-knit community with the greatest class Penn has ever seen.",
      "platform points": [
        "- Bolstering school spirit with a Sadie Hawkins Dance (a dance where the girls ask their significant others out to the dance)",
        "- Hosting activities on the College Green every month, such as a field day for the Class of 2026.",
        "- Hosting an exclusively Class of 2026 picnic in the later months of the school year (when the temperature warms up).",
        "- Hosting a Powderpuff game (a football game where the girls play football and the guys cheerlead, where cheerleaders volunteer as coaches for the boys and football players volunteer as coaches for the girls).",
        "- Organizing a Class of 2026 Scavenger Hunt on Penn's Campus and Central Philadelphia (teams based on Residential College Houses)",
        "- And the most important point, being open to listening to people for their suggestions on what they truly believe could make 2022-2023 a valuable and enjoyable year for the Class of 2026."
      ],
      "image": {
        "src": "../../../images/2022/nec/Koustav-Datta-(Stav).jpeg"
      }
    },
    {
      "name": "Juan Lopez",
      "introduction": "Hello Class of 2026, My name is Juan Lopez and I am excited to run for the Executive Vice President and UA position. I am majoring in Political Science and I’m from the Bay Area. I am running to be able to advocate for each and every student at Penn! I will try my best to make our freshmen year at Penn memorable by making sure we have fun bonding class events and free Penn merch since we know how expensive it can be at the bookstore *cough cough*. Be sure to check my Instagram for more details @lopez4viceprez!",
      "platform points": [
        "I’ll make sure to advocate for the needs of every student at Penn! You’ll all have my socials or email and can let me know of any questions or concerns.",
        "As I’ll be in the loop on most things, I will make sure to let everyone know of anything that might not be beneficial to our class.",
        "Making Penn a more collaborative community rather than a competitive one!",
        "Increase the financial aid a student receives/ have the financial office take other things into account regarding one’s EFC!",
        "Support the FGLI community with more resources to succeed at Penn and create a strong community within one another!",
        "Advocate for a change in dining hall food options… specifically Hill and Commons!"
      ],
      "image": {
        "src": "../../../images/2022/nec/Juan-Lopez.jpeg"
      }
    },
    {
      "name": "Martina Bulgarelli",
      "introduction": "I'm Martina Bulgarelli from Italy. I enjoy meeting new people and learning about new cultures. I have been involved in student government since freshman year in high school from being class to school coordinator. I also obtained a position in the Italian National Student Council representing more than 1,5 million students. Being passionate about giving a voice to minorities and making everyone feel comfortable in this new experience are some of the reasons I am running for President of Class Board and member of the Undergraduate assembly.",
      "platform points": [
        "Mindfulness: camping by the beach - relax after midterms",
        "Action: olympenn - sport and arts tournament of the year",
        "Remember: Time capsule - collect our wishes for the future, to be opened after graduation",
        "Talent: Class merch design talent - get creative, submit your design, it might be the one printed on class hoodies",
        "Inclusivity: Traditions festival - traditional clothing parade and cooking challenge"
      ],
      "image": {
        "src": "../../../images/2022/nec/Martina-Bulgarelli.jpeg"
      }
    },
    {
      "name": "Marta Zapata Escondrillas",
      "introduction": "Hey everyone! My name is Marta and I am running for Undergraduate Assembly representative. A little bit about me: I am from Spain but I moved to Miami when I was seven. Before that, I lived in London for four years. I am in the College and I intend to major in political science and economics with a minor in legal studies. I have experience working in student government as I held various positions throughout high school. If elected, I look forward to working closely with other representatives, my fellow classmates, and the administration. I hope you will consider me!",
      "platform points": [
        "Opening dining halls to later hours to ensure that students balancing a busy schedule will have fair access to meals throughout the day.",
        "Easier and more consistent access to sustainable sources of purified water for students.",
        "Facilitate an environment in which students can come to me to voice their concerns.",
        "Provide more accessible information on the various forms of transportation available to students",
        "Create new initiatives to provide a better living environment for students living on campus, for example beter cleaning resources and creating volunteer opportunities to improve the dorms.",
        "Create a more efficient system within path at Penn in which we can clearly identify if we are on the right track."
      ],
      "image": {
        "src": "../../../images/2022/nec/Marta-Zapata-Escondrillas.jpeg"
      }
    }
  ],
  "New Student Transfer Representative": [
    {
      "name": "Will Ruden-Sella",
      "introduction": "What's up? My name is Will and I’m running for Penn UA to represent YOU, the new transfer students. Your voice is important as a transfer, and I’m committed to making Penn the best place for each one of you. What makes me stand out? I have experience in collegiate student government! At my previous school, I served in an assembly similar to the Penn UA where I helped create a student workers union and increase identity club funding. I can’t wait to make more impactful changes at Penn with your input. Vote WILL RS for TS! (Transfer Students)",
      "platform points": [
        "Expediting XCAT- Obtaining transfer credit is a hassle. The slow system leads to confusion about which courses/majors to choose. I’ll advocate for more efficient XCAT processing.",
        "Transfer Student Center- There isn’t a single place on Penn’s campus designated for transfer students. There should be a space strictly designed to accommodate transfers for their specific needs.",
        "Reserved Club Seats- Joining clubs is essential for transfers to find community. Penn clubs/greek organizations should ensure transfers can transition smoothly into their groups by reserving transfer spots.",
        "Advisor Check-Ins- Academic Advisors should talk with transfers every 1-2 months to discuss the adjustment to Penn and to gauge where they are in terms of course/major requirements.",
        "Virtual ID- Everything is turning mobile, so why not put our IDs on our phones? We should have an ID app which scans at dining halls and packages rooms.",
        "Favorite Meal Alerts- While dining hall food can be a hit or miss, how awesome would it be to get a notification when your favorite dish is on the menu?"
      ],
      "image": {
        "src": "../../../images/2022/nec/Will-Ruden-Sella.jpeg"
      }
    },
    {
      "name": "Mackenzie Sleeman",
      "introduction": "Each transfer student’s journey to Penn comprises a unique story filled with apprehension, excitement, and ambition; my goal is to share these stories with the Penn community. My name is Mackenzie Sleeman, and I am a New Yorker and sophomore transfer from Villanova. In my free time, I love to play tennis, swim with friends, hike with my little sister, and watch movies with my family! I want to join the Undergraduate Assembly because I recognize the power of transfer student voices, and believe in strengthening our ties to the broader Penn society.",
      "platform points": [
        "XCAT PRIME: Expedite the XCAT process so that students are better aware of degree expectations. Create transfer course equivalents that count towards electives to ensure that students graduate on time.",
        "Transfer Learning Community: Create an inclusive learning environment in the form of a transfer-only writing seminar. The curriculum will acknowledge that transfers already have some experience with college-level writing.",
        "Club Access Initiative:\n- Help juniors join organizations that are traditionally only open to freshmen or sophomores. \n- Create sessions that allow extracurricular groups and clubs to connect with incoming transfer students.",
        "Transfer Advising: Appoint 2-3 pre-major advisors who will concentrate on helping transfer students acclimate to Penn. Advisors will have a clear understanding of program requirements to assist with transfer credit.",
        "Build Community: Fund and promote class events (2024/2025) designed to help transfers find their communities beyond the Transfer Student Organization. Energize students to attend spirit, service, and sporting events."
      ],
      "image": {
        "src": "../../../images/2022/nec/Mackenzie-Sleeman.jpeg"
      }
    }
  ]
}
