{
  "President": [
    {
      "name": "Will From Hill",
      "introduction": "Hello! I am Will From Hill -- soon to be Will From Harnwill. You may know me from my emails sent at 1:00 AM, or you may have seen me host events like Econ Scream or Bloom: Spring Formal. Serving as Class President, I have worked with students, the class board, and administrators to support the class of 2025 through extensive communication, support programs, and fun events. With your support, I will continue to work tirelessly towards my goal of making the Penn experience the best it can be. In my term, I followed through on each platform point I ran on, and I promise to follow the ABC Platform below as I continue my Presidency.",
      "platform points": [
        "Advocacy. Through conversations and surveys, I will advocate for Penn's needs to the administrators who have the power to make real change. Further, I will communicate programs and events (through emails & social media) to the class of 2025.",
        "Bangers. I will work to make our traditions (e.g. Hey Day) wildly fun, and add new big events (like Bloom) to the Penn experience.",
        "Community. I believe Penn needs to have a better relationship with the greater Philadelphia area. I will continue my work to raise thousands for the Philly community, and use Class Board to create more unity between Penn students and Philadelphia."
      ],
      "image": {
        "src": "../../../images/2022/nec/Will_From_Hill_DPPhoto.jpeg"
      },
      "instagram handle": "will.from.hill",
      "facebook url": "",
      "campaign website": ""
    },
    {
      "name": "Sabirah Mahmud",
      "introduction": "Hi everyone, my name is Sabirah Mahmud! I'm a first-generation low-income (FGLI) student in the College. I’m running for Class of 2025 President because I want to bring change and support to the student body. Many students have felt that Penn is different from expectations prior to arriving on campus. I want to celebrate Penn and have students feel welcomed while improving upon certain aspects of Penn. I plan to bring more inclusion to marginalized students, frequent class events, integration to West Philly, reducing campus waste, frequent class communication, and prioritize student body physical and mental health.",
      "platform points": [
        "Inclusivity and Accommodation to prioritize Religious Unity, the Disabled Community, and other Marginalized Identities: providing more religious consciousness; accessibility at events prioritized; centering interests of marginalized groups not presented at decision making table.",
        "Inclusion and Aid within West Philly Integration: collaborating with existing student volunteering groups in the community & promoting those events.",
        "Prioritize Mental and Physical Health of our Student Body: creation of mental health resources hub & providing more fun study breaks during finals and midterms; having a bold stance for zero-tolerance of physical violence against the student body.",
        "Reduce Waste and Consumption on Campus: organizing donation drives during move-out to reduce waste on Philadelphia streets.",
        "Frequent Class-Wide Events: providing an alternative to partying including hosting movie nights on college green or making it more accessible to leave campus"
      ],
      "image": {
        "src": "../../../images/2022/nec/Sabirah_Mahmud_DPPhoto.jpeg"
      },
      "instagram handle": "hijabiwithapolicy",
      "facebook url": "https://www.facebook.com/Sabirah-Mahmud-for-Class-of-2025-President-102152382457143",
      "campaign website": "https://medium.com/@sabirah/vote-for-a-hijabi-with-a-policy-sabirah-mahmuds-class-of-2025-presidential-platform-8cd89ece5a76"
    }
  ],
  "Executive VP": [
    {
      "name": "Amaan Omer",
      "introduction": "WHATS POPPIN Quakers of '25! \n\nMy name is Amaan, and I'm rerunning for Executive VP. As current VP, I've heavily planned and hosted ECON Scream, Bloom, and HOLI. I'll continue using my platform to create new inclusive events to make the following three a walk in the park.\n\nI'll soon be releasing my platform (@amaanomer - I know, shameless plug), so check it out! Of course, if you have questions, PLEASE reach out to me; I promise I don't bite...unless you're a Spinach Feta Wrap. \n\nVoting occurs from April 1-8, so choose Amaan Omer, A MAAN you can trust.",
      "platform points": [
        "Mental Health Events: Feeling burnout? That's totally okay; I do ALL the time. I plan on hosting small get-away events to take your mind off the UPain grind.",
        "Communications: Imagine a Will from Hill email, but with an itinerary in one place! Yup, for all club news, school events, and raging parties, let's put it on a spreadsheet.",
        "Resource Accessibility: Through existing organizations and programs on campus, I hope to create more opportunities and events for alleviating challenges that underrepresented or inexperienced communities face on campus.",
        "Dining Hall: While Class Board holds no power over dining, I can guarantee communication with the UA to improve food options and venues (yes, Halal Cart must be dining-plan certified).",
        "Penn x Philly: It's time for Penn to give back to Philly, whether organizing class-wide efforts to revitalize the city's communities or volunteering; let's show our brotherly love.",
        "PARTY PARTY PARTY: Must I say more? Let's throw more formals with better food, crazy music, Instagram-worthy photo spots, and mosh pits that leave you craving for more."
      ],
      "image": {
        "src": "../../../images/2022/nec/Amaan_Omer_DPPhoto.jpeg"
      },
      "instagram handle": "amaanomer",
      "facebook url": "https://www.facebook.com/amaanxomer/",
      "campaign website": "https://www.linkedin.com/in/amaanomer/"
    }
  ],
  "VP External": [
    {
      "name": "Hannah Liu",
      "introduction": "Hello! My name is Hannah Liu, and I'm re-running for VP of External Affairs and UA College Rep. As VP of External, I've helped host a variety of events for the freshman class, such as Econ Scream and the Bloom Spring Formal. As a UA Rep, I've spearheaded projects such as establishing an excused absence policy for athletic competitions and working with Residential Services to create videos of first and second year housing options. I'm re-running because I want to continue pushing impactful initiatives for the Class of 2025, so vote for Hannah Liu, cause she will work for you!",
      "platform points": [
        "Utilize a feedback form that will be posted weekly on my social media for students to submit suggestions for events or issues that need to be advocated for",
        "Facilitate stronger connections with cultural groups on campus and collaborate with them to create more events, including a cultural fair down Locust where students can interact with cultural groups",
        "Push to make add/drop deadlines and other academic deadlines more accommodating to students in order to allow for a more supportive learning environment",
        "Prioritize student mental health; this includes expanding mental health resources by advocating for more counselors at CAPS and hosting mental health breaks, like movie nights and free food events",
        "Improve the shuttle system that was used for Thanksgiving and spring break; this includes implementing it during winter break and organizing a potential pick-up system from the airport for arrivals",
        "Continue addressing residential concerns; this includes creating initiatives to mitigate health and safety issues and ensure more transparency for underclassmen when they are choosing between on-campus housing options"
      ],
      "image": {
        "src": "../../../images/2022/nec/Hannah_Liu_DPPhoto.jpeg"
      },
      "instagram handle": "hannah.mliu",
      "facebook url": "",
      "campaign website": ""
    },
    {
      "name": "Erica Park",
      "introduction": "Heyoo! My name is Erica Park, and I would love to be your VP for External Affairs!! I want to organize and host social events that provide a sense of class and school spirit, unity, and of course, combat the Penn stress together. I had previous Student Government experiences such as being the School President in high school, and I loved every moment of it. I will always be there if you need someone to talk to, laugh with, or even grab food with... So, PARK YOUR VOTE FOR ERICA PARK!",
      "platform points": [
        "Want to destress while being hit by a bunch of glow sticks? I hope to organize more similar events like the Econ Scream!",
        "Yum, yum yum! Late night breakfast hour during midterm/finals season to grab comfort food such as waffles/pancakes and relax with friends.",
        "More events with nearby adoption animal shelters to increase awareness/funding, increase happiness amongst students, and decrease Penn stress.",
        "Host fun and competitive games such as volleyball or dance contests with prizes at the end",
        "Increase awareness of mental health by connecting students to CAPs counselors more easily.",
        "Try to allow other college students to book a GSR in the Huntsman building!"
      ],
      "image": {
        "src": "../../../images/2022/nec/Erica_Park_DPPhoto.jpeg"
      },
      "instagram handle": "ericapark_",
      "facebook url": "http://facebook.com/ericapark11",
      "campaign website": ""
    }
  ],
  "VP Internal": [
    {
      "name": "Ria Ellendula",
      "introduction": "Hey guys! I’m Ria Ellendula, and I’m running for re-election to Class Board and UA! I love Student Government, as it’s given me the chance to represent the diverse Penn cohort. As a member of the UA Equity & Inclusion committee, I’ve pursued projects on diversifying the CAPS counseling staff and adding more spots to the Penn Freshman Program. As Class Board Vice President of Internal Affairs, I’ve hosted Econ Scream, Spring Formal, the Internship Panel, and more! I would love the opportunity to be re-elected to Student Government again, taking on projects that positively impact student life.",
      "platform points": [
        "I will continue to take on mental health projects that recognize the various identity backgrounds of our student body.",
        "I will advocate for policies that represent the ideas and needs of the student body.",
        "I will support and initiate policies uplifting the resources and voices of underrepresented and FGLI students at Penn.",
        "I will work to combat the competitive club culture at Penn.",
        "I will initiate projects that support the Performing Arts community of Penn.",
        "I hope to plan memorable events that facilitate a sense of campus-wide spirit at Penn"
      ],
      "image": {
        "src": "../../../images/2022/nec/Ria_Ellendula_DPPhoto.jpeg"
      },
      "instagram handle": "riaellendula",
      "facebook url": "",
      "campaign website": ""
    },
    {
      "name": "Yash Mahajan",
      "introduction": "Hi, I’m Yash Mahajan, and I’m running to be the Vice President of Internal Affairs for the 2025 Class Board! As an international POC student, I have noticed oversights in the Penn Administration with addressing the needs of minority students and undergraduate population. Diversity, representation and inclusion are things I hold close to my heart: every student at Penn should feel that they belong to a strong community. We deserve a campus that is amenable to our needs, be it by allowing us early move-in, giving leeway for mental health in academics or even providing affordable food options.",
      "platform points": [
        "Wellness: • Ensure all courses provide late days for assignments. • Create floor-wide connections through weekly RA-funded events. • Change dormitory air-conditioning policies. • Increase interaction with Penn Benjamins/CAPS.",
        "Diversity: • Consult Penn fin-aid to provide stipends for summer courses, textbooks etc. • Support FGLI/international students through increased ISSS/Greenfield Intercultural Center involvement. • Allow students to petition early move-in.",
        "Penn Dining: • Survey students to modify dining hours. • Create a Bento meal-swipe option",
        "Transparency: • Make CB/UA meeting minutes and suggestion forms available in biweekly emails. • Create virtual drop-in sessions with CB/UA and administration.",
        "Building Community: • Organise year-wide and major-wide study breaks with food and faculty. • Support student groups: showcase student organisations in Penn-organised events and weekly exhibits on College Green.",
        "Sustainability: • Provide to-go reusable cups for dining halls and water. • Work with PEG and other environmental groups to increase availability of compost bins and sustainability education."
      ],
      "image": {
        "src": "../../../images/2022/nec/Yash_Mahajan_DPPhoto.jpeg"
      },
      "instagram handle": "yashmahajan_",
      "facebook url": "",
      "campaign website": ""
    }
  ],
  "VP Finance": [
    {
      "name": "Shayan Shivji",
      "introduction": "SHY IS YOUR GUY! You've seen me on campus the tall guy with the hair. I'm trying to make our sophomore year financially secure and consistently lit. Get me right with your vote, and I'll get you right with so much more.",
      "platform points": [
        "Free Penn Merch (Bucket hats, crop tops, sweatpants, hoodies, etc.)",
        "Transparent Budget",
        "More Social Events On Campus",
        "Free Ubers for late night events."
      ],
      "image": {
        "src": "../../../images/2022/nec/Shayan_Shivji_DPPhoto.jpeg"
      },
      "instagram handle": "",
      "facebook url": "",
      "campaign website": ""
    }
  ],
  "College Chair": [
    {
      "name": "Maya El-Sharif",
      "introduction": "Hiya, it’s Maya! I am running for UA and Class Board as I feel as though I have some unfinished business. My experience in student government has taught me how long projects can take given the administrative backlog and has allowed me to hear student concerns. The nexus of these has made me eager to continue pushing for solutions to problems while improving the environment of Penn by producing more exciting events. I love this school, and I cannot think of a better way to demonstrate that than to help enhance it in ways that are responsive to students’ concerns.",
      "platform points": [
        "Fun: A winter carnival for holiday celebrations; grade wars in which grades compete against each other in different field day activities, competitions, and event attendances; Valentine’s Day Event; Class Trips",
        "Health and Wellness: Improve accessibility to resources (CAPs, etc.,) improve water filtration systems (convinced they are poisoned,)  provide free menstrual products in campus bathrooms, get Pottruck to have longer hours.",
        "Food: Work to provide a 24/7 dining option, continue trying to obtain student discounts with local businesses, provide more options in the dining hall for students with dietary restrictions.",
        "Academics: Work with CTL and other relevant organizations to get syllabi posted prior to course registration, extend the drop-add deadline, get more days off in the schedule.",
        "Diversity: Work with 7B on a Multicultural Fair, facilitate conversations about race in the classroom by working with CTL, increasing accessibility for needed resources amidst international, FGLI, and transfer students.",
        "Safety: Work to get more lights on Locust, expand locations Penn Rides goes to, create better bystander training with PVP, work to create self-defense classes for students to take."
      ],
      "image": {
        "src": "../../../images/2022/nec/Maya_El-Sharif_DPPhoto.jpeg"
      },
      "instagram handle": "maya_e13",
      "facebook url": "",
      "campaign website": ""
    },
    {
      "name": "Sri Pinnamareddy",
      "introduction": "My name is Sri Pinnamareddy and it was such an honor serving as your College of Arts & Sciences Chair. I continued traditions like Econ Scream, promoted wellness through the Love pop-up, and spearheaded the planning of Spring Formal: Bloom. I believe that improving university life is the core of creating a unified and spirited environment. I hope to continue being a passionate advocate, a unifying representative, and a servant leader as I run for re-election and UA Representative. My platform is based on access to academic resources, improving social life, and prioritizing wellness on campus. Contact me at spinn@sas.upenn.edu!",
      "platform points": [
        "Study Centers: Ensure that all students are able to reserve GSRs regardless of their school affiliation and have more study center options for late-nights.",
        "Academic Transparency: Highlight hidden costs for textbooks and course materials. Work with administration to cover funding for external costs and provide free access to software like Adobe Suite.",
        "Dining: Expand weekend dining options and hours. Work with local vendors and food trucks to be able to use dining dollars at their locations.",
        "Inclusion: Make summer courses and other academic ventures more accessible and affordable for low-income students.",
        "Housing: Improving dorm life by ensuring that all facilities are safe and any broken utilities are resolved in a more timely manner.",
        "Convenience: Currently, Wharton & SEAS students have $20 credit for printing purposes, I would like to expand this incentive to SAS students and add more printing stations around campus."
      ],
      "image": {
        "src": "../../../images/2022/nec/Sri_Pinnamareddy_DPPhoto.jpeg"
      },
      "instagram handle": "Sri.pinn",
      "facebook url": "https://www.facebook.com/sri.pinnamareddy.58/",
      "campaign website": ""
    },
    {
      "name": "Camila Paranhos",
      "introduction": "My name is Camila Paranhos, and I'm from São Paulo, Brazil. I ran for the Class Board in the fall because I wanted to bring my perspective as an international student interested in exploring the best of school spirit and promoting new traditions. Throughout the year, I accomplished that by spearheading the collaboration with Career Services in PENNterships, and helping make Spring Formal, ECON Scream, and the Valentine's LOVE Event innovative and representative of our class. I still have many ideas for the Class Board, so I would love to continue working in a community I care so much about with your support.",
      "platform points": [
        "Continue the partnership with career services to plan more events that showcase diverse and non-traditional career choices for college students and provide them with real opportunities for engagement.",
        "Celebrate the cultural diversity present in our class through events that give students the chance to share some aspect of their culture, such as a traditional food appreciation event.",
        "Promote wide athletic competitions for students to participate in. Those could be between college houses, majors or some other criteria.",
        "Organize more wellness pop up and regular events. Running into smiling peers that hand you hot chocolate and invite you to a fun activity can brighten someone’s day.",
        "Maintain the tradition of Spring Formal by having at least one large social event per semester for the entire class.",
        "Hear what YOU want! I will make my instagram an active platform to hear what the class wants through regular surveys for event ideas or just themes to be further explored!"
      ],
      "image": {
        "src": "../../../images/2022/nec/Camila_Paranhos_DPPhoto.jpeg"
      },
      "instagram handle": "cami_paranhos",
      "facebook url": "",
      "campaign website": ""
    }
  ],
  "Wharton Chair": [
    {
      "name": "Shivam Shah",
      "introduction": "Shivam is concentrating in Finance and Business Analytics, minoring in Urban Education. He is from sunny Jacksonville, Florida and loves to play any sport (especially tennis and basketball) and watch Rom-Coms. Shivam served as the Wharton Class Chair for the 2025 Class Board last year because he loves the thrill of supporting his peers and acting as the liaison between Wharton resources and these peers. He also loves to host the traditional class events that constitute the quintessential college experience. If voted again, he would love to create new events, institute new metrics for tracking efficiency, and increase sponsorship outreach.",
      "platform points": [
        "New events that were restricted by COVID - specifically more social events and formals",
        "Creation of a sponsorship package to raise more money from sponsors -> Better Events!!!",
        "More metrics to track efficiency of class board leading to increased budget from the school to hold better events",
        "More giveaways for the entire class and more free Wharton merch",
        "More mental health resources",
        "Familiarity with class board operations and goals from serving one year already"
      ],
      "image": {
        "src": "../../../images/2022/nec/Shivam_Shah_DPPhoto.jpeg"
      },
      "instagram handle": "shah_shivam_",
      "facebook url": "",
      "campaign website": ""
    },
    {
      "name": "Nick Diamond",
      "introduction": "Hey everyone, my name is Nick Diamond. I’m a Wharton freshmen outside the Penn student government looking to serve as a bridge between the administrators and the class of 2025 as your Wharton Chair. Through increased transparency and communication with on-campus groups, I hope to best advocate for the wants of my peers. Some projects I’m eager to partake in are creating a Wharton class of 2025 formal and increasing collaboration between Wharton clubs and groups. I hope to earn your vote of confidence and please feel free to reach out with any questions, comments, or concerns.",
      "platform points": [
        "Heightened collaboration with on-campus Wharton groups",
        "Grace period for losing a GSR so you don’t get immediately forced out",
        "Class of 2025 Wharton formal",
        "Transparency on Penn admin decisions- like the mask re-mandate"
      ],
      "image": {
        "src": "../../../images/2022/nec/Nick_Diamond_DPPhoto.jpeg"
      },
      "instagram handle": "ndiamond7",
      "facebook url": "",
      "campaign website": ""
    }
  ],
  "Engineering Chair": [
    {
      "name": "Andrew Lukashchuk",
      "introduction": "Hi, my name is Andrew Lukashchuk. I am a freshman in the School of Engineering and Applied Science and I study Computer Science and run track. I am running for Engineering Chair to create a greater sense of community among those studying engineering and help cultivate resources for student health and wellbeing. There is not much gear or events for engineering students, which I will look to change to give us more representation as one of Penn’s four schools. My goal is to work with all of my fellow engineering students to help make Penn engineering a more positive environment.",
      "platform points": [
        "More gear for engineering students including shirts, hats, and accessories.",
        "More events for engineering students to create a greater sense of community among the students.",
        "Events could potentially include more fun events with cohorts during NSO and a formal.",
        "Make it easier to find study partners for students to work together and prepare for classes and exams.",
        "Look to improve access to physical and digital academic resources to help engineering students do independent projects.",
        "Improve access to student health and wellbeing resources."
      ],
      "image": {
        "src": "../../../images/2022/nec/Andrew_Lukashchuk_DPPhoto.jpeg"
      },
      "instagram handle": "andrewlukashchuk",
      "facebook url": "https://www.facebook.com/lukashchu",
      "campaign website": ""
    },
    {
      "name": "Fiona Wu",
      "introduction": "HEYO, it’s Fiona Wu and I'm re-running for Engineering Class Chair! I'm a computer science major, but I also love architecture, design, and music. My latest obsession is playing all the diff versions of wordle (dordle, octordle, sedecordle, worldle, crosswordle, you name it!).  On campus, I am also involved in Penn Taiwanese Society and United Minorities Council. I WOULD LOVE to serve another year, committed to continue representing the engineers of 2025's needs, wants, and who you are! Let's provoke real change and create another fun year together. Follow my campaign on @fiona.wu_ and feel free to talk to me about anything!\nBest, \nFWU - Fiona With U",
      "platform points": [
        "PAST EXPERIENCE - this year, here are some things that I helped accomplish/spearhead:  tiny stuffed animals at LOVE event, coming up with the party favors (fun succulents!) and designing the ice sculpture at BLOOM, social media on @upenn_2025",
        "FREE *AND* QUALITY MERCH – previous fun items ^^.  as someone with previous experience designing, manufacturing, and selling stickers shirts, sweaters, I will ensure the class merch, especially for engineers will be dope!",
        "COMMUNICATION – I want to open a system where students and student organizations can submit events for the week to be highlighted on @upenn_2025 the Sunday before! Let’s highlight the talents and the efforts of the class.",
        "EVENTS PLANNING – I can help host anything from fun, social events (BLOOM) to wholesome, wellness events (LOVE sign event) to professional related events (PENNternships summer events)",
        "INCLUSIVITY & DIVERSITY – As a minority growing up in Missouri, I am dedicated to representing those underrepresented and inclusive to all whether that means through proper accommodations at events to making sure that information is easily accessible and readable."
      ],
      "image": {
        "src": "../../../images/2022/nec/Fiona_Wu_DPPhoto.jpeg"
      },
      "instagram handle": "fiona.wu_",
      "facebook url": "",
      "campaign website": ""
    },
    {
      "name": "Ben Sailors",
      "introduction": "Hi, my name is Ben Sailors! It has been absolute pleasure and honor to serve as your VP of Finances and UA Rep over the past year. From planning major events like the Spring Formal and ECON Scream to smaller pop ups like our Valentine’s giveaway, I have ensured that our budget is balanced, and everything is financially coordinated well. I now have an extensive knowledge of Penn’s financial procedures and know exactly what to do to ensure our Class Board keeps delivering amazing events. If re-elected, I will make sure that our next events are even better than before!",
      "platform points": [
        "CB: In our budget, I will work to both keep it balanced and increase the contributions we can make to great charities like Project HOME",
        "CB: I will work to make sure that our mech for next year, quarter zips and bucket hats and more(!), is stylish, incredible, and accessible to all",
        "CB: I will work with our CB to ensure that our events next year are bigger and better than ever with plenty of food, giveaways, and great tines",
        "CB: With student input, I want to keep our old traditions strong, but also create new ones with amazing memories we will carry with us for years to come",
        "UA: I wish to work with nontraditional student populations to ease their transition to Penn and provide spaces for them to seek help, if needed",
        "UA: I want to continue my work with Penn Dining to expand meal swipe donations and give back to our community"
      ],
      "image": {
        "src": "../../../images/2022/nec/Ben_Sailors_DPPhoto.jpeg"
      },
      "instagram handle": "bnsailors",
      "facebook url": "",
      "campaign website": ""
    }
  ],
  "Nursing Chair": [
    {
      "name": "Benita Cui",
      "introduction": "Hey hey! I’m Benita Cui, and it has been an honor to serve as your Nursing Class Chair for our freshman year. As we transitioned back to in-person activities, it has been an incredible experience to have brought back traditional events with the Class Board of 2025. From secretly screaming about microbio at the Econ Scream, sharing what we appreciate at the LOVE Valentine’s day pop up event, to seeing each other all dressed up at the BLOOM spring formal, I will continue creating these special highlights in our sophomore year as your Nursing Class Chair for all you cuties!",
      "platform points": [
        "Student Wellness: Advocating to improve students' experience throughout our transition, easing club application deadlines, inviting emotional support animals, and organizing self-care, bonding and fun events for our class.",
        "Penn Nursing 2025 Instagram: A student-run social media platform just for our class to share relevant academic and upcoming event information, and snapshots from the lives of our fellow classmates!",
        "School Spirit: Bringing back iconic spirit weeks because why not?? I wonder what you’ll bring for “Anything but a Backpack Day!”",
        "Student Unity: Let's build the tight-knit community Nursing students are renowned for, and also collaborate with other schools and student organizations."
      ],
      "image": {
        "src": "../../../images/2022/nec/Benita_Cui_DPPhoto.jpeg"
      },
      "instagram handle": "benita_cui",
      "facebook url": "https://www.facebook.com/profile.php?id=100004965767659",
      "campaign website": ""
    }
  ]
}