{
  "Nursing Class Chair": [
    {
      "name": "Ellie Mayers",
      "introduction": "Hey class of 2026!! I’m Ellie Mayers, I’m from the suburbs of Cleveland, OH (midwest is best!) and I’m so excited to be running as your 2026 Class Board Nursing Chair. As a future nurse, I care deeply about the wellbeing of those I interact with, have empathy for the issues facing our generation, and see myself as a leader and a lifelong advocate for change both in healthcare and in our greater community. I would love to bring my passion for Penn Nursing and the Penn community to Class Board this year, serving as your Nursing Chair.",
      "platform points": [
        "Represent Penn Nursing and the class of 2026 positively and passionately in every class, meeting, walk on Locust, and school event",
        "Create hype around nursing; Penn Nursing is the best nursing program in the world and yet we’re so often forgotten by members of the university",
        "Play an active role in event planning and promotion; integrate nursing students and other econ-free students into the coveted tradition of the Econ Scream",
        "Prioritize transparency and clear, constant communication with other class board members and with the entirety of our class",
        "Serve as a liaison between Penn Nursing, the class of 2026, and university officials; prioritize student interests in these interactions"
      ],
      "image": {
        "src": "../../../images/2022/nec/Ellie-Mayers.jpeg"
      }
    }
  ],
  "Wharton Class Chair": [
    {
      "name": "Akash George",
      "introduction": "Looking FRESH Wharton 26!  My name is Akash George from Southern California and I am running to be your Wharton Class Chair to represent, embody, and advance the interests of Wharton ‘26.  Even with our broad diversity, I have noticed three shared traits of ours that I hope to focus on as Wharton Chair: our drive for improvement, our desire for genuine relationship and connection, and our thirst for knowledge.  As Wharton Chair, I plan on using my extensive event planning and interpersonal experience to provide fresh opportunities in the interest of Wharton students of our class.",
      "platform points": [
        "Bring FRESH ideas and perspectives to CB!",
        "Facilitate top-notch class-wide events by leveraging my past experience.",
        "Reward and encourage improvement via engagement programming.",
        "Establish research and polling initiatives to better understand Wharton's voice.",
        "Simplify the information pipeline for pre-professional interests.",
        "Host event opportunities for Wharton ‘26 to network internally and with other classes."
      ],
      "image": {
        "src": "../../../images/2022/nec/Akash-George.jpeg"
      }
    }
  ],
  "President": [
    {
      "name": "Ryan Schager",
      "introduction": "Hi everyone! I am Ryan Schager, and I am so excited for the opportunity to be your next Class Board President! I have absolutely loved my time here so far, I cannot wait to spend the next four years alongside such an amazing group of people. I would love the opportunity to unite our class through fun events, to incorporate new traditions for years to come, and to establish the Class of 2026 as a vibrant, close-knit community! I love making new friends and meeting new people, make sure to say hi or reach out to me at any time! :)",
      "platform points": [
        "Working for the Student Body - I will always prioritize peer feedback on how I can work to make your Penn experience most favorable! Feel free to reach out!",
        "School Spirit + Unity - I would like to highly promote school spirit through creating new events that the Class of 2026 will establish as traditions at Penn for years to come.",
        "Free + Expanded Merchandise - I want everyone to feel proud to be a part of the Class of 2026, and to proudly wear free 2026 t-shirts + sunglasses given out at events!",
        "Water Fountains in Residential Buildings - I would like to incorporate more accessible purified water fountains through residential buildings to benefit the student body.",
        "Ice Machines in Residential Buildings - I would also like to provide ice machines throughout lounges of residential buildings to provide more accessible ice to students.",
        "External Funding - I plan to work tirelessly to host events to increase our funding + budget through outside sources in order to increase accessibility giving back to our class."
      ],
      "image": {
        "src": "../../../images/2022/nec/Ryan-Schager.jpeg"
      }
    },
    {
      "name": "Hannah Kim",
      "introduction": "Hey everyone! My name is Hannah Kim and I am in the College of Arts and Sciences, studying chemistry, on the pre-med track. I love all sports, but tennis is my favorite one. I am running for your class president to make our time here fun and to further the traditions of our school. As the executive president of my high school last year, I am experienced in student government and hope to use my knowledge to my advantage. Your support would be greatly appreciated.Thank you!",
      "platform points": [
        "My goal is to ensure that every student’s voice is heard. I want to engage with everyone and receive feedback or suggestions.",
        "I hope to increase the quantity of free stuff distributed for our class, and to make sure that there is enough.",
        "I intend to advocate for cheaper textbooks and free online resources that are used in class.",
        "It is my hope to create new traditions and activities to increase student engagement."
      ],
      "image": {
        "src": "../../../images/2022/nec/Hannah-Kim.jpeg"
      }
    },
    {
      "name": "Leo Solga",
      "introduction": "Salutations! I’m Leo Solga and I’m running to serve as your bow-tie-wearing Class President and UA Representative. I want to coordinate outstanding class events and improve student life at Penn, and I have the experience and drive to make it happen. We deserve an excellent and unique freshman experience starting with a phenomenal Econ Scream! Additionally, I intend to work to improve and support our currently ineffective psychological counseling services. If elected, I would be committed to serving as your President and UA Rep and would take on no more extracurricular responsibilities. Thank you, and godspeed!",
      "platform points": [
        "I have years of experience getting things done in Student Government, including serving as my High School’s Student Body President.",
        "I will be committed to serving you. I will take on no more extracurricular responsibilities.",
        "I will work on improving Penn’s psychological counseling services. Penn should not have the most depressed student body in American higher education.",
        "I will plan and host memorable and unique freshmen events!",
        "I will listen to your voice and remain easily accessible for thoughts, suggestions, or concerns."
      ],
      "image": {
        "src": "../../../images/2022/nec/Leo-Solga.jpeg"
      }
    },
    {
      "name": "Abhay Srivastava",
      "introduction": "I’m Abhay Srivastava and I’m running for Class President and UA New Student Rep because I hope to create a more diverse, inclusive, and sustainable Penn. As a first-generation American, I recognize the importance of appreciating and celebrating the many identities that Penn students embody. If elected, I will consider student voices from all backgrounds to host class events that unify the Penn community through their differences. As someone who values others’ opinions, I will work alongside Penn’s administration to accommodate the asks of the student body, and to ensure student feedback lies at the core of our initiatives.",
      "platform points": [
        "Hosting opportunities for students to engage with local non-profits and environmental organizations to reduce environmental waste, promote sustainability, and encourage community engagement",
        "Giving students a voice and their own platform through surveys, suggestion boxes, etc. and incorporating feedback to create exciting and relevant events and changes",
        "Developing a greater breadth of diverse and inclusive events for Penn students to appreciate everyone's unique background and gain unique cultural perspectives",
        "Creating a more robust mental health support system for students by making resources and assistance more accessible and equitable for students who need it",
        "Working directly with Penn administration and incorporating student opinion and feedback on ways to enact change on pressing issues affecting Penn and the local community",
        "Extending the range of dining dollars to a greater amount of local food stores/restaurants"
      ],
      "image": {
        "src": "../../../images/2022/nec/Abhay-Srivastava.jpeg"
      }
    },
    {
      "name": "Jaideep Grewal",
      "introduction": "Hey everyone! My name is Jaideep Grewal but I also go by “deep”, “dj deep dog”, and “jai-shallow”. If those names don’t ring a bell, I am easily identifiable as the kid who is always running through the quad and loudly singing and speaking to every person I see (as a means to procrastinate from work). Ok, I am getting off topic (as you can see my crippling ADHD is shining through), but I think I have the perfect mix of experience, diligence, enthusiasm, optimism, and drive to lead our class this year.",
      "platform points": [
        "FUN: Classes, clubs, and school in general are stressful. I commit to establishing as many fun social events as possible (with free food, of course).",
        "PRINTERS: Especially for those in the quad and in CAS, we have to take a long trek to find a printer. I commit to making printers more accessible everywhere.",
        "FACILITIES: I commit to establishing more routine cleanings of bathrooms and all public areas. Temperature fluctuations will also be taken care of.",
        "MENTAL HEALTH: Many general resources are listed on campus pages, but are they really accessible? I commit to making mental health resources easily accessible through virtual consults.",
        "FOOD/DRINKS: I commit to having vending machines in every house, and easy pick-up points for food deliveries at the entrances of every house.",
        "CLUBS/CLASSES: I commit to concentrating all club apps into one common application and making Path@Penn easier to use."
      ],
      "image": {
        "src": "../../../images/2022/nec/Jaideep-Grewal.jpeg"
      }
    },
    {
      "name": "Diego A. Font",
      "introduction": "With the experience I—Diego Font—have accumulated throughout the leadership roles I held in high school, such as Student Council President, I can unequivocally assert my readiness to lead you as Class President. Effectively, I will fight for your interests and work for you with the utmost sense of responsibility, excellence, professionalism, and goodwill. Now, I am not a quitter, and I will be the 24/7 President that you need and want. Ultimately, it would be an honor to be able to serve and work for what I love and treasure most about Penn: the people that make it up.",
      "platform points": [
        "I will organize social gatherings, namely barbecues, music festivals, excursions, balls, Freshmen Winter and Summer Olympics, etc., to foster camaraderie among us. I also pledge to uphold Penn’s deep-rooted traditions.",
        "I will bring about adaptations of popular game shows, such as America’s Got Talent, Family Feud, Jeopardy!, and Countdown, among others, for you to participate and indulge in at Irvine Auditorium.",
        "I will lay the foundations for a yearbook that reminisces our Academic Year 2022/23 by establishing a Yearbook Committee you could join. The Official Class Board 2026 Instagram will be created too.",
        "I will actively pursue sponsorships and arrange fundraisers. Most will be aimed at procuring you a faster and more efficient method of transportation of your choosing, like skateboards and scooters.",
        "I will assemble a study group for each course that you are presently taking; these groups will convene weekly. Freshmen from each course will moderate and chair their respective sessions as volunteers.",
        "Lastly, my central purpose is to provide you with the representation you justly deserve, for your voice matters; your concerns, initiatives, and suggestions will be taken into account. Reach me: 787-379-7373."
      ],
      "image": {
        "src": "../../../images/2022/nec/Diego-A.-Font.jpeg"
      }
    },
    {
      "name": "Vedika Jawa",
      "introduction": "Hello! My name is Vedika Jawa and I’m originally from California. I enjoy playing basketball (hit me up for a 1v1), camping (thank you PennQuest), and taking lots of pictures! I know that all of us are coming from such different high school experiences and have found ourselves overwhelmed at some point in these past three weeks. I want to make our transition to freshman year as smooth as possible. I’ll make sure that freshman traditions, like EconScream, are memories we will treasure while also initiating new social events. If you like Wawa, then you’ll like Jawa :)",
      "platform points": [
        "Cultural Diversity -  Hold social gatherings every month with food from different cultures each time (Cuban, Vietnamese, and more) to further celebrate and represent Penn’s international diversity.",
        "Inclusivity - Organize parties and social events such as a homecoming dance and class sleepover (you won’t need to know a brother to get into these - I promise!)",
        "Equity - Focusing on making sure that students of all backgrounds have an equal opportunity to engage in class experiences. i.e. : subsidizing costs for new class merch drops"
      ],
      "image": {
        "src": "../../../images/2022/nec/Vedika-Jawa.jpeg"
      }
    },
    {
      "name": "Daniel Robinson",
      "introduction": "I'm Daniel Robinson and I'm from Bethesda Maryland. I came to Penn knowing I would be surrounded by the best. As a community, I believe we deserve the best, especially seeing that we are the first post-pandemic class to join Penn. Our special status puts us in a position to lead Penn to new heights and I would be honored to lead us there.",
      "platform points": [
        "Making Penn a welcoming place for all students",
        "Making students aware of all of Penn's resources",
        "Revisiting Penn's fantastic traditions to host fun and exciting class-wide events"
      ],
      "image": {
        "src": "../../../images/2022/nec/Daniel-Robinson.jpeg"
      }
    },
    {
      "name": "Gabriel Dyssell-Hofinger",
      "introduction": "As an international, South African student, bringing people together from different backgrounds is culturally important to me. Unlike the undergraduate assembly who are involved in making policy changes, a class president is supposed to be representative of and able to unite the student body. As someone who balances the M&T workload, a vibrant social life, an intensive fitness program, and my family, I doubt there are many individuals who I do not represent in at least one of these aspects. As a class president, I would be committed to preserving and improving our traditions and to uniting the student body.",
      "platform points": [
        "Firstly, seasonal social activities such as freshman snowball fight with all classes cancelled for the first snow day of the year",
        "Secondly, I want to bring a taste of South Africa and host monthly “Braais” (much better barbeques) in the quad which will be open to all freshman",
        "Thirdly, bringing together social activities and mental health awareness by implementing monthly puppy therapy sessions",
        "Fourthly, organizing subsidized beach days with accessible transportation and free food",
        "Fifthly, day trip to New York city to expose UPenn students to all the Big Apple has to offer",
        "Sixthly, a water day with water guns, balloons, ice cream and slip and slide"
      ],
      "image": {
        "src": "../../../images/2022/nec/Gabriel-Dyssell-Hofinger.jpeg"
      }
    },
    {
      "name": "Martina Bulgarelli",
      "introduction": "I'm Martina Bulgarelli from Italy. I enjoy meeting new people and learning about new cultures. I have been involved in student government since freshman year in high school from being class to school coordinator. I also obtained a position in the Italian National Student Council representing more than 1,5 million students. Being passionate about giving a voice to minorities and making everyone feel comfortable in this new experience are some of the reasons I am running for President of Class Board and member of the Undergraduate assembly.",
      "platform points": [
        "Mindfulness: camping by the beach - relax after midterms",
        "Action: olympenn - sport and arts tournament of the year",
        "Remember: Time capsule - collect our wishes for the future, to be opened after graduation",
        "Talent: Class merch design talent - get creative, submit your design, it might be the one printed on class hoodies",
        "Inclusivity: Traditions festival - traditional clothing parade and cooking challenge"
      ],
      "image": {
        "src": "../../../images/2022/nec/Martina-Bulgarelli.jpeg"
      }
    }
  ],
  "Executive VP": [
    {
      "name": "Hersha Chauhan",
      "introduction": "Hi! My name is Hersha Chauhan and I am running for Executive Vice President of the Class of 2026. If I am honored to represent you this year, I will dedicate myself to making our freshman year as memorable and rewarding as possible. As a member of our Class Board I will work to ensure that we begin our journey of four years together through various events that will promote positivity, facilitate significant change, and ultimately, unite the Class of 2026 for years to come.",
      "platform points": [
        "Togetherness. We all have unique backgrounds and we should celebrate this diversity, forge genuine connections, and build our class spirit.",
        "Outreach. As Penn students and frankly as citizens we have a duty to make an impact and get involved with the greater community of West Philadelphia in a meaningful way.",
        "Mental Health. It is time to redefine the stigma around mental health at Penn. The culture must change, it is as simple as that.",
        "And on a less serious note- free food/events/merchandise because why not?",
        "Finally, I want to hear from you, because in all honesty that is what my position on student government will be all about. Reach out at 203-505-9311"
      ],
      "image": {
        "src": "../../../images/2022/nec/Hersha-Chauhan.jpeg"
      }
    },
    {
      "name": "Isaac Tang",
      "introduction": "Hello! I’m Isaac Tang and I’m from Miami. I’m currently in CAS, studying Math (that is the most boring fact about me, promise). Outside of the classroom, I’m in Counterparts, one of Penn’s acapella groups, and I hope to get more involved in the Philly community. I'm running to represent you because I’d love to get to know each of you good looking people, and bring our class together through fun events because, as Mr. Worldwide once sang, “One’s company, two’s a crowd and three’s a party.” We have a little more than three students, but we’ll make it work.",
      "platform points": [
        "Encourage our class to explore the greater Philadelphia community through social events and parties downtown",
        "Promote class spirit through more free Penn merchandise",
        "Expand our student body’s cultural knowledge through free food and culinary events",
        "Host more events to display Penn’s performing and visual arts",
        "Create opportunities to get outside of Philly and network with other Ivy league students",
        "Create opportunities to get outside of Philly and network with other Ivy league students"
      ],
      "image": {
        "src": "../../../images/2022/nec/Isaac-Tang.jpeg"
      }
    },
    {
      "name": "Colby Snyder",
      "introduction": "I’m Colby Snyder, a student in the College and Engineering from Reading, Pennsylvania, and I’m running for Executive Vice President of the Class of ‘26. I’m passionate about sustainability and bridging the opportunity gap, and I intend to bring these values to the Class Board. If I’m elected, I plan to work with the administration to advance environmental and social responsibility at Penn. Most importantly, I’ll ensure that student voices are heard to plan engaging first-year events and spark meaningful change.",
      "platform points": [
        "Working alongside Philly non-profits and environmental groups to reduce food waste and single-use plastic consumption at Class Board-organized events.",
        "Implementing accessible and frequently checked message boxes and digital surveys to make student voices a factor in planning and improving events.",
        "Increasing communication between the student body and administration to facilitate action on issues at Penn and in the surrounding community.",
        "Coordinating large-scale volunteer events for students to interact in a non-academic setting while giving back to West Philly."
      ],
      "image": {
        "src": "../../../images/2022/nec/Colby-Snyder.jpeg"
      }
    },
    {
      "name": "Koustav Datta (Stav)",
      "introduction": "Hi everyone! My name is Koustav Datta, I am from New Hampshire, and I am interested in running for Class Board Executive Vice President, as well as a representative of the Undergraduate Assembly. Student Government has always appealed to me, and I am thoroughly interested in becoming involved with such an organization at Penn because it would bless me with the opportunity to foster connections with the members of my Class, incorporate activities that the Class of 2026 would want to see take place, and to create a tighter-knit community with the greatest class Penn has ever seen.",
      "platform points": [
        "- Bolstering school spirit with a Sadie Hawkins Dance (a dance where the girls ask their significant others out to the dance)",
        "- Hosting activities on the College Green every month, such as a field day for the Class of 2026.",
        "- Hosting an exclusively Class of 2026 picnic in the later months of the school year (when the temperature warms up).",
        "- Hosting a Powderpuff game (a football game where the girls play football and the guys cheerlead, where cheerleaders volunteer as coaches for the boys and football players volunteer as coaches for the girls).",
        "- Organizing a Class of 2026 Scavenger Hunt on Penn's Campus and Central Philadelphia (teams based on Residential College Houses)",
        "- And the most important point, being open to listening to people for their suggestions on what they truly believe could make 2022-2023 a valuable and enjoyable year for the Class of 2026."
      ],
      "image": {
        "src": "../../../images/2022/nec/Koustav-Datta-(Stav).jpeg"
      }
    },
    {
      "name": "Juan Lopez",
      "introduction": "Hello Class of 2026, My name is Juan Lopez and I am excited to run for the Executive Vice President and UA position. I am majoring in Political Science and I’m from the Bay Area. I am running to be able to advocate for each and every student at Penn! I will try my best to make our freshmen year at Penn memorable by making sure we have fun bonding class events and free Penn merch since we know how expensive it can be at the bookstore *cough cough*. Be sure to check my Instagram for more details @lopez4viceprez!",
      "platform points": [
        "I’ll make sure to advocate for the needs of every student at Penn! You’ll all have my socials or email and can let me know of any questions or concerns.",
        "As I’ll be in the loop on most things, I will make sure to let everyone know of anything that might not be beneficial to our class.",
        "Making Penn a more collaborative community rather than a competitive one!",
        "Increase the financial aid a student receives/ have the financial office take other things into account regarding one’s EFC!",
        "Support the FGLI community with more resources to succeed at Penn and create a strong community within one another!",
        "Advocate for a change in dining hall food options… specifically Hill and Commons!"
      ],
      "image": {
        "src": "../../../images/2022/nec/Juan-Lopez.jpeg"
      }
    }
  ],
  "College Class Chair": [
    {
      "name": "Eric Lee",
      "introduction": "Hi everyone! My name is Eric, and I'm a CAS Biochem major from New Jersey running for College Chair and Undergraduate Assembly. I really enjoyed serving my classmates in my high school's student government, and this year at Penn, I'm running because I have big expectations for the amazing things that PSG will accomplish. As the young blood of Penn's campus and the most competitive class in history, we should be ready to make some NOISE. We already had the most memorable convocation, so come along with me and let's make establish ourselves as the most memorable first-years!",
      "platform points": [
        "Kiosk to convert dining dollars and swipes to cash",
        "Extended break for Lunar New Year weekend to accommodate students who celebrate",
        "No classes on Election Day to promote voter engagement among students",
        "More social events for CAS with free food and opportunities to meet other CAS students",
        "More CAS merchandise and distribution of Penn hoodies before winter break for the cold weather",
        "Raising the 4.5 c.u. cap for CAS freshmen during the first semester"
      ],
      "image": {
        "src": "../../../images/2022/nec/Eric-Lee.jpeg"
      }
    }
  ],
  "VP of Finance": [
    {
      "name": "Tiana Wang",
      "introduction": "Tiana is a first-year Wharton student studying finance, running for UA and Vice President of Finance (Class Board). She is passionate about providing all Penn students with access to financial resources, both academically and socially, and has had a lot of previous experience holding leadership positions at a state level and beyond. In the past, she’s organized many wide-scale fundraisers, donation drives for hospitals during the height of the pandemic, and social events, and hopes to bring that experience to Penn’s student government and the Penn community at large.",
      "platform points": [
        "Allocating class funds and resources to individual Penn students (unaffiliated with any club or organization) for the purpose of social/academic events, initiatives they want to start, etc.",
        "Encouraging student engagement by increasing the visibility and accessibility to class events, opportunities, and resources.",
        "Diversifying social and academic events to create a non-traditional university experience.",
        "Prioritizing student feedback before and after initiatives/events by establishing open communication channels via email, in-person, and through online forms.",
        "Emphasizing community engagement and branching out to planning class events beyond Penn’s campus.",
        "Creating a unified platform to access all student government resources and info."
      ],
      "image": {
        "src": "../../../images/2022/nec/Tiana-Wang.jpeg"
      }
    },
    {
      "name": "Shivam Raja",
      "introduction": "Hi! My name is Shivam Raja and I want to be your Vice President of Finance. I am from a small town in Arkansas, and I love to dance, play football, and volunteer for community service activities. I believe the Vice President of Finance position is the best fit for someone who has an analytical mindset, is organized and responsible, and can appropriately represent our student body, and I genuinely believe that that is me. I am committed to serving the Class of 2026 and making sure that we have the best freshman year possible! Thank you!",
      "platform points": [
        "Greater clarification of Financial Transactions and Budget Allocations",
        "Greater Unification of Student Body and Class Board",
        "Greater Representation of Minority Student Groups"
      ],
      "image": {
        "src": "../../../images/2022/nec/Shivam-Raja.jpeg"
      }
    }
  ],
  "Engineering Class Chair": [
    {
      "name": "Faraz Rahman",
      "introduction": "Raise you hand if your tired of frat music... Hello! My name is Faraz Rahman. I call Michigan my home, and DJing my passion. Class board organizes all the fun events and traditions for our school, so I want to use my experience to make sure each and every one is a blast. The first event we are planning is the Econ scream, and I am already planning out how to turn the Quad into Quad-chella. A vote for me is vote for all of us. Vote for-us! Vote Faraz!",
      "platform points": [
        "DJ Experience - I planned and DJed 20 school dances, grad parties, and birthday parties since May for my own business, and I wanna make the most of my experience here.",
        "Foodie - Good food is a big priority for me. Penn dining isn't always it, but you can trust I will make the most of that class board budget",
        "Sports - I want to make sure every stadium is packed so our athletes have the best of home field advantage, and to bring out school together.",
        "Merch - I think we should have students to create and vote on their own designs, just to add a bit of flair to our class."
      ],
      "image": {
        "src": "../../../images/2022/nec/Faraz-Rahman.jpeg"
      }
    }
  ],
  "VP of External Affairs": [
    {
      "name": "August Crane",
      "introduction": "Hello! My name is August Crane. Some of you may know me as the kid with a ferret. Although Penny is integral to my personality, I can assure you that by being elected to Class Board and Undergraduate Assembly, I have more to offer than just my pets. As a FGLI student, I will work to make our university more equitable for students of all economic backgrounds. As a PennGreen alum, I will challenge Penn’s idea of sustainability to encourage true reform. I hope that you will join me in imagining a new future for our class.",
      "platform points": [
        "Encouraging administration transparency: Ensuring that Penn is explicit with the student body in regards to their goals for students and the greater Philadelphia community",
        "Improving quality of dining hall food: Implementing student feedback boxes in each dining hall and utilizing more local and sustainable sources",
        "Enhancing on-campus facilities: Creating proactive ways for Penn Residential Services to solve the cleanliness issues, especially in freshman housing",
        "An emphasis on sustainability: Partnering with Penn Sustainability Clubs and Organizations to curate events that encourage sustainable practices on campus",
        "Strengthening cultural centers: planning intercultural events to emphasize a sense of community between different cultural groups on campus",
        "Financial support for students: Ensuring that all students can participate in class and school-wide events that require spending"
      ],
      "image": {
        "src": "../../../images/2022/nec/August-Crane.jpeg"
      }
    },
    {
      "name": "Michelle Chen",
      "introduction": "Hey, Class of 2026! My name is Michelle Chen (a.k.a. your local Trader Joe’s enthusiast & avid karaoke singer), and I am so excited to be running as your VP of External Affairs and UA New Student Rep! As a former member of student government in high school, my passion for advocating on behalf of my peers and working to create an inclusive and welcoming community runs deep. I believe my background as a First-Generation/Low-Income student will bring a diverse and valuable perspective to the board. For more information on my platform, follow my campaign journey @chen4penn!",
      "platform points": [
        "Represent and advocate for first-Generation/low-Income community.",
        "More wellness resources to help with the transition to college.",
        "Bridging the gap between students in different colleges & creating a more tightknit community.",
        "Continuing past Penn traditions & creating new ones!"
      ],
      "image": {
        "src": "../../../images/2022/nec/Michelle-Chen.jpeg"
      }
    },
    {
      "name": "Marta Zapata Escondrillas",
      "introduction": "Hey everyone! My name is Marta and I am running for Vice-President of External Affairs. A little bit about me: I am from Spain but I moved to Miami when I was seven. Before that, I lived in London for four years. I am in the College and I intend to major in political science and economics with a minor in legal studies. I have experience working in student government as  I held various positions throughout high school. If elected, I look forward to working closely with other representatives, my fellow classmates, and the administration. I hope you will consider me!",
      "platform points": [
        "Easier and more consistent access to sustainable sources of purified water for students.",
        "Opening dining halls to later hours to ensure that students balancing a busy schedule will have fair access to meals throughout the day.",
        "Work with other class representatives to host school wide events to help expand relationships throughout between classes.",
        "Facilitate an environment in which students can come to me to voice their concerns.",
        "Work closely with school resources to make financial aid, health services, and networking opportunities are more clearly shown to students."
      ],
      "image": {
        "src": "../../../images/2022/nec/Marta-Zapata-Escondrillas.jpeg"
      }
    },
    {
      "name": "Sabina Mei",
      "introduction": "Hey! I’m Sabina (she/her) and I’m running for VP of External Affairs. A little bit about me: I’m from California and I plan on studying Sociology/Criminology. I want to contribute to the Class Board by cultivating class spirit through outreach and community organizing. I will strive to create interactions beyond our campus and actively advocate for student needs. From interning at my city government’s community development department to helping coordinate a spirited leadership conference for 1000+ youth, I believe I have what it takes to pull it off. Trust MEI, vote for SABINA.",
      "platform points": [
        "Consideration and inclusivity! I will consistently advocate for class/overall student needs (e.g. printing credit for all colleges, free professional headshots) and actively listen to everyone’s feedback.",
        "I want us to share each other’s cultures through hearty foods and a weekend of cultural festivities. I will work with local restaurants, food trucks, markets, and the cultural resource centers.",
        "I strive to collaborate with nonprofits, grassroots organizations, and the Civic House to engage beyond our campus. This includes initiating fundraisers, different kinds of drives, and service events.",
        "Health and safety should come before anything else. I hope to highlight and promote accessible mental and sexual health resources, whether it’s free menstruation products or campus health fairs.",
        "Building community and class spirit! I will work with the class board, admin, clubs, etc. to plan new events, get us free food and sponsors, and create cute class merchandise."
      ],
      "image": {
        "src": "../../../images/2022/nec/Sabina-Mei.jpeg"
      }
    }
  ],
  "VP of Internal Affairs": [
    {
      "name": "Jeongmin Lee",
      "introduction": "Hello! My name is Jeongmin Lee, and I am a freshman at Penn studying Economics and a possible double major in the humanities! I'm an FGLI student from the suburbs of Chicago, but I was originally born in South Korea. I’m running for student board because I want to help increase transparency into the student board–acting as a bridge between the inputs of students’ input and the institutional requirements of Penn. As the VP of internal affairs, I will help cultivate an environment where every student feels excited to be a part of the Class of 2026!",
      "platform points": [
        "Getting a variety of students' input about preferences, wants, and what they would like to see for events and other Class Board responsibilities.",
        "Spending as much of budget on lots of free food!",
        "Increasing students' knowledge and insight on the internal processes, structure, and responsibilities of Student board. Student Board does not deal with institutional policies, but rather plans events and upholds traditions for the class.",
        "Utilizing Social Media to spread and organize information about different events and gatherings.",
        "Free cute t-shirts for ALL freshman. Not just the first 500 or so!"
      ],
      "image": {
        "src": "../../../images/2022/nec/Jeongmin-Lee.jpeg"
      }
    }
  ]
}