{
  "Nursing Chair": [
    {
      "platform points": [
        "\"Table talk\" with Nursing Dean about healthcare & social justice",
        "Merch giveaways-- P sweaters, face masks, etc. ",
        "25% of Class Board budget to social justice initiatives!",
        "Microgrants-- for you to create your own events!",
        "Program connecting our class with current freshmen!",
        "Online master classes taught by 2022 members!"
      ],
      "name": "Danielle Lo",
      "introduction": "Hi everyone! My name is Danielle Lo and I am a current junior studying nursing. For the past two years, I have had the pleasure of being your Nursing Chair and hope to continue doing so!",
      "facebook url": "https://www.facebook.com/danielle.lo.372",
      "instagram handle": "daniellexlo",
      "image": {
        "src": "../../../images/2020/NEC/danielle-lo.jpeg"
      },
      "image name": "danielle-lo.jpeg",
      "youtube video url": "https://youtu.be/pBMrN1hwiAg"
    },
    {
      "platform points": [
        "Unite Our Class --I would like to host social events to encourage a sense of community and to better get to know each other.",
        "Hear You Out -- I would be sure to hear out everyone's ideas and serve as a voice for the unspoken.",
        "Celebrate You! -- I would celebrate and promote Penn Nursing Spirit, while making sure to support you throughout the way."
      ],
      "name": "Damaris Chaidez",
      "introduction": "Hello Penn Nursing 2022! I'm so excited to run for Nursing Class Chair for Class Board 2022 as I feel I would be a great representative for our class and would love  the chance to be a part of our Student Government. As a FGLI student, I am very passionate about representation and inclusion and would be sure to plan different events so we can get to know each other better outside of our scrubs. In addition, I want to encourage more unity among our class and would be there to support you along the way. Vote for Damaris Chaidez!",
      "facebook url": "https://www.facebook.com/damarisxchaidez/",
      "instagram handle": "damaris.c",
      "image": {
        "src": "../../../images/2020/NEC/damaris-chaidez.jpeg"
      },
      "image name": "damaris-chaidez.jpeg",
      "youtube video url": "https://youtu.be/W2mmFu0_gDM"
    }
  ],
  "Executive VP": [
    {
      "platform points": [
        "Fostering community through innovative virtual events throughout the year.",
        "Committing to making Class Board and UA place a larger focus on diversity, equity, and inclusion efforts not only at Penn, but beyond.",
        "Developing means to transition the student experience into a virtual experience to allow us to safely maximize our college experience amid the pandemic."
      ],
      "name": "Jonathan Scotto",
      "introduction": "My name is Jonathan Scotto (he/him) and I am a proud member of the C’22. \n \nTowards the end of my term freshman year, I decided that I needed to hit reset and take a step back from PSG. Penn can challenge us not only academically, but emotionally and physically. I even wrote an article about it...!  However, during my second year, I strongly missed the opportunity to impact the Penn community at large. That being said, I have excitedly decided to seek out the chance to run for PSG. Please feel free to reach out if you have anything you want to talk about!",
      "facebook url": "https://www.facebook.com/jmscotto7",
      "instagram handle": "scottojon"
    },
    {
      "platform points": [
        "Allocating our budget to social justice events that are run by students within our very own class",
        "Making sure that we give out as much financial assistance as possible for merchandise like P-Sweaters and Hey Day bundles",
        "Supporting the incoming freshmen and setting up mentoring opportunities for our grade",
        "Make sure that our events are inclusive to everyone by hosting them for different time zones and for different interests ",
        "Create events surrounding ideas submitted by our class"
      ],
      "name": "Emily Liao",
      "introduction": "Hi everyone! My name is Emily Liao and I'm running for re-election for Executive Vice President. I've had the honor of being your EVP for the past two years, and I loved working with the board to bring about traditions and events such as Econ Scream during freshman year and Quarter-Zips during sophomore year. This year, I want to focus on hosting events that are the most important to you. We are looking to spotlight people's talents as webinars, to fund people's socially-conscious events, and to support initiatives of people in the class.\nI am so grateful for the opportunity to build an even stronger community among our class, and I am passionate about continuing to serve the class on Class Board.",
      "instagram handle": "emilyliao",
      "image": {
        "src": "../../../images/2020/NEC/emily-liao.jpeg"
      },
      "image name": "emily-liao.jpeg",
      "youtube video url": "https://youtu.be/nRKNn1wCv-I"
    }
  ],
  "VP Internal": [
    {
      "platform points": [
        "Smooth Internal Functioning of the Board: I collaborated and will continue to collaborate with fellow board members to ensure that we're all on the same page during weekly meetings.",
        "Class-Wide Mindfulness Programming: I loved piloting Yoga on the Green last fall and look forward to continuing to implement programs that unite our class around mental health and wellness.",
        "Mentorship Opportunities: We juniors have a responsibility to pay it forward. If re-elected, i would be excited to continue my work on our First Year Survival Guide Mentorship Program for the Class of '24.",
        "I love the Class of 2022. As a Class Board, it's great to be givers of that energy and celebrate the best as well as fight through the tougher moments of our Penn experience with you all."
      ],
      "name": "JJ Kampf",
      "introduction": "Hey Class of 2022!! I'm asking you to re-elect me as your VP of Internal Affairs. I'm in Engineering studying computer science and philosophy and love singing acapella with the Penn Shabbatones, but by far my favorite thing to do on campus is to meet you guys, talk to you guys, and to work hard on developing programming that unites our class. Last year, I had the privilege to do that on a daily basis, and at this moment I'm working hard on facilitating mentorship opportunities for our grade with the Class of 2024. I want to do it again. ",
      "image": {
        "src": "../../../images/2020/NEC/jj-kampf.jpeg"
      },
      "image name": "jj-kampf.jpeg"
    }
  ],
  "College Chair": [
    {
      "platform points": [
        "Unity: 1. Being able to meet more people in our class 2. Sharing our talents and hobbies with others 3. Fostering new friendships and supporting one another  ",
        "Wellness: 1. Spreading awareness and sharing resources for mental health 2. Creating projects/events to decrease stress levels/feelings of loneliness",
        "Advocacy for Underrepresented Groups: 1. Being able to support the voices that struggle to be heard 2. Having table talks/discussions to educate and share our perspectives"
      ],
      "name": "Heewon Kim",
      "introduction": "Hey, Juniors! My name is Heewon Kim, and I’m running for re-election for Class Board 2022 College Chair.\n\nFrom Sophomore Student Orientation, Q-Zips, to Half-Way Toast, I realized how much I loved seeing the smiles on your faces and how much I wanted to create more meaningful events for you all. I also want to be able to have the voice and the power to represent each and one of you. It has been a privilege to serve such incredible people, and I would love the opportunity to serve once again.\n\nVote HEEWON KIM for College Chair!",
      "facebook url": "https://www.facebook.com/HeewonKimCC22",
      "instagram handle": "heewoniekim",
      "image": {
        "src": "../../../images/2020/NEC/heewon-kim.jpeg"
      },
      "image name": "heewon-kim.jpeg",
      "youtube video url": "https://youtu.be/kdQXxbcQrzA"
    },
    {
      "platform points": [
        "A Justice Fund that commits 25% of our budget to 2022 student initiatives that combat racism and other forms of inequality within and beyond the Penn community.  ",
        "Continuing the Junior year tradition of P-Sweaters where — like with Quarter Zips — we’ll set another record in financial aid assistance. ",
        "A micro grants program for your initiatives so you can custom create your own experiences. ",
        "An opt in mentorship and support program that connects our year with current freshman. "
      ],
      "name": "Max Strickberger",
      "introduction": "Since joining Class Board our freshman fall, I've continued to find the experience more and more meaningful. Last year, we created the first ever Sophomore Student Orientation (SSO) and heard from crazy talented classmates during the 2022 Saxby's open mic event. Most recently, we backed the allocation of $750,000 to support underrepresented students. I’ve pushed for events that generate a sense of community within the College, and create opportunities to expand relationships across our class. \n\nWith two years left I know there's so much left in store. I’ve been grateful for my time on Class Board and would love to have your support as College Chair once again :)",
      "image": {
        "src": "../../../images/2020/NEC/max-strickberger.jpeg"
      },
      "image name": "max-strickberger.jpeg"
    }
  ],
  "VP External": [
    {
      "platform points": [
        "-Integrating student voices into programming: Our microgrant program will empower students to spearhead their own initiatives. Class Board will also consistently seek and engage with student feedback throughout the year",
        "-Elevating student voices: Class Board will allocate 25% of its budget to supporting student proposals as we work to combat racism and other inequities on Penn’s campus and in Philadelphia ",
        "-Increasing financial assistance for and access to P Sweaters: All students, regardless of location this semester, should be able to rep junior year’s iconic merch",
        "-Diverse Programming to Engage All Students: Small-scale and large-scale events to promote community and meet students where they are"
      ],
      "name": "Jordyn Kaplan",
      "introduction": "While it’s crazy how quickly college is flying by, I couldn’t be more excited to take on the next two years with the Class of 2022. I’ve loved planning events and merch distributions as your VP of External Affairs the past two years, and I hope you give me the opportunity to continue building community among our class. Junior year has arguably the best Penn traditions, such as P Sweaters and Hey Day, and you deserve the best Class Board to ensure these milestones in the Penn experience are as accessible and as well-executed as possible.",
      "facebook url": "https://www.facebook.com/Re-Elect-Jordyn-Kaplan-for-VP-External-Affairs-2022-1153262248154388/?view_public_for=1153262248154388",
      "instagram handle": "jordyn_kaplan",
      "image": {
        "src": "../../../images/2020/NEC/jordyn-kaplan.jpeg"
      },
      "image name": "jordyn-kaplan.jpeg"
    }
  ],
  "President": [
    {
      "platform points": [
        "Meaningful, unifying events | We’re launching the Penn Survival Guide(ance) project and master classes. P-Sweaters will be cheap and accessible, as we subsidized q-zips more than any previous class.",
        "Equity & inclusion | 25% of our budget will support your initiatives that combat racism and other forms of inequality, within and beyond Penn’s community. We’re following and supporting your lead. ",
        "More collaboration, more impact | From getting tight with Saxby’s to working with the most united group of PSG leaders yet, I will continue to leverage the power of many voices. ",
        "Crowdsourcing & empowering | A new micro grants program for your initiatives so you can custom create your own experiences. Including: socially-distanced events with friends; online cooking events; book club books.",
        "Experience | Last year, I ran on meaningful events and crucial collaborations. This year, I worked to make them a reality, even creating new traditions. This year we’ll keep striving.",
        "With two years left, the best is yet to come <3  "
      ],
      "name": "Sam Strickberger",
      "introduction": "A year ago, I decided to run for president, and it’s the most meaningful decision I could’ve made. Much of that is because of our class. We started the first-ever Sophomore Student Orientation. We cheered on our talented classmates during the 2022 open mic night and our Palestra sophomore night.\n\nStanding up for what’s right has been an important responsibility. Alongside many others, I lobbied administrators to justly support dining hall workers with the virtual spring semester. This summer, I worked with PSG leaders to allocate $750,000 in support of students of color and low income backgrounds.",
      "facebook url": "https://www.facebook.com/SamStrickberger4President2022",
      "image": {
        "src": "../../../images/2020/NEC/sam-strickberger.jpeg"
      },
      "image name": "sam-strickberger.jpeg"
    }
  ],
  "VP Finance": [
    {
      "platform points": [
        "Commitment to Equity: Going beyond Class Board’s 2022 Justice Fund, I will support and prioritize all initiatives that combat inequality, whether it be racial, gender, or financial. ",
        "Commitment to Accessibility: I promise that your financial background will never be an obstacle to participate in Class Board programming; there will always be aid for events, merchandise, and more. ",
        "Commitment to creativity: Virtual learning in the midst of a pandemic is difficult for everyone; and I pledge that Class Board will support you through this transition with both fun and rewarding programming. ",
        "Commitment to community: Whether it be through virtual master classes or Class Board’s new micro-grants fund, we’re all in this together and your input will never go unheard. "
      ],
      "name": "Sarah Zhou",
      "introduction": "Hi everyone! My name is Sarah Zhou and I am running for re-election as VP of Finance for Class Board 2022. From enjoying class traditions together to launching new ones such as SSO and providing the most financial aid ever for class merch, I've enjoyed every moment of serving our Class of 2022 the past two years. As your VP of Finance, I will continue to work hard and put your needs first to make our junior year as rewarding as it can be. ",
      "facebook url": "https://www.facebook.com/sarah.zhou.161",
      "instagram handle": "sarahxzhou",
      "image": {
        "src": "../../../images/2020/NEC/sarah-zhou.jpeg"
      },
      "image name": "sarah-zhou.jpeg"
    }
  ],
  "Wharton Chair": [
    {
      "platform points": [
        "Prioritizing equity and fairness within the Penn community through micro-grants and awareness campaigns ",
        "Maximizing the potential for virtual events and making sure the upperclassmen experience is the same for remote and on-campus students",
        "Improving prior CB initiatives such as merch-giveaways and providing a creative assortment of initiatives for the Junior class ",
        "Developing more frequent and engaging feedback programs to prioritize the changes students want to see the most"
      ],
      "name": "Sameer Khan",
      "introduction": "What's up everyone! My name is Sameer Khan, and I'm running to be re-elected as your Wharton Chair for Class Board 2022. It has been an awesome experience working on the Board to put on the best events for the best students - much love to the Class of 2022 for making it through these crazy times as college students.\n\nFrom working on the Sophomore Quarter Zip team to bringing Restaurant Week to Penn campus, serving as your Wharton Chair has been an extremely fun, rewarding, and creative experience. I'd love to keep the positive energy going as we become upperclassmen on campus, and make the most of our Penn experiences.\n",
      "image": {
        "src": "../../../images/2020/NEC/sameer-khan.jpeg"
      },
      "image name": "sameer-khan.jpeg"
    }
  ],
  "Engineering Chair": [
    {
      "platform points": [
        "Advocate for diversity",
        "Hold events to unite SEAS '22"
      ],
      "name": "Vivek Olumbe",
      "introduction": "My name is Vivek Olumbe and I am running to be your SEAS Chair. With a few highly selective clubs and little to no engineering wide social events, I can understand how you all do not think of yourselves as part of a unified engineering community. However, no matter where you are spending this semester, whether it be from your childhood bedroom in Dubai or a new apartment off campus, we must stand together as a community of engineers dedicated towards excellence and devoted to diversity and inclusion. If given the opportunity to serve as SEAS chair, I will host far more inclusive social events that will ultimately bring us together as a SEAS class of one.",
      "facebook url": "https://www.facebook.com/vivek.olumbe.16/",
      "instagram handle": "v.olumbe",
      "image": {
        "src": "../../../images/2020/NEC/vivek-olumbe.jpeg"
      },
      "image name": "vivek-olumbe.jpeg"
    }
  ]
}
