{
  "Executive VP": [
    {
      "platform points": [
        "Drive participation and engagement among classmates. ",
        "Offer unique events that will appeal to the masses complimenting the longstanding Penn traditions the Class Board already presents.",
        "Pressing issues I will push in student government: (lead in to four and five)",
        "Increase the number of options for meal plans. The ratio of dining dollars to swipes is incompatible with students' experiences. ",
        " Change the printing system, making it free for all students, not just those within specific schools. "
      ],
      "name": "Jack Dooley ",
      "introduction": "My name is Jack Dooley, and I am running for Executive Vice-President of the Class of 2023 and Engineering Representative of the Undergraduate Assembly. Having not run for any positions in student government last fall, I found myself in a unique place to observe university students' day-to-day life. I find that as a whole, we as a student body tend to get caught up in our studies, clubs , etc., and write off all but the most essential Class Board events. I plan to change this, get things done, and increase the quality of your Penn experience.",
      "image": {
        "src": "../../../images/2020/NEC/jack-dooley.jpeg"
      },
      "image name": "jack-dooley.jpeg "
    },
    {
      "platform points": [
        "Mental health matters. We need to emphasize mental wellness year-round with regular ‘23 group CAPS sessions and partnerships with campus mental health organizations to bring comprehensive resources to the class.",
        "Diversity strengthens us. We need to uplift diverse voices by partnering with student leaders in multicultural organizations to host cultural creative nights to foster unity through education.",
        "COVID-19 should not be the end of student-to-student connection. We need virtual social programming like Zoom mixers, streamed concerts, and physical wellness activities to continue to build relationships off-campus.",
        "Class Board is a valuable platform to educate and assist. By working with campus organizations that work for the betterment of the community, we can positively impact our neighbors.",
        "Students deserve easy access to information. A new website would feature class events, resources, and initiatives while highlighting student creative projects and permit easy submission of requests and complaints. "
      ],
      "name": "Elena Miller",
      "introduction": "Certain magic fills the air while strolling down a packed Locust Walk, studying in the historic halls of Fisher Fine Arts Library, and cheering on the Quakers in our electric Palestra. The magic I speak of is not defined by some extraneous force, rather the hustle of our collective student body. Serving this unique and powerful community through programming that addresses wellness, celebrates diversity, and transcends barriers of typical events would be a great honor. I would be humbled to be your Executive Vice-President, and I encourage you to vote the Alana/Elena ticket. ",
      "facebook url": "https://www.facebook.com/elena.miller.12382",
      "instagram handle": "elenammiller ",
      "image": {
        "src": "../../../images/2020/NEC/elena-miller.jpeg"
      },
      "image name": "elena-miller.jpeg "
    },
    {
      "platform points": [
        "Maintain community this semester in a virtual environment with events like Zoom raves, game nights, and speed-dating. Collaborate with other Class Boards to connect different years together. ",
        "Come back strong from COVID-19 with back-to-back events and Penn traditions on-campus.\n",
        "Provide a shipping option to deliver Penn merch sold by Class Board to directly your house (financial aid included for eligible students)",
        "Promote inclusion, and increase funding/partnerships with cultural organizations like the Makuu Black Cultural Center, the LGBT Center, La Casa Latina, the Penn's Women Center, and the Assembly of International Students.\n",
        "Continue supporting FGLI students in Penn traditions and represent FGLI interests in the UA\n",
        "Promote better communication and outreach practices in UA representation\n"
      ],
      "name": "Dylan Conrad",
      "introduction": "Hey Quakers! My name is Dylan and I'm a Sophomore in the College studying Political Science and Philosophy. Having served as Executive VP of Class Board last year, we organized events like ECON Scream, Cram N Jam, and many more! I am seeking re-election as Executive VP, as well as running for UA College Representative, because I want to instill a sense of community, spirit, diversity, and pride among the Penn community, while representing the needs and concerns of the student body. I hope to balance fun events organized through Class Board, with solving the issues that matter on UA.",
      "facebook url": "https://www.facebook.com/conrad4vp",
      "instagram handle": "conrad4penn",
      "image": {
        "src": "../../../images/2020/NEC/dylan-conrad.jpeg"
      },
      "image name": "dylan-conrad.jpeg ",
      "youtube video url": "https://youtu.be/egQC_TB5bGs"
    }
  ],
  "President": [
    {
      "platform points": [
        "Penn’s Funniest Home Videos: Penn students dm funny or interesting videos about their home life to the Class Board, and they can be highlighted in a weekly email.",
        "Penn Olympics: the class is split into four teams, and it’s like color wars. The members on the winning team will get prizes (depending on the budget, hopefully gift cards).",
        "Class Board sponsored blood drives throughout the in-person semester! People need blood more than ever and having lots of people donate at once will greatly help the Philadelphia community.",
        "Virtual Penn Abroad: one or multiple Penn students per week from around the world (and different parts of the U.S.) describe what their lives are like at home.",
        "Movie nights! Through Netflix party, Hulu Party, Amazon Prime party… any streaming service that has a share play feature we can use for a movie night."
      ],
      "name": "Charlie Hewit",
      "introduction": "There are a couple of reasons why I’m running. Even though this pandemic made us go virtual, it can be used as a tool to bring our class closer. While some of our friends are hundreds and even thousands of miles away, the Class Board has a unique role that can help us come together. Also, I would like to improve Class Board sponsored community service by establishing blood drives and helping other various events. I’m a good listener; I will always be open to new ideas. It would be a privilege and honor to serve as your President.",
      "instagram handle": "CharlieHewit",
      "image": {
        "src": "../../../images/2020/NEC/charlie-hewit.jpeg"
      },
      "image name": "charlie-hewit.jpeg ",
      "youtube video url": "https://youtu.be/5uGnP0pqW6A"
    },
    {
      "platform points": [
        "Organization of donation program to Philadelphia AIDs Thrift. Instead of throwing out valuable goods during move-outs, students will be encouraged to make charitable gifts towards people living with HIV/AIDs",
        "Organize activities that encourage classmates to explore the bounds of our diverse city, away from tourist centers and into real communities.",
        "Push for Penn to make PILOTs towards the Philadelphia School District. This will be done by encouraging a class donation freeze until Penn recognizes this fight.",
        "Create activities that highlight Penn's gentrification of West Philadelphia, educate peers about redlining, and explore overpolicing in Philadelphia. ",
        "Stand in solidarity with sanitation, food, and other service workers by demanding liveable wages. Creation of class activities that show appreciation for (predominately Black) service workers on campus. ",
        "Create more social events with goals of fostering trust, individual wellness, and artistic expression among classmates."
      ],
      "name": "Pierre Li Peters",
      "introduction": "I am running for Class President because I have been moved to lead my community towards social justice. Having lived in Northwest Philly (G-town) most of my life, I am disappointed by the negativity my classmates display towards the city. I hope to show my peers the true beauty and diversity of the city from an insider's perspective, and encourage classmates to unite in doing good for the community they are guests of. Now is the time to listen to students' demands and organize for social good to ensure everyone recognizes that Black lives matter.",
      "facebook url": "https://www.facebook.com/nopierrepressure/",
      "instagram handle": "nopierrepressure",
      "campaign website": "https://vm.tiktok.com/ZMJSpLkwV/",
      "image": {
        "src": "../../../images/2020/NEC/pierre-peters.jpeg"
      },
      "image name": "pierre-peters.jpeg"
    },
    {
      "platform points": [
        "Speakup@Penn will be introduced as a CB controlled page for students to post complaints and ideas.",
        "More COVID-19 testing throughout the semester, we have to flatten the curve and ensure we're back for spring, we want to experience fling. (Let's also not forget about tuition)",
        "International students must be given more attention to navigate through life and work abroad, especially during these troubling times.",
        "Let’s stop getting locked out because we forgot our PennCard, I’ll connect it to Apple and Google pay so we'll have it on our phones.",
        "Ensuring that our campus is diverse and inclusive will be a priority, I will advocate for the introduction of a new Diversity & Inclusivity seat at the Class Board.",
        "Social life once campus is open again will be prioritized, I will make sure that there are as many events as possible (please read the first letter of each point :))."
      ],
      "name": "Philip Henes Alt",
      "introduction": "People call me Henes. I’m known for my smile and positivity, while I’m President I want everyone at Penn to be smiling. Coming from Greece provides me with a unique perspective on the democratic interests of my fellow peers.  My goal is to give students more choice, the public opinion will be an integral part of my presidency. Other than electing our representatives, there isn’t much post-election interaction. Podcasts, Q&As, and communication with our class will be regular. It’s time for change and an international engineering student as President is exactly what we need to ensure inclusivity and happiness.",
      "instagram handle": "henes4pres",
      "image": {
        "src": "../../../images/2020/NEC/philip-alt.jpeg"
      },
      "image name": "philip-alt.jpeg",
      "youtube video url": "https://youtu.be/3qLiLuZM--Q"
    },
    {
      "platform points": [
        "Delayed Gratification Plan - More conservative spending budget consisting of creative virtual programming fall semester, allowing more flexibility, opportunity, and spending power for *hopefully* responsible in-person events in the spring.",
        "Creative Virtual Programming - Given the new environment, I will be resourceful to continue virtually bringing the class together and build community, including leveraging new emerging platforms and online options.",
        "Local Collaboration -  I want to increasingly work alongside other student groups/organizations at Penn to create and offer additional value to our class this year for ideas and programming.",
        "Diversity, Inclusion, & Social Justice - CB is a position of privilege. I want to leverage that to continue advocating for further change, representation, and initiatives for BIPOC at Penn.",
        "Pushing The Boundaries - Looking outside of the Penn bubble and Philadelphia for more opportunities, such as collaborating with student governments at other schools for unique student offerings and programming.",
        "Merch - Our merch last year was cut short due to COVID. I will work with OSA to brainstorm and troubleshoot how we can still create and offer 2023 merch."
      ],
      "name": "Derek Nhieu",
      "introduction": "Hey, I'm Derek. I'm running for Class Board 2023 to serve you again as President. This past year, I've put my heart, soul, and spirit into serving the class of 2023 and the greater Penn community with diligence and compassion. With this year being nontraditional, I want to ensure that we continue to operate effectively in this new, uncertain environment. I've continually tried to push the boundaries of what Class Board can do for you during my term, and this year will be no different. Lend me your strength and confidence again, and we will continue to adapt and succeed.",
      "facebook url": "https://www.facebook.com/derek.nhieu",
      "instagram handle": "nhieuandimproved",
      "image": {
        "src": "../../../images/2020/NEC/derek-nhieu.jpeg"
      },
      "image name": "derek-nhieu.jpeg "
    },
    {
      "platform points": [
        "Appoint the first chair of diversity and inclusion to the Class Board, who will protect the interests of underrepresented minorities. ",
        "Work closely with the UA and university administration to ensure all future COVID related planning is disseminated promptly and includes actionable information, preparing for a return to campus this spring. ",
        "Ensure future Class Merch receives a modern and appealing update and is actually delivered as promised.",
        "Drive to unite our class through events and programming that will foster a stronger school spirit and increase attendance at athletic events. ",
        "Enhance online programming and expand to organize an influential speaker series, featuring prominent and inspiring personalities to engage with the Penn community, wherever you may be this semester. ",
        "Collaborate with members of Penn dining and university administration to improve quality and ensure inclusivity in food options for people with food allergies, dietary restrictions, religious diets, and athletic requirements. "
      ],
      "name": "Michael Troka",
      "introduction": "Hey C’23! I’m Michael, a sophomore from the great cheese state of Wisconsin. We are living in an unprecedented time. Like many of you, I’ve felt disconnected from Penn. Communication from administration about COVID has been slow and lacking in actionable content. For this reason, I am running as your no-nonsense candidate for Class Board President. As a leader, I strive not to be the center of attention on campus, but a liaison between our class and Penn administration. Additionally, I will continue the fight for racial equality and work to enhance student life during COVID. Think BIG. Go BIGGER.",
      "instagram handle": "trokaforpresident",
      "image": {
        "src": "../../../images/2020/NEC/michael-troka.jpeg"
      },
      "image name": "michael-troka.jpeg "
    },
    {
      "platform points": [
        "Mental health matters. We need to emphasize mental wellness year-round with regular ‘23 group CAPS sessions and partnerships with campus mental health organizations to bring comprehensive resources to the class.",
        "Diversity strengthens us. We need to uplift diverse voices by partnering with student leaders in multicultural organizations to host cultural creative nights to foster unity through education.",
        "COVID-19 should not be the end of student-to-student connection. We need virtual social programming like Zoom mixers, streamed concerts, and physical wellness activities to continue to build relationships off-campus",
        "Class Board is a valuable platform to educate and assist. By working with campus organizations that work for the betterment of the community, we can positively impact our neighbors.",
        "Students deserve easy access to information. A new website would feature class events, resources, and initiatives while highlighting student creative projects and permit easy submission of requests and complaints."
      ],
      "name": "Alana Kelly",
      "introduction": "Hi, I’m Alana Kelly! I want to thank you for making Penn home, and for consistently inspiring me. I am honored to be your peer. Your thorough appreciation of a good time and passionate spirits are what drive me to serve as President! Though we face challenges, we have an opportunity to prioritize issues most central to building a unified class. I plan to introduce events that recognize both the power of our shared experiences and that of a diverse community of individuals. I would be humbled to be your President, and encourage you to vote the Alana/Elena ticket!",
      "instagram handle": "alana.kelly",
      "image": {
        "src": "../../../images/2020/NEC/alana-kelly.jpeg"
      },
      "image name": "alana-kelly.jpeg ",
      "youtube video url": "https://youtu.be/R-2w-S424Jk"
    }
  ],
  "Nursing Chair": [
    {
      "platform points": [
        "“We Are Not Really Strangers”: having an in-depth conversation about self-perception, emotions, and reflection with a stranger to facilitate meaningful connections. ",
        "\"Saturdays with the Sophomores”: creating a social media movement where we would highlight a talented and high-achieving member of our class each month. ",
        "“Social Equity @ Penn”: continuing the Class Board’s effort in advancing diversity inclusion on campus by increasing CB’s social activism and student life support role."
      ],
      "name": "Louisa Qiu",
      "introduction": "I am incredibly honored to serve as the first-year Nursing Chair for the Class Board 2023. From Econ Scream to Cram and Jam, I loved co-hosting the Penn traditions that highlighted my first year. I want to continue to bring a vibrant and meaningful sophomore year, with actions and events tailored to the online format. I also want to facilitate institutional changes on the policy level for my classmates and fellow nurses affected by the COVID crisis and more. Therefore, please support me in this election for the Nursing Rep. position on Class Board and UA.",
      "facebook url": "https://www.facebook.com/profile.php?id=100010242794451",
      "instagram handle": "l.chzu",
      "image": {
        "src": "../../../images/2020/NEC/louisa-qiu.jpeg"
      },
      "image name": "louisa-qiu.jpeg "
    }
  ],
  "College Chair": [
    {
      "platform points": [
        "I plan to design awesome UPenn Class of 2023 apparel!",
        "Until in-person events are possible - I plan to do whatever I can to virtually unite our AMAZING class.",
        "When safe, amazing events with LOTS of food!",
        "I plan to advocate for funding of groups that fight for racial equity!",
        "More events with puppies :)",
        "Overall, I want to be a supportive presence for our entire class in these trying times."
      ],
      "name": "Jordan Rosenberg",
      "introduction": "Hi Class of 2023!! My name is Jordan Rosenberg and I am running for re-election as Chair of the College of Arts and Sciences. Last year, Class Board 2023 hosted a variety of successful events including ECON SCREAM, Dogs and Donuts, Cram N Jam and much more. As we all know, this year looks very different than last year and it is that much more important to foster a ~virtual~ sense of community for our amazing 2023 Class! I am excited to continue to get to know as many of you as possible and am always open to suggestions (via text, instagram, FB, etc).",
      "instagram handle": "rosenbergj4caschair",
      "image": {
        "src": "../../../images/2020/NEC/jordan-rosenberg.jpeg"
      },
      "image name": "jordan-rosenberg.jpeg "
    },
    {
      "platform points": [
        "Penn Sophomore Year Sweatshirt Sale ",
        "Virtual volunteering/internship opportunities for our sophomore class",
        "Class Board fund allocation to non-profits that fight for racial equity in academic environments",
        "More puppies on campus during our spring semester",
        "More free food and new collaborations with restaurants",
        "International Food Event in the Spring  "
      ],
      "name": "David Barreto",
      "introduction": "Hello Penn Class of 2023! I hope you and your families are safe during these turbulent times. My name is David Barreto and I am running for re-election as Class Chair for The College of Arts and Sciences. Last year, we successfully hosted a myriad of events from Econ Scream, to our class tree planting, to Cram Jam. We helped foster a sense of community, underscored diversity, and made sure everyone had a voice by working with other clubs and connecting with various students. With your vote, I will continue to work diligently for our amazing class. Thank you! :)",
      "facebook url": "https://www.facebook.com/david.barreto.758399",
      "instagram handle": "barreto4caschair",
      "image": {
        "src": "../../../images/2020/NEC/david-barreto.jpeg"
      },
      "image name": "david-barreto.jpeg ",
      "youtube video url": "https://youtu.be/7lx-sYFt-Ns"
    }
  ],
  "Engineering Chair": [
    {
      "platform points": [
        "Diversity and inclusivity- ALL of your perspectives and inputs matter; cultural events, etc. ",
        "Mental Health Awareness and support- the GRIND never sto-... needs a break once in a while",
        "MORE FREE MERCH and collabs for engineering shirts",
        "More engineering bonding events (potential collabs with ESAC etc.) ",
        "Connection: Isolation is tough :/…. Chill online events for fall to connect with peers",
        "Ultimately, I want to be a friend that can both listen and act on what you think is important :) "
      ],
      "name": "Jacqueline Aquino",
      "introduction": "Hey Penngineers! My name is Jacqueline Aquino and I am running to be re-elected as your Engineering Chair for sophomore year! I am incredibly thankful to have been your Engineering Chair this past year, and I would love to continue to serve you to ensure your voices are heard and your journey here is extraordinary - despite our transition to Zoom University. The purpose of this year is simply to make YOUR Penn experience better than the last, and I know we can make this happen! Below lists what I want to continue/begin implementing to make your sophomore experience memorable! ",
      "instagram handle": "j_aquino_",
      "image": {
        "src": "../../../images/2020/NEC/jacqueline-aquino.jpeg"
      },
      "image name": "jacqueline-aquino.jpeg "
    }
  ],
  "VP Finance": [
    {
      "platform points": [
        "Last year, I fought to increase the class board budgets alongside the older VP’s of Finance. This year, I will do the same. Let’s increase financial aid substantially for merch.",
        "Supporting and uplifting our class’ diverse voices and cultures is really important to me. So cultural food festival anyone? Free food from a variety of cuisines sounds like the dream.  ",
        "For mental health advocacy, we’ll partner with Active Minds so people can virtually hear helpful tips/ask questions about resources. Also, Pet Meet N Greet online and more puppies/massages on campus!",
        "Socially distanced on campus, we’ll do a painting day! All supplies (canvas/paint) will be provided and it’ll be a fun and relaxing hour with music lightly playing in the background. ",
        "Along with offering increased financial aid for merch, I want to help offer a boatload of options other than just P Sweaters: sweatpants, bucket hats, and whatever you all want. ",
        "My last platform point is blank on purpose. I want to hear what YOU ALL want. Do you all want a field day with tug-of-war? A silent rave? I’m listening!"
      ],
      "name": "Anuva Shandilya ",
      "introduction": "Hi everyone! My name is Shandilya, and I’m very excited to be running for re-election as your VP of Finances. Last year, my campaign slogan was 5’1 with a 6’2 work ethic. This year, I am proud to say that I am now 5’1 with a 6’3 work ethic. \n\nBudgeting for and hosting so many fun events like Dogs N Donuts and Econ Scream was the highlight of my freshman year, especially because I got to meet so many of you! That said, I’m both grateful and hopeful that you’ll allow me to continue to serve you. Thank you!",
      "facebook url": "https://www.facebook.com/Anuva-Shandilya-for-VP-of-Finances-100341134698129",
      "instagram handle": "anuvashandy",
      "image": {
        "src": "../../../images/2020/NEC/anuva-shandilya.jpeg"
      },
      "image name": "anuva-shandilya.jpeg  ",
      "youtube video url": "https://youtu.be/klskqU0Zi6E"
    }
  ],
  "Wharton Chair": [
    {
      "platform points": [
        "Maintain accessible free COVID testing on campus throughout the year",
        "Implement a program through which students can form online study groups and meet peers in their classes; Adapt the Take Your Professor to Lunch Program to an online platform",
        "Partner with local restaurants and food trucks to accept dining dollars; Allow meal swipes at Houston Hall (post-COVID)",
        "Work on acquiring student government funding for pre-professional clubs",
        "Improve and increase outdoor seating on and around Locust Walk",
        "Work with mental health and wellness groups on campus to ensure easily accessible resources for all students"
      ],
      "name": "Dani Duffalo",
      "introduction": "I am extremely excited to announce my candidacy for Wharton Chair! Despite serving as a Class Officer throughout high school, I chose not to run for Class Board last year because I wasn’t confident posing solutions without first understanding what needed to be improved. Now, as a Wharton Ambassador having lived at Penn for (almost) a year, I am eager to implement new initiatives and enhance our educational, co-curricular, and social experiences. I absolutely love Penn and am immensely grateful for my education, so I want to make this year - albeit online - special and memorable for the class of 2023.",
      "facebook url": "https://www.facebook.com/danielle.duffalo",
      "instagram handle": "dani.duff",
      "image": {
        "src": "../../../images/2020/NEC/dani-duffalo.jpeg"
      },
      "image name": "dani-duffalo.jpeg "
    },
    {
      "platform points": [
        "Quarter Zips & Harry Potter T-Shirts - Even though its up in the air if we'll ever get back to campus, I will make sure our class can purchase both items",
        "Merch Drops - As we will be saving our funds for the first semester, I plan on having a massive merch drop when we return to campus! Hats, Mugs, Scarves, etc",
        "Improving Residential & Dining Life - I continually want to make sure that students are happy with dining & housing by advocating through each respective advisory boards.",
        "SAC Recruitment - Improve the recruitment process for freshmen and transfers who are already stressed about acclimating and meeting new friends.",
        "Traffic light - Fix the traffic light at 38th & Spruce. It is so dangerous! DPS should put more pressure on the city to fix it."
      ],
      "name": "Carson Sheumaker",
      "introduction": "Hey guys, I'm Carson Sheumaker. This year I've served on both the UA and Class Board as your Wharton Chair. I'm very passionate about putting together events and getting the most fire merch for our class. I love Penn and want to help improve it!",
      "facebook url": "https://www.facebook.com/carson.sheumaker/",
      "instagram handle": "iamcarsonyo",
      "campaign website": "https://qrco.de/sheumaker",
      "image": {
        "src": "../../../images/2020/NEC/carson-sheumaker.jpeg"
      },
      "image name": "carson-sheumaker.jpeg",
      "youtube video url": "https://youtu.be/ONJdtE0s-MI"
    }
  ],
  "VP External": [
    {
      "platform points": [
        " Communicate: You can’t take advantage of opportunities that you don’t know about. I’ll make sure that conversations outside and inside the university are concisely conveyed to the class of 2023. ",
        "Empathize: I care. It’s that simple. I want everyone to feel welcome, worthy and supported. I’ll put in the work to get you whatever you need to feel that way. ",
        "Connect: We are more physically distant than ever, but physical distance doesn’t meet that we forget each other. I promise to provide ways for everyone at home and at Penn to meet.",
        "Safety: Your health is of paramount importance to me. I push Penn to provide more virtual opportunities for both  your physical and mental health like free therapy. "
      ],
      "name": "Steele Parkerson",
      "introduction": "YOU are why I'm running for Vice-President of External Affairs on 2023 Class Board. We are facing unprecedented times and challenges, but by recognizing the areas where we need to change we can work towards a better tomorrow. To get to a better tomorrow we have to listen to everyone's point of view and make changes accordly. I promise I'll always listen to your opinions & your experiences because you matter to me. \n\nIn my tenure, I'll bring all of us together to promote class pride, increase unity through understanding and work to eliminate social barriers. \n",
      "instagram handle": "Steele.the.show",
      "image": {
        "src": "../../../images/2020/NEC/steele-parkerson.jpeg"
      },
      "image name": "steele-parkerson.jpeg "
    },
    {
      "platform points": [
        "Unity: more important than ever now! We must find ways to be together.",
        "Social Justice: we must also learn how to be responsible members of the Philadelphia community.",
        "Community Service: what ways can we serve the greater community?",
        "(Virtual) Fun: lots of opportunities to continue meeting peers and having fun together!",
        "Communication: I will make sure that we stay in contact and find the best way to give and receive information."
      ],
      "name": "Julia Lottman",
      "introduction": "Hello! My name is Julia Lottman and I am running for re-election for Class Board. This past year, I was fortunate enough to learn how to most effectively plan and execute events and how to help bring our community together. I look forward to hopefully utilizing both skills again this year!",
      "instagram handle": "julia4externalvp",
      "image": {
        "src": "../../../images/2020/NEC/julia-lottman.jpeg"
      },
      "image name": "julia-lottman.jpeg ",
      "youtube video url": "https://youtu.be/_9iwHLn_gM0"
    }
  ],
  "VP Internal": [
    {
      "platform points": [
        "Community & Connectivity - Fun merch! More social events/activities to connect people (hobby webinars, collaborative playlists, etc.)! More connection with Penn groups/organizations for collaboration",
        "Communication - Ensuring transparency between the board and student body. Continue utilizing social media to engage students (would love to do Quaker highlights on our stories). ",
        "Inclusivity - Providing more options/support for FGLI, POC, LGBTQ+, etc. Focus our efforts on important issues that matter to students. ",
        "Mental Health & Wellness - Care packages for midterm/finals season! Emphasize/offer CAPS resources. Positive/pick-me-up messages on social media with mental health reminders :)"
      ],
      "name": "Abbie Chan",
      "introduction": "Hi guys! I’m Abbie Chan, and I’m excited to be running for re-election as VP of Internal Affairs. This past year, I’ve learned much about our class dynamic, and though it’s been a wild ride, I’ve loved bringing you guys fun events on campus. Seeing that our college experience is a bit different this year, I want to help people stay as connected and included as possible. I hope to continue supporting our class to grow as a community and upholding our morals in diversity and well-being. We should thrive at Penn, and I want to ensure that rings true :)",
      "instagram handle": "abbiechan_",
      "image": {
        "src": "../../../images/2020/NEC/abbie-chan.jpeg"
      },
      "image name": "abbie-chan.jpeg ",
      "youtube video url": "https://youtu.be/SlSNEt-U3aw"
    }
  ]
}
