{
    "SEAS Representative": [
        {
            "platform points": [
                "Continue to advocate for a team of Wellness TA’s for Intro STEM courses. These TAs will aim to create a welcoming environment in an academic setting.",
                "Lobby for a more diverse representation of students on various students groups on campus.",
                "Liaise to make structural changes to Career Services to have advisors specializing in specific industries. Having more diverse recruiters at Engineering Career Fairs.",
                "In order to build community in a post pandemic world, unite students from different majors and years under a cohort system which will be a longer and more sustained version of the New Student OPA cohorts.",
                "Continue to explore the idea of reflection spaces in a post-covid era.",
                "While focusing on fairness is important, academic policies also need to focus on student wellbeing. Working with faculty to find ways to be more understanding of students impacted by the pandemic."
            ],
            "name": "Sarthak Jain",
            "introduction": "My name is Sarthak Jain, and I’m a junior from Jaipur, India, studying computer science and economics. I use he/him/his pronouns. On campus, I have been involved with Penn Traditions as the Co-chair of Class Ambassadors, SEAS Wellness Friends and Penn FLITE (FGLI in Tech & Engineering) as board members. On the UA, I have worked on projects related to student wellness and inclusion. This work is now more important than ever before. Some of my past projects include lobbying for Wellness TAs for intro SEAS courses and creating reflection spaces across engineering which was supposed to be piloted this Fall. As part of the UA, I want to continue enhancing student wellness and community engagement.",
            "image": {
                "src": "../../../images/2020/NEC/sarthak-jain.jpeg"
            },
            "image name": "sarthak-jain.jpeg"
        },
        {
            "platform points": [],
            "name": "Ralph Tamakloe",
            "introduction": "I’m Ralph Tamakloe, a junior studying EE at Penn. I’m running for UA to advocate for more professional development opportunities and funding for Engineering students.",
            "image": {
                "src": "../../../images/2020/NEC/ralph-tamakloe.jpeg"
            },
            "image name": "ralph-tamakloe.jpeg"
        }
    ],
    "Nursing Representative": [
        {
            "platform points": [
                "“Compensatory Training for Nursing Students”: figure out a potential arrangement that would allow nursing students to receive important in-person clinic training modules after it is safe. ",
                "“PPE @ Penn”: an initiative that provides at least one PPE package, including face masks and hand sanitizers, for every student. ",
                "“Extracurricular Engagement”: alleviating that stress of club recruitment by promoting inclusion and engagement across Penn extracurricular activities."
            ],
            "name": "Louisa Qiu",
            "introduction": "I am incredibly honored to serve as the first-year Nursing Chair for the Class Board 2023. From Econ Scream to Cram and Jam, I loved co-hosting the Penn traditions that highlighted my first year. I want to continue to bring a vibrant and meaningful sophomore year, with actions and events tailored to the online format. I also want to facilitate institutional changes on the policy level for my classmates and fellow nurses affected by the COVID crisis and more. Therefore, please support me in this election for the Nursing Rep. position on Class Board and UA.",
            "facebook url": "https://www.facebook.com/profile.php?id=100010242794451",
            "instagram handle": "l.chzu",
            "image": {
                "src": "../../../images/2020/NEC/louisa-qiu.jpeg"
            },
            "image name": "louisa-qiu.jpeg"
        }
    ],
    "Wharton Representative": [
        {
            "platform points": [
                "Quarter Zips & Harry Potter T-Shirts - Even though its up in the air if we'll ever get back to campus, I will make sure our class can purchase both items",
                "Merch Drops - As we will be saving our funds for the first semester, I plan on having a massive merch drop when we return to campus! Hats, Mugs, Scarves, etc",
                "Improving Residential & Dining Life - I continually want to make sure that students are happy with dining & housing by advocating through each respective advisory boards.",
                "SAC Recruitment - Improve the recruitment process for freshmen and transfers who are already stressed about acclimating and meeting new friends.",
                "Traffic light - Fix the traffic light at 38th & Spruce. It is so dangerous! DPS should put more pressure on the city to fix it."
            ],
            "name": "Carson Sheumaker",
            "introduction": "Hey guys, I'm Carson Sheumaker. This year I've served on both the UA and Class Board as your Wharton Chair. I'm very passionate about putting together events and getting the most fire merch for our class. I love Penn and want to help improve it!",
            "facebook url": "https://www.facebook.com/carson.sheumaker/",
            "instagram handle": "iamcarsonyo",
            "campaign website": "https://qrco.de/sheumaker",
            "image": {
                "src": "../../../images/2020/NEC/carson-sheumaker.jpeg"
            },
            "image name": "carson-sheumaker.jpeg",
            "youtube video url": "https://youtu.be/ONJdtE0s-MI"
        },
        {
            "platform points": [
                "Create UA Global Student Engagement, a board dedicated to encouraging and ensuring Penn student opportunities globally. Opportunities would include class travel, research travel, non-US conferences, and peer-lead, international study groups for all core classes.",
                "Provide resources for the Wharton community for international job placements and/or access to conferences.",
                "Encourage several cross-over events between Penn’s diverse groups, and easier ability for Wharton students to create them",
                "Instill regular town halls between Wharton students and representatives to discuss concerns or desires"
            ],
            "name": "Tari Clement",
            "introduction": "Hi! My name is Tari (pronunciation: tah-ree; meaning: “love” in the Ijaw language).\nI was thrilled to be a part of Wharton’s global community upon arrival: expand my love for languages, learn to negotiate in international business, and have partners from around the world who love the people of the world. I realized that the voice for Wharton’s global engagement is faint, and I have decided through this position I would be its amplifier. In addition to representing and servicing the entrepreneurial spirit of the Wharton School, my heart leans towards bringing our diversity and love for the globe together.",
            "instagram handle": "tariclement",
            "image": {
                "src": "../../../images/2020/NEC/tari-clement.jpeg"
            },
            "image name": "tari-clement.jpeg"
        },
        {
            "platform points": [
                "I hope to work with the administration to address food accessibility on Penn's campus.",
                "Work with the administration to improve transparency, especially in regards to campus re-integration for Spring 2021.",
                "Extend the Add/drop period for students to allow for more optionality in Penn's curriculum."
            ],
            "name": "Janice Owusu",
            "introduction": "Hi, I'm Janice Owusu, originally from North Jersey. I am running again for the UA after serving for two years. In my tenure, I have enacted legalization to make the UA a more inclusive body. I have worked with SFS and CAPS with mental health accessibility and PennAbroad about fees that might isolate students from their programs. I am looking forward to doing more on equity and inclusion initiatives this year. ",
            "facebook url": "https://www.facebook.com/janice.amoh/",
            "instagram handle": "simply.gracious",
            "image": {
                "src": "../../../images/2020/NEC/janice-owusu.jpeg"
            },
            "image name": "janice-owusu.jpeg"
        },
        {
            "platform points": [
                "Organization Communication: I plan to advocate for more intensive methods in which many clubs at Penn, especially those with overlapping interests, could experience less conflict with one another.",
                "Encourage Initiative: Stronger communication between Penn students and faculty is so important, and I hope to serve as a resource to connect students with innovative ideas to the appropriate faculty.",
                "Supporting Minorities & POC: As a POC, I have found a great community at Penn, and I hope to push for greater inclusion within the UA to amplify minority voices."
            ],
            "name": "Joel Olujide",
            "introduction": "Hi! My name is Joel and I'm running to be a Wharton Representative in the UA. I'm very passionate about illuminating our unheard voices on our campus, especially from minorities and people of color. I have personally experienced innovations stifled, or people with frustrations not knowing where to turn to or how to make their situation better. Now, as our circumstances have provided us our greatest challenge yet, I hope to serve as a bridge between students and the tools we can use to make the most of the opportunities that we have been granted in the midst of crisis.",
            "instagram handle": "joelolujide",
            "image": {
                "src": "../../../images/2020/NEC/joel-olujide.jpeg"
            },
            "image name": "joel-olujide.jpeg",
            "youtube video url": "https://youtu.be/Y1Byqs4sPnk"
        },
        {
            "platform points": [
                "Addressing student concerns about online learning",
                "Advocating for more cultural spaces on campus for minority communities",
                "Combating assault within student groups, laying the groundwork for stronger policies that prevent misconduct when Penn’s social scene returns to normal"
            ],
            "name": "Nikhil Gupta",
            "introduction": "I am a junior in the Huntsman Program who grew up in Shanghai, China and Naperville, Illinois. I am studying Business Analytics, Marketing, and Hispanic Studies. Over the past few years, I have served on Cabinet as Communications Director and have worked on the Equity & Inclusion and Student & Campus Life committees. One of my main projects has been providing free menstrual products in bathrooms at popular study locations for all four schools by working with PAGE, GAPSA, and Period at Penn; this initiative will continue post-pandemic. I will continue advocating for marginalized communities in this particularly volatile time. ",
            "facebook url": "https://www.facebook.com/gu.nikhil/",
            "instagram handle": "nikhilgupta_",
            "image": {
                "src": "../../../images/2020/NEC/nikhil-gupta.jpeg"
            },
            "image name": "nikhil-gupta.jpeg"
        }
    ],
    "College of Arts & Sciences Representative": [
        {
            "platform points": [
                "Check out my website tinyurl.com/Vote4Gabriela for a full description of my platform"
            ],
            "name": "Gabriela Montes",
            "introduction": "I am Gabriela Montes and I am running for re-election on the Undergraduate Assembly- this time as your College Representative! I will be representing all College students, along with all female, Latinx, Asian, FGLI, and LGBTQ+ students at Penn—I can personally connect with these groups and, as a representative of the UA, I will advocate for you. \nMy past year in the UA as a New Student Representative has been incredible; I worked on projects ranging from public safety (blue light emergency callboxes) to helping students transition to Penn (intro to West Philly). Let me be your advocate and continue working on initiatives for YOU!",
            "facebook url": "https://www.facebook.com/gaby.montesdeoca.52",
            "instagram handle": "gabymdo",
            "campaign website": "tinyurl.com/Vote4Gabriela",
            "image": {
                "src": "../../../images/2020/NEC/gabriela-montes.jpeg"
            },
            "image name": "gabriela-montes.jpeg"
        },
        {
            "platform points": [
                "Maintain community this semester in a virtual environment with events like Zoom raves, game nights, and speed-dating. Collaborate with other Class Boards to connect different years together. ",
                "Come back strong from COVID-19 with back-to-back events and Penn traditions on-campus.\n",
                "Provide a shipping option to deliver Penn merch sold by Class Board to directly your house (financial aid included for eligible students)",
                "Promote inclusion, and increase funding/partnerships with cultural organizations like the Makuu Black Cultural Center, the LGBT Center, La Casa Latina, the Penn's Women Center, and the Assembly of International Students.\n",
                "Continue supporting FGLI students in Penn traditions and represent FGLI interests in the UA\n",
                "Promote better communication and outreach practices in UA representation\n"
            ],
            "name": "Dylan Conrad",
            "introduction": "Hey Quakers! My name is Dylan and I'm a Sophomore in the College studying Political Science and Philosophy. Having served as Executive VP of Class Board last year, we organized events like ECON Scream, Cram N Jam, and many more! I am seeking re-election as Executive VP, as well as running for UA College Representative, because I want to instill a sense of community, spirit, diversity, and pride among the Penn community, while representing the needs and concerns of the student body. I hope to balance fun events organized through Class Board, with solving the issues that matter on UA.",
            "facebook url": "https://www.facebook.com/conrad4vp",
            "instagram handle": "conrad4penn",
            "image": {
                "src": "../../../images/2020/NEC/dylan-conrad.jpeg"
            },
            "image name": "dylan-conrad.jpeg",
            "youtube video url": "https://youtu.be/egQC_TB5bGs"
        },
        {
            "platform points": [
                "Ensuring a strong community connection between the UA and the rest of Penn",
                "Pressuring Penn’s administration into making reoccurring contributions to underrepresented communities at Penn",
                "Maintaining academic equity for those who may be in different learning environments this year.",
                "Creating spaces for students and administration to discuss and follow through with sustainability measures.",
                "Advocating for FGLI, URM, and LGBTQIA+ members of the Penn community across the board"
            ],
            "name": "Tori Borlase",
            "introduction": "My name is Tori Borlase and I am a junior in the college studying PPE.  I’m super excited to be running for re-election for the UA this year! I have loved being an advocate for the student body during my time on UA.  My projects, which span from meeting with administration about divestment from fossil fuels, to encouraging professors to make their syllabi more accessible during course registration, have all been a part of my goal: making Penn a better place! I would appreciate your vote, and visit bit.ly/toriforua for more information!",
            "facebook url": "bit.ly/toriforua",
            "image": {
                "src": "../../../images/2020/NEC/tori-borlase.jpeg"
            },
            "image name": "tori-borlase.jpeg"
        },
        {
            "platform points": [
                "1. Establish a fair conversion rate from meal swipes to dining dollars that is more flexible and reasonable than the current punitive structure.",
                "2. Reduce the amount of clubs that require both an application and interview process for acceptance.",
                " 3. Revamp and renovate Houston Hall to be a more social space on campus for the spring.",
                "3. Create more mindfulness spaces on campus for when student return.",
                "5. Expand the amount of dining plan options available to students. ",
                " Finally, remember Isabella HASSETT HAS what IT takes.  "
            ],
            "name": "Isabella Hassett",
            "introduction": "My name is Isabella Hassett, and I am running for re-election on the Undergraduate Assembly as an SAS representative. I am a sophomore potentially majoring in Communications, and am running alongside David Garnick. My experiences of serving as a representative on the UA last year and, in high school, as President of my class for three years and one year as Student Body President gives me the experience necessary to do the job well. I believe that to maximize our experience this year, Penn must remain interconnected (virtually of course), regardless of one’s race, gender, religion, sexual orientation, or nationality. ",
            "image": {
                "src": "../../../images/2020/NEC/isabella-hassett.jpeg"
            },
            "image name": "isabella-hassett.jpeg"
        },
        {
            "platform points": [
                "I personally barely knew about all of the important work UA does until very recently. If elected I vow to improve UA accessibility for student concerns — through anonymous drop boxes, office hours, and/or a social media page for students to send concerns and things they want UA to bring up to administration!",
                "I will explore the possibility of increasing space for Penn cultural centers. Why are three of our biggest cultural centers in the basement of the Arch building? And to that point— why is the Intercultural Center so far away from campus?",
                "Encourage all professors to post recordings of lectures even after this semester if a student submits a Course Absence Report. Students all get sick from time to time, and it is a public health issue if students are afraid of missing lectures when sick because professors won’t post lectures online. ",
                "International students already have to deal with differing time zones. Inflexible professors only exacerbate the problem. Accommodations must be provided for international students during inaccessible synchronous online lectures!",
                "Accessible premed advising! As a first-generation pre-med with no support from family or friends, I had a difficult time at first trying to decide what classes were most important in my pre-med journey. Penn should actively help those planning to go pre-med through more active advising.",
                "Our dining halls throw out so much food at the end of meals, yet there are populations experiencing food insecurity within Philadelphia. With UA, I will explore the possibility of donating Bon Appetit’s food waste to the impoverished communities that surround Penn."
            ],
            "name": "Sarah Ramadan",
            "introduction": "My name is Sarah Ramadan and I am a first-generation Brazilian-Egyptian. I’ve taught Haitian women to sew menstrual products and recently I’ve administered COVID-19 testing sites throughout NYC. I know what it takes to lead by action. As your College Representative, I will fight for the changes YOU want to see. Though this semester is far from normal, now is the best time to implement changes for when we return to Penn. There is power in numbers, but we should not need Change.org petitions for our voices to be heard. A vote for Sarah is a vote for you!",
            "facebook url": "https://www.facebook.com/sarah.ramadan.184/",
            "instagram handle": "sarah.ram",
            "image": {
                "src": "../../../images/2020/NEC/sarah-ramadan.jpeg"
            },
            "image name": "sarah-ramadan.jpeg",
            "youtube video url": "https://youtu.be/-aEGUGeCm4M"
        },
        {
            "platform points": [
                "Tuition -- Penn kept our tuition the same as last year; I will press them to justify this decision and will ensure that we are getting all that we’re paying for.",
                "Covid-19 -- On-Campus Testing must be available to all students who want it, year round, symptoms or otherwise; information is power. And, I will install disposable mask dispensaries along Locust.",
                "Covid-19 -- For our fellow students living outside of Philadelphia this semester, especially in places where testing is difficult to acquire, Penn can and must send out mail-away, self-administered testing.",
                "CAPS -- We may be Penn-Strong but we’re all struggling to adapt to this more isolating new normal. We need increased availability and marketing of drop-in, on-demand, privacy-sensitive mental health consultations.",
                "Pass/Fail Deadline -- Our lives as Penn Students and citizens have never been more unpredictable; I will lobby to have the Pass/Fail deadline extended past October 30.",
                "Mobile PennCard Access -- I will continue my work collaborating with Next Generation Student Systems to develop technology to make accessing buildings, rooms, meal swipes, and dining dollars easier than ever once we’re back."
            ],
            "name": "Jonah Schenk",
            "introduction": "Hey! I’m Jonah Schenk and I’m running for reelection as your College UA Representative. As a school, we're economists and environmentalists, coders and chemists, home-grown Philadelphians and international scholars, and much more. But, what we share is a desire to make an impact and be heard. If elected, I’ll help harness our collective power and articulate our distinctive voices, as we create a shared vision of the legacy we want to leave at Penn. Serving y’all in the UA has been a great privilege and responsibility and I’m eager to continue helping make Penn a place we're proud to call home.",
            "instagram handle": "jonahschenk4ua",
            "image": {
                "src": "../../../images/2020/NEC/jonah-schenk.jpeg"
            },
            "image name": "jonah-schenk.jpeg",
            "youtube video url": "https://youtu.be/WdCU2l9pz-0"
        },
        {
            "platform points": [
                "Continued work with SRFS to spearhead the Financial Wellness initiative to increase financial literacy and resources for Penn undergraduates.",
                "Sustained efforts to increase academic transparency, pushing for a full syllabus database across all undergraduate schools as a guide and resource.",
                "Pushing for more resources for mis- and underrepresented minorities on campus in the form of budget reallocations and new resource centers.",
                "Reconfigure relationships with organizations like CURF and Penn Abroad to increase equitable and widespread access to opportunities across the student body. ",
                "Increased accountability on behalf of the UA as a governing body to Penn students through the form of “office hours” or newsletter blasts.",
                "Improved transparency between Penn administration and the study body to establish a renewed compact of trust and legitimacy."
            ],
            "name": "Ryan Bush",
            "introduction": "Hi everyone! My name is Ryan, and I am running for reelection to the UA as your College Representative! I hope to continue the work I’ve been doing to fight for change on campus, specifically through financial, academic, and equity-based means. I also want to continue to break down barriers between Penn students and create more sustainable dialogue with Penn administration to ensure our concerns are being acknowledged and addressed. Finally, I aspire to continue making significant and lasting contributions to the larger Penn community to shape the future of the University. I’d love your support to accomplish these goals!",
            "facebook url": "https://www.facebook.com/Ryan-Bush-For-UA-College-Rep-357997651480361",
            "instagram handle": "ryanbush22",
            "image": {
                "src": "../../../images/2020/NEC/ryan-bush.jpeg"
            },
            "image name": "ryan-bush.jpeg",
            "youtube video url": "https://youtu.be/R6x8JmSOJyQ"
        },
        {
            "platform points": [
                "Fostering community through innovative virtual events throughout the year.",
                "Committing to making Class Board and UA place a larger focus on diversity, equity, and inclusion efforts not only at Penn, but beyond.",
                "Developing means to transition the student experience into a virtual experience to allow us to safely maximize our college experience amid the pandemic."
            ],
            "name": "Jonathan Scotto",
            "introduction": "My name is Jonathan Scotto (he/him) and I am a proud member of the C’22. \n \nTowards the end of my term freshman year, I decided that I needed to hit reset and take a step back from PSG. Penn can challenge us not only academically, but emotionally and physically. I even wrote an article about it...!  However, during my second year, I strongly missed the opportunity to impact the Penn community at large. That being said, I have excitedly decided to seek out the chance to run for PSG. Please feel free to reach out if you have anything you want to talk about!",
            "facebook url": "https://www.facebook.com/jmscotto7",
            "instagram handle": "scottojon",
            "image": {
                "src": "../../../images/2020/NEC/jonathan-scotto.jpeg"
            },
            "image name": "jonathan-scotto.jpeg"
        },
        {
            "platform points": [
                "CAS specific online tutoring services",
                "Online Pre-Med/Pre-Law opportunities",
                "Facilitating local Internships and jobs for students staying home ",
                "Remote Work/Volunteer/Research Opportunities "
            ],
            "name": "Makaeel Sheikh",
            "introduction": "My fellow classmates, friends, and family here at the University of Pennsylvania, we’re living in an unprecedented time and that’s no secret. I’m sure none of us expected our very short time at Penn to take place in the midst of a global pandemic, social unrest, and disunity. I wish to be a representative of the College of Arts and Sciences because I firmly believe that as students in the world today, we have a responsibility to be role models and agents of change like never before. With the CAS encompassing students of a wide variety of study and thought, it is up to us to be inclusive and understand ideas from various perspectives. Although our first year at Penn did not go as we planned, it does not mean that we cannot adapt and overcome the challenges we may face in the future, and I would appreciate the opportunity to represent the student body of the CAS as we do. ",
            "facebook url": "https://www.facebook.com/makaeel.sheikh",
            "instagram handle": "mikeysheikh",
            "image": {
                "src": "../../../images/2020/NEC/makaeel-sheikh.jpeg"
            },
            "image name": "makaeel-sheikh.jpeg"
        },
        {
            "platform points": [],
            "name": "Regan Mizrahi",
            "introduction": "Hi everyone, my name is Regan Mizrahi and I’m excited to be running for the UA again this Fall! I’ve been on the UA since my freshman year and I’ve really enjoyed the opportunity to advocate for diverse student initiatives throughout my time at Penn. From lobbying for a reformed first-year advising system or inclusive living and housing communities on campus, I would love the chance to continue doing what I’m passionate about while pushing for initiatives that you are passionate about as well. If you have any suggestions then I’d love to hear them at rmizrahi@sas.upenn.edu! :D ",
            "image": {
                "src": "../../../images/2020/NEC/regan-mizrahi.jpeg"
            },
            "image name": "regan-mizrahi.jpeg"
        },
        {
            "platform points": [
                "Continue working to create new ways to facilitate friendship-making for new students via groups and events.",
                "Ensuring that students have access to drinkable water on campus, including the Pottruck Fitness Center.",
                "Continue to work on initiatives that allow students to easily identify volunteer opportunities in the surrounding Philadelphia community.",
                "Continue to work on initiatives that foster school spirit, like subsidizing Football and Basketball games to increase audience turnout.",
                "Continue to work on initiatives that improve the Penn Dining experience, including holding Penn accountable for the food quality and health standards.",
                "Continue to work on initiatives that reduce the cost of Penn Dining as a whole, and especially for financially-aided students."
            ],
            "name": "Alfredo Wolfermann",
            "introduction": "Hey Penn! My name is Alfredo Wolfermann and I am a second year student from Miami, Florida. I was born in Caracas, Venezuela and came to the United States when I was 10 years old. Getting integrated with a new culture and language was challenging at first, but I had many people who helped me along the way. Being one of these people for others in challenging situations was my main focus while I served on the Undergraduate Assembly's 47th Session last year. I hope that I can continue to work on initiatives that allow the student body, especially freshmen, to more easily make new friends and find groups this school year!"
        },
        {
            "platform points": [
                "COVID Testing: Penn should extent Student COVID-19 Testing throughout the entire year in order to ensure the safety of our students.",
                "Funding the Black Community at Penn. I want to call on the University administration to annually allocate more substantial funds to support the Black community!",
                "Accommodating for FGLI/International Students. I want to help create more fair opportunities for these students through increasing refund checks or making professors more accommodating with synchronous class times/assignments."
            ],
            "name": "Thomas Kyong",
            "introduction": "Hey friends! My name is Thomas Kyong, and I am a sophomore re-running for a College Representative Seat in the Undergraduate Assembly.",
            "instagram handle": "mrkyong",
            "youtube video url": "https://www.youtube.com/watch?v=3jPRoMsXVVA",
            "image": {
                "src": "../../../images/2020/NEC/thomas-kyong.jpeg"
            }
        }
    ],
    "Undergraduate Assembly President": [
        {
            "platform points": [
                "Uncompromising Activism: For mis- and underrepresented minorities, sexual assault victims, FGLI, LGBTQ+ students. No longer making demands palatable! We won’t hesitate to bring up difficult topics and push for change.",
                "Effective Representation: We will always prioritize student voices, rather than push our own agenda. We will actively solicit feedback in order to champion the causes that you care about.",
                "Improved Campus Climate: Redefine what wellness means in our current moment. We’ll work to ensure that Penn embraces everyone regardless of race, citizenship, religion, socioeconomic status, sexual orientation, or gender identity.",
                "Increased Collaboration: We plan to work closely with student groups, continually uplifting their efforts to administration. As true liaisons, we will never co-opt existing movements or attempt to take credit.",
                "Total Accountability: Holding Penn accountable to students, the West Philadelphia community, and the environment. We’ll hold students accountable to each other and hold the UA accountable to the student body. "
            ],
            "name": "Mercedes Owens",
            "introduction": "Since my first semester at Penn, I’ve been committed to advocating for the student body. As UA President, I aim to elevate your voice to create a Penn we all can be proud of. Combining effective representation, uncompromising activism, and total accountability, my joint platform strives to create the supportive and accountable Penn community that you deserve. We intend to leverage the momentum created by the BLM movement and pandemic to transform discussions into actions for administration. Having been a New Student Representative and Secretary, I believe I have the experience necessary to achieve the goals stated in my platform!",
            "facebook url": "https://www.facebook.com/MMforUA",
            "instagram handle": "m_owens9",
            "image": {
                "src": "../../../images/2020/NEC/mercedes-owens.jpeg"
            },
            "image name": "mercedes-owens.jpeg",
            "youtube video url": "https://youtu.be/9P5li7mZy0w"
        }
    ],
    "Undergraduate Assembly VP": [
        {
            "platform points": [
                "Uncompromising Activism: For mis- and underrepresented minorities, sexual assault victims, FGLI, LGBTQ+ students. No longer making demands palatable! We won’t hesitate to bring up difficult topics and push for change.",
                "Effective Representation: We will always prioritize student voices, rather than push our own agenda. We will actively solicit feedback in order to champion the causes that you care about.",
                "Improved Campus Climate: Redefine what wellness means in our current moment. We’ll work to ensure that Penn embraces everyone regardless of race, citizenship, religion, socioeconomic status, sexual orientation, or gender identity.",
                "Increased Collaboration: We plan to work closely with student groups, continually uplifting their efforts to administration. As true liaisons, we will never co-opt existing movements or attempt to take credit.",
                "Total Accountability: Holding Penn accountable to students, the West Philadelphia community, and the environment. We’ll hold students accountable to each other and hold the UA accountable to the student body. "
            ],
            "name": "Mary Sadallah",
            "introduction": "For two years on the UA, I’ve advocated for FGLI and LGBTQ+ students, as well as students of color. I’m proud to have expanded CAPS’ Let’s Talk program and secured a $250,000 donation to Black programming. As Vice President, I’ll never worry about making demands to administration palatable. I’ll work closely with student groups and actively solicit feedback to foster a campus that promotes wellness and embraces students of all identities. I’ll also strive to hold Penn accountable to its students, the West Philadelphia community, and the planet. Vote Mercedes and Mary, for a Penn you can be proud of!",
            "facebook url": "https://www.facebook.com/MMforUA",
            "instagram handle": "mmsadallah",
            "image": {
                "src": "../../../images/2020/NEC/mary-sadallah.jpeg"
            },
            "image name": "mary-sadallah.jpeg",
            "youtube video url": "https://youtu.be/WoxRT4Syq44"
        }
    ]
}