{
  "President": [
    {
      "name": "Lizzie Youshaei",
      "statement": "What a year we’ve had, ‘21. We fell forward together and did it big. Last spring, my platform was centered around the idea of failure and bouncing back. It was about believing in our passions and ourselves. You are the reason I ran again, so thank you for making my Penn experience everyday. Thank you for attending one (or many) of the 20+  events we had this year. Thank you for showing up to Merch Madness in record breaking numbers. Thank you for turning this class into a family through Sophomore Spotlights and Blind Brunches. Thank you for being the most spirited class and rocking 900+ quarter zips around campus. But more than anything, thank you for your hellos on Locust, smiles at events, and feedback in emails. Nothing makes me happier than giving back to a class that has given me so much: family, endless laughter, deep conversations, and memories to last a lifetime. I can’t wait for what’s to come. With Hey Day and P Sweaters season is upon us, we are just getting started. Sending all my love to each of you (yes, all 2,500). Thank you for the most incredible year.",
      "endorsements": "",
      "image": {
        "src": "../../../images/2019/NEC/lizzie.jpeg"
      }
    }
  ],
  "Executive Vice President": [
    {
      "name": "Anthony Scarpone-Lambert",
      "statement": "It is pretty crazy that we are about to be Upperclassmen. I literally feel like NSO just ended… and now we are about to be Juniors.<br><br>With this major milestone on the horizon, I’m super excited to be running for Class Board 2021 Executive Vice President. This campaign has been inspired by the incredible community and family that Penn has provided me throughout the past two years. My goal for the Class of 2021 is to enter Junior year with the most pride and spirit possible!! I plan to do this in three steps:<br><br>1st: Energy - I want to be a fresh source of energy that pushes us to become the most extra and spirited class possible!!<br><br>2nd: Voice - I want to be the strong voice that represents the diverse student body that makes up our class.<br><br>3rd: Plan - I want Class Board to plan tangible events and programing to inspire us to be a tight-knit, energized community.<br><br>With that being said, I promise to be there for the Class of 2021. I promise to be the energized, enthusiastic, and compassionate leader that I aspire to everyday. Thank you!<br><br>-Anthony S-L N’21<br>antsl@nursing.upenn.edu",
      "endorsements": "Student Nurses at Penn (SNAP), Penn Club Gymnastics, Alpha Kappa Psi, Strictly Funk, Wharton Alliance",
      "image": {
        "src": "../../../images/2019/NEC/anthony.jpeg"
      }
    },
    {
      "name": "Maher Abdel Samad",
      "statement": "For the last two years, I’ve put my heart, soul and bones into making the 2021 experience the best it can be through Class Board. People who know me describe me as immensely passionate and hard working. You can see from my track record that I am committed to implementing my platform and making sure everyone has access to a great Penn experience regardless of who they are or where they come from.<br><br>For the last two years, I’ve been pushing the boundaries of what Class Board can do for all of us students, and what’s coming is even greater.<br><br>My platform is simple: it consists of the three interconnected ideas of Inclusion, Expansion, and Collaboration. I’ve delivered on that platform in every way I could: I’ve pushed to subsidize 100% of Quarter zips and costs for Class Board events for all students requesting financial aid. Moreover, I’ve been an integral part of planning the Sophomore experience, from Sophomore week, to larger events like Holi.<br><br> Finally, I’ve worked to increase Class Board’s collaboration with different business in Philly to provide us with amazing events: United by Blue, Federal Donuts, Hummus Grill, Zahav and many more for our restaurant Crawls, Blind Brunches, and Coffee House events.",
      "endorsements": "Penn Arab Student Society, Penn Undergraduate Law Journal, Assembly of International Students, South Asia Society",
      "image": {
        "src": "../../../images/2019/NEC/maher.jpeg"
      }
    }
  ],
  "Vice President of Internal Affairs": [
    {
      "name": "Seung (Sophia) Kim",
      "statement": "Hi! My name is Sophia Kim. Most people call me Skim. But you can still call- and vote for- me tonight (continuing to MILK the pick-up line).<br><br>I’m so excited to be RE-RUNNING as your Class Board 2021 Vice President of Internal Affairs! Through sophomore slumps and bumps, our class was slapped with the non-freshman reality of Penn— OCR, difficulty meeting new people, and no more late-night Hill. Although these obstacles were tiresome, I truly admired the support system of our class during this time.<br><br>As a fellow student, I’m not sure school gets easier. However, as your VP of Internal Affairs, Class Board is here to help as much as possible. Our class was the first to work with Penn administration for the Sophomore Year Experience, where I, along with other board members, garnered campus resources and events promoting self-care and community. With bigger projects along the way (did someone say P-sweaters?), I’m excited to build upon my organization and managing skills to put forth the best memories for your junior year.<br><br>We’re halfway there and the Class of 2021 is feeling it! Feel free to reach out and follow my Facebook page to track my platform. #SKIMbutwholesome...roundHALFandHALF",
      "endorsements": "",
      "image": {
        "src": "../../../images/2019/NEC/sophia.jpeg"
      }
    }
  ],
  "Vice President of External Affairs": [
    {
      "name": "Julie Chen",
      "statement": "halfway through college?!<br>i'll make the next two so fun<br>pls vote chen for penn :)",
      "endorsements": "",
      "image": {
        "src": "../../../images/2019/NEC/julie.jpeg"
      }
    }
  ],
  "Vice President of Finance": [
    {
      "name": "Joey Abdo",
      "statement": "Hey Class of 2021!<br><br>My name is Joey Abdo and I’m happy to announce I am rerunning to be your VP of Finance again. As a first generation, low income student, I’ve found it hard at times to find my way in the world: My platform is to make events accessible to every single student in our class. What’s the biggest challenge to this dream? Money! I’m running for VP of finance to bring a new unique perspective to a job. Accessibility, that what my platform stands for. With me as VP, everyone will be on the same financial playing ground when it comes to Penn and class events. Not only do I represent FGLI students but also all of you international mates out there. As a holder of a dual citizenship between the United States and Lebanon you can trust that I have a variety of perspectives on the world and people. Over the year, my board and I successfully implemented a range of financial aid options for items from the harry potter shirts to the quarter zips in which we asked for ability to pay and accommodated 100% of the time to the numbers the students reported they were able to pay. I look forward to continue my work as your VPF and make our junior year one to remember! From Hey Day to numerous giveaways, I promise you that I will continue to give my best effort in helping unite our class while giving out amazing restaurant event deals and free loveable items.",
      "endorsements": "",
      "image": {
        "src": "../../../images/2019/NEC/joey.jpeg"
      }
    }
  ],
  "College Chair": [
    {
      "name": "Charles Curtis-Thomas Jr.",
      "statement": "Hello everyone! My name is Charles, (or CCT) and I am running for re-election for College Chair on Class Board. Just like when I ran for College Chair last year, I am still committed to making an impact on campus. Over the last few months, I’ve grown as a person, and I’ve truly had a chance to understand what problems need to be tackled on campus. This growth has come from creating amazing events for our class, and planning events that will shape the narrative of our class into the future. The work that I do on Class Board is very valuable to me, and I want to continue to commit all my passion to making this class amazing. I’ve already met many of you, and I intend to meet many more of you over the next few days as the campaigning and voting begins and beyond. It’s time for The College to continue our unification. Time for us to continue working together to find our voice, our vision, and our passion. I hope you will all join me on this journey. And trust me, while I’m on Class Board, the class WON’T be bored. Let’s do this!",
      "endorsements": "",
      "image": {
        "src": "../../../images/2019/NEC/charles.jpeg"
      }
    },
    {
      "name": "Daniel Gordon",
      "statement": "Hello Class of 2021! It has been my absolute pleasure to be your College Chair for the past two years. On Class Board, I have pioneered new events such as Sophomore Week and our upcoming special tradition on April 30th (hype!). For our Junior year, I plan to expand the existing traditions and continue our successful apparel distributions. In addition, I hope to continue to grow partnerships with the administration to create new large-scale events for the Class of 2021. If you have any suggestions/ideas, I would love to hear from you at dagord@sas.upenn.edu. I’m excited to share another wonderful year with you all!",
      "endorsements": "Phi Chi Theta",
      "image": {
        "src": "../../../images/2019/NEC/daniel-gordon.jpeg"
      }
    }
  ],
  "Engineering Chair": [
    {
      "name": "Alexa Spagnola",
      "statement": "My name is Alexa, and I’ve had the honor of serving as your Engineering Chair for the past two years.  Heading into the second half of our college experience, I will ensure that Class Board provides engineers with the “TLC” we deserve:<br><br>T ー take time for yourself.  Engineering is overwhelming to say the least.  By incorporating unique, original events such as the Coffeehouse at UBB and the City Tap hangout, we’ve provided space and time to step back from an intense workload and enjoy yourself.<br><br>L ー leave your mark on Penn.  By taking part in the traditions that unify our class, whether it be as simple as repping your class quarterzip (and soon, your “P” sweater) or by marching across campus in the 1st annual “Hey Day for sophomores,” aka U-Night, Class Board’s role is to bring us all together.<br>And lastly, <br>C ー connect with people you might not normally have the chance to.  By implementing wildly popular events such as Blind Brunches, Sophomore Supper, and Friendsgiving, we’ve made it a priority to give you incentive to cross 34th Street … especially as upperclassmen, when it becomes more difficult to organically make new friends.<br><br>Thank you!",
      "endorsements": "",
      "image": {
        "src": "../../../images/2019/NEC/alexa.jpeg"
      }
    }
  ],
  "Wharton Chair": [
    {
      "name": "Jay Mudholkar",
      "statement": "Class board has been one of the formative experiences of my college experience for the past couple years. From planning Econ Scream freshman year to Blind Brunches last Sunday, all of the events have been a great way to meet amazing people.",
      "endorsements": "",
      "image": {
        "src": "../../../images/2019/NEC/jay.jpeg"
      }
    }
  ],
  "Nursing Chair": [
    {
      "name": "Tommy Seaman",
      "statement": "Hey everyone! My name is Tommy Seaman and I have had the pleasure as serving as the Nursing Chair for Class Board 2021 for almost two years now. Throughout this time, I have worked with Class Board 2021, other class boards, and numerous student groups to plan events for the Class of 2021 and specifically the nursing class. Events such as blind brunches and merch madness have brought the hardworking nursing class closer to the other schools on campus. As the Nursing Chair for the Class of 2021, I will make sure that the small yet mighty nursing class has a voice on campus. I hope to continue planning class board events for the next two years that emphasize inclusivity and connection. I will assist the nursing class in establishing an influential presence on campus and within the student body. I plan to serve Penn in the best way possible, and I hope to have your vote!",
      "endorsements": "",
      "image": {
        "src": "../../../images/2019/NEC/tommy.jpeg"
      }
    }
  ]
}
