{
  "UA President": [
    {
      "name": "Maria Curry",
      "statement": "Real change isn't achieved overnight, but there are concrete steps to get there. Throughout my past 3 years on the UA, I have shown that this tangible change is possible not just with passion, but with the correct ambition and determination to see it through. As UA President, I want to continue to challenge the status quo and challenge our members to support you, the student body, at a new level.<br><br>My joint-platform is based on 5 Pillars: Transparency, Equity & Representation, Sustainability, Wellness, and Modern Infrastructure. An overarching theme is student engagement, and as President I want to continue to build on forums like UA Steering, town halls and focus groups, to enhance collaboration among student leaders, and move from discussions to tangible actions items with administration.<br><br>Our record shows this works. From directly working with administrators on the creation of the new PennTransit-App that allows students to request transportation on and off-campus for free, to personally creating 360°-Views of Campus Dorms for Campus-Express, to implementing new signage in all Dining Halls on sustainable food disposal, and developing mindfulness-spaces in centralized locations like Houston Hall, I will continue to lead the UA to tangible change for you as UA President.",
      "endorsements": "Black Student League, Penn Model Congress, Fossil Free Penn, Penn Democrats, Student Sustainability Association at Penn, Penn Vegan Society, University of Pennsylvania Beekeeping Club, Climate Reality Project at Penn, Penn Eco-Reps, Penn Sustainability Undergraduate Advisory Board, Penn Environmental Group (PEG), Penn Vegan Society (PVS), Black Wharton Undergraduate Association, Earth and Environmental Science Undergraduate Advisory Board",
      "image": {
        "src": "../../../images/2019/NEC/maria-curry.jpeg"
      }
    },
    {
      "name": "Natasha Menon",
      "statement": "Hi, my name is Natasha Menon, and I am running for President of the Undergraduate Assembly. If elected, my priorities next year would be transparency, inclusivity, accessibility, wellness, and academics. These platform ideas, as well as other information about my campaign can be found at menongoldstein.com! As the candidate with the most UA experience, I have been able to foster the relationships with administrators and student groups necessary to ensure the execution of my platform. With your help in electing me as UA President, I will use this knowledge to advocate for the policies that will make Penn a better school not just for our class, but for generations to come!",
      "endorsements": "Penn Undergraduate Health Council, United Minorities Council, South Asia Society, Asian Pacific Student Coalition, Penn Association for Gender Equity, Student Athlete Advisory Committee, Radical South Asian Collective, Assembly of International Students",
      "image": {
        "src": "../../../images/2019/NEC/natasha-menon.jpeg"
      }
    }
  ],
  "UA Vice President": [
    {
      "name": "Chase Serota",
      "statement": "My name is Chase Serota and I’m running for Vice President of the Undergraduate Assembly to create tangible change on campus and put student opinion at the forefront of administrator decisions. My joint-platform is based on 5 Pillars: Transparency, Equity & Representation, Sustainability, Wellness & Student Life, and Modern Infrastructure. Just within the past year, my record of both experience and impact proves how I will continue to follow through on projects that directly benefit students.<br><br>For example, beginning in January of this year, I personally directed the renovation of the basement of Van Pelt that will take place this summer in coordination with Penn Facilities and other UA members. Additionally, I’ve worked directly with CAPS, the Provost’s Office, and Penn’s Chief Wellness Officer to develop plans for a pilot program for a CAPS satellite office within Van Pelt Library that’s accessible to all students, regardless of school. Moreover, I have enjoyed promoting student focus groups with high-level administrators like those regarding the new Sophomore Experience or the replacement of Frontera to ensure that the student opinion is always represented. This is how we make the UA work for you—join us and vote Curry and Serota for UA President and VP.",
      "endorsements": "Penn Model Congress, Fossil Free Penn, Penn Democrats, Student Sustainability Association at Penn, Penn Vegan Society, University of Pennsylvania Beekeeping Club, Climate Reality Project at Penn, Penn Eco-Reps, Penn Sustainability Undergraduate Advisory Board, Penn Environmental Group (PEG), Penn Vegan Society (PVS), Earth and Environmental Science Undergraduate Advisory Board",
      "image": {
        "src": "../../../images/2019/NEC/chase-serota.jpeg"
      }
    },
    {
      "name": "Brian Goldstein",
      "statement": "Hi, my name is Brian Goldstein, and I am running for Vice President of the Undergraduate Assembly. If elected, my priorities next year would be transparency, inclusivity, accessibility, wellness, and academics. As Vice President I would look forward to collaborating with UA Steering groups to promote our common goals and initiatives. As the candidate with the most UA experience I look forward to utilizing the relationships that I have developed with administrators to affect tangible change. I will dedicate myself to both the Undergraduate Assembly and the student body in order to ensure that your priorities and concerns are heard.",
      "endorsements": "Penn Undergraduate Health Council, South Asia Society, Asian Pacific Student Coalition, Student Athlete Advisory Committee, Assembly of International Students",
      "image": {
        "src": "../../../images/2019/NEC/brian.jpeg"
      }
    }
  ],
  "SAS Representative": [
    {
      "name": "Chase Serota",
      "statement": "My name is Chase Serota and I’m running for Vice President of the Undergraduate Assembly to create tangible change on campus and put student opinion at the forefront of administrator decisions. My joint-platform is based on 5 Pillars: Transparency, Equity & Representation, Sustainability, Wellness & Student Life, and Modern Infrastructure. Just within the past year, my record of both experience and impact proves how I will continue to follow through on projects that directly benefit students.<br><br>For example, beginning in January of this year, I personally directed the renovation of the basement of Van Pelt that will take place this summer in coordination with Penn Facilities and other UA members. Additionally, I’ve worked directly with CAPS, the Provost’s Office, and Penn’s Chief Wellness Officer to develop plans for a pilot program for a CAPS satellite office within Van Pelt Library that’s accessible to all students, regardless of school. Moreover, I have enjoyed promoting student focus groups with high-level administrators like those regarding the new Sophomore Experience or the replacement of Frontera to ensure that the student opinion is always represented. This is how we make the UA work for you—join us and vote Curry and Serota for UA President and VP.",
      "endorsements": "Penn Model Congress, Fossil Free Penn, Penn Democrats, Student Sustainability Association at Penn, Penn Vegan Society, University of Pennsylvania Beekeeping Club, Climate Reality Project at Penn, Penn Eco-Reps, Penn Sustainability Undergraduate Advisory Board, Penn Environmental Group (PEG), Penn Vegan Society (PVS), Earth and Environmental Science Undergraduate Advisory Board",
      "image": {
        "src": "../../../images/2019/NEC/chase-serota.jpeg"
      }
    },
    {
      "name": "Daniel Ruiz de la Concha",
      "statement": "Hello everyone! My name is Daniel Ruiz de la Concha, and I am running for Class Board 2022 President and Representative of the College of Arts and Sciences for the Undergraduate Assembly. I have always been passionate about helping others and organizing events, which is something I look to be able to pursue during my time in Penn. If elected I would love to host multiple events to integrate the Penn community further and make sure that everyone makes the most of their time here! I know that moving into the next year can be an exciting yet frightening experience for everyone. Therefore, I want to make sure that you have access to as most opportunities as you can while getting to meet new people that you will remember for life! I wish you the best in the year to come!",
      "endorsements": "",
      "image": {
        "src": "../../../images/2019/NEC/daniel-ruiz.jpeg"
      }
    },
    {
      "name": "Arjun Swaminathan",
      "statement": "Hi everyone! I’m Arjun Swaminathan and I’m running to be re–elected to UA as one of your College representatives. As a member of the UA these past two years, I have been responsible for a number of dining, housing, and transit projects that have provided benefits to students on campus, ranging from the development and rollout of the new ride–sharing application for students (Penn Rides on Request), to creating a proper recreation space in Houston Hall, to advertising dining options for students with dietary restrictions, to advocating for mental health awareness on campus. Additionally, I have served as a member of the UA’s Budget Committee as well as its Speaker Pro Tempore, wherein I have contributed to a fair budgeting process for student government and served as the deputy to the UA’s internal chair, respectively. In running for reelection, I would like to continue working on similar projects and contribute to making Penn’s community a better place, and I believe that I have proven myself capable of doing that these past two years. Thanks for reading and vote for Arjun!",
      "endorsements": "UMOJA",
      "image": {
        "src": "../../../images/2019/NEC/arjun-swam.jpeg"
      }
    },
    {
      "name": "Kevin Zhou",
      "statement": "Hi! My name is Kevin Zhou, and I am running for your UA College Representative. Having served on the UA in the last two years, I have involved myself in many important issues on campus related to access and equity for minority students, academic accommodations, mental health resources, and more. As the chair of the United Minorities Council, I led the effort in increasing funding for all cultural groups by securing a $6000 annual allocation for 6B as well as the push for the expansion of minority spaces on campus beyond the basement of Arch. I am also pursuing the creation of a University-wide policy mandating professors to give students make-up midterms in case of legitimate absences due to illness, family emergency, religious reasons, or other unexpected events. The embedded CAPS model I championed for freshmen year is also currently expanding across campus, piloted by Wharton but spreading to other schools as well. All of my initiatives focus on hearing all voices on campus, understanding diverse student needs, and creating tangible changes in response. It is the responsibility of the UA to ensure all students are having the best Penn experiences possible, and to that I say “Yes We Kev”.",
      "endorsements": "",
      "image": {
        "src": "../../../images/2019/NEC/kevin-zhou.jpeg"
      }
    },
    {
      "name": "Armaun Rouhi",
      "statement": "My name is Armaun Rouhi and I’m a sophomore running for College Representative on the Undergraduate Assembly. Penn has one of the best hospitals and healthcare systems in the country, but what we lack is an equally exemplary student health. I’m running on a platform of improving student health – that means tackling rampant loneliness on campus as a significant contributor to poor mental health, providing access to menstrual care products, and introducing long term therapy at CAPS rather than outsourcing students to center city.<br><br>As an Associate Member on the UA since my freshman year, I've collaborated with Student Health Services to promote flu clinics and improve medical transport options through PennTransit. I've also worked with countless building managers to provide tampon disposal containers in all women’s restrooms – to date, I’ve gotten new disposal containers into 1920 Commons, Fisher Fine Arts, and ARCH. Additionally, I’m helping lead efforts to renovate Van Pelt and bring new furniture, tutoring spaces, carpeting, and lighting to the ground floor, and I’m happy to see my proposed renovations be completed this summer.<br><br>There is still much to do to make Penn a model for student health. With your support in this election, we’ll get there.",
      "endorsements": "",
      "image": {
        "src": "../../../images/2019/NEC/armaun-rouhi.jpeg"
      }
    },
    {
      "name": "Carmen Duran",
      "statement": "I'm running for re-election to the Undergraduate Assembly to continue making provisions and paving the way for a more equitable and inclusive experience for all Penn undergraduates. This past year I sat on the Equity and Inclusion Committee working on finding ways to help subsidize medical expenses for students, and I also served as the Legal Services Coordinator helping coordinate legal consultations for both Penn graduates and undergraduates. I'm looking forward to building upon this work throughout the rest of my time with the UA and am eager to continue lobbying administration for changes we need and deserve as a student body.",
      "endorsements": "",
      "image": {
        "src": "../../../images/2019/NEC/carmen-duran.jpeg"
      }
    },
    {
      "name": "Elena Hoffman",
      "statement": "<i>No provided statement.</i>",
      "endorsements": "",
      "image": {
        "src": "../../../images/2019/NEC/elena-hoffman.jpeg"
      }
    },
    {
      "name": "Jennifer Richards",
      "statement": "Hi everyone! I’m Jennifer Richards and I am running for re-election for UA College Representative! Having served the last two years on the Academic Initiatives committee, I hope to continue creating tangible change and facilitating transparency with the student body.<br><br>The past two years I’ve been a champion for mental health within the UA and the Penn community. For example, I recently secured funding from alumni to hire a CAPS clinician in the athletic fields. This is the first of many embedded CAPS clinicians I hope to install during my time at Penn.<br><br>My platform consists of eight key issues:<br>1. Destigmatizing mental health<br>2. Improving access to mental health resources<br>3. Reforming course absence policies<br>4. Supporting academic needs<br>5. Promoting mental wellness in Greek life and the rush process<br>6. Revamping advising programs<br>7. Enhancing the club recruitment process<br>8. Advocating for the needs of student-athletes<br><br>But more than anything, I want to advocate for YOUR needs and listen to YOUR voice. Please feel free to reach out to me at rjenny@sas.upenn.edu. Serving on the UA has been one of the most rewarding experiences and I would really love your vote. #JENNforPENN",
      "endorsements": "UMOJA",
      "image": {
        "src": "../../../images/2019/NEC/jennifer-richards.jpeg"
      }
    },
    {
      "name": "Joseph Squillaro",
      "statement": "An advocate for change, I want to be one of your College representatives in the Penn Undergraduate Assembly to make YOUR voice loud and clear. Through experience and determination, I will listen and fight for what matters to you. The University of Pennsylvania is an amazing place, but it can be better and I want to help us get it there.<br><br>Here are just a few of the many things I hope to fix:<br><br>1. Increase per capita spending on each student in the College to make us on par with those students in Wharton and Engineering.<br><br>2. Allot funding for mental health services and create new wellness initiatives at Penn because something like “Penn Face” should be a thing of the past.<br><br>3. Fight hard for the creation of more College-based career services to link the humanities and the natural sciences to the outside world.<br><br>Among many, many other initiatives that I can’t fit in 200 words! If you agree with this platform and want to see more, be sure to vote Joseph Squillaro in this upcoming election and feel free to reach out to me at jsqu@sas.upenn.edu for any questions!",
      "endorsements": "Penn Undergraduate Law Journal",
      "image": {
        "src": "../../../images/2019/NEC/joseph-squillaro.jpeg"
      }
    },
    {
      "name": "Jude Dartey",
      "statement": "My platform is very simple. I want to serve as the bridge between minority/underprivileged students and administrators on campus. This year I was very privileged to serve as the Director for the Committee on Equity and Inclusion where I led 11 other members of the UA to work on initiatives that improves the experience of underrepresented students. I am not perfect and in no way make empty promises to change the entire culture at Penn, but a vote for Jude Dartey is a step closer to Penn where everyone feels like Penn is home.",
      "endorsements": "Black Student League",
      "image": {
        "src": "../../../images/2019/NEC/jude-dartey.jpeg"
      }
    },
    {
      "name": "Kristen Ukeomah",
      "statement": "I have served on the Undergraduate Assembly for the past two years. On it, I have served on the Social Justice (SJ) and Equity and Inclusion (EI) committees, working on projects that advocate for students of color, low-income students, and students with disabilities across campus. As I run this third time, I plan on continuing this work. However, it has come to my attention that the majority of the student body does not actually know what the UA does and what we work on. The UA is seen as an organization that is more concerned about airport shuttle sales than the advocacy of the student body. I want to ensure that the student body knows that is false with periodical publications of the UA's projects roughly 4 times a school year and by widely disseminating a UA feedback form, so students know that the UA actually works for them. Moreover, I would like to advocate for all students to have equal access at Penn, which is not the case. Wharton students have more University privileges that College students and that is not equitable. I plan to advocate for equality across schools.",
      "endorsements": "Black Student League, UMOJA",
      "image": {
        "src": "../../../images/2019/NEC/kristen-ukeomah.jpeg"
      }
    },
    {
      "name": "Mary Sadallah",
      "statement": "Hi! My name is Mary Sadallah and I’m an Economics major from South Jersey. For the past year, I’ve been fortunate enough to serve as an Associate Member on the Undergraduate Assembly. My chief focus has been to integrate wellness into university life (mainly through the expansion of the Embedded CAPS Model that has been implemented in Wharton) because at Penn, we tend to see ourselves as students first and people second. To combat this culture, I believe that wellness must be tailored to us and made equally accessible. The UA has also afforded me the opportunity to advocate for members of underrepresented groups on campus. I’ve worked alongside the Cultural Resource Centers to plan programming that celebrates student diversity and engineered solutions to challenges faced by the FGLI community. Most importantly, I’ve worked to realize that my voice, as that of a minority and FGLI student, demands to be heard. A vote for Mary is a vote that carries the weight of making all-inclusive change. I sincerely hope that I can continue to offer my unique perspective and experience to the Undergraduate Assembly as a Representative of the School of Arts & Sciences. Vote Mary Sadallah for UA SAS Rep!",
      "endorsements": "Penn Undergraduate Law Journal, UMOJA",
      "image": {
        "src": "../../../images/2019/NEC/mary-sadallah.jpeg"
      }
    },
    {
      "name": "Mikayla Golub",
      "statement": "Hey, there! My name is Mikayla Golub, and I’m running for College Representative on the Undergraduate Assembly. This past term, I served on the Sustainability and Community Impact committee. This upcoming year, I hope to continue my work on rethinking sustainability in dining facilities, expanding composting programs, increasing student art around campus, and improving advising for students in specific programs. These projects, though touch on various sectors of student life on campus, all identify critical areas of growth for Penn. This past term, I have learned the importance of collaborating with students and administrators to work on effective, comprehensive change; I plan on doing the same this upcoming term. In addition to serving on the Undergraduate Assembly, I’m involved in Bloomers (Penn’s all-female comedy troupe), Mock Trial, and Sigma Kappa. Please reach out if you have any questions about the projects mentioned above as well as any ideas on how to make our campus better! I’m on Facebook like most youths, so feel free to message me there.",
      "endorsements": "Fossil Free Penn, Penn Mock Trial",
      "image": {
        "src": "../../../images/2019/NEC/mikayla.jpeg"
      }
    },
    {
      "name": "Natasha Menon",
      "statement": "Hi, my name is Natasha Menon, and I am running for President of the Undergraduate Assembly. If elected, my priorities next year would be transparency, inclusivity, accessibility, wellness, and academics. These platform ideas, as well as other information about my campaign can be found at menongoldstein.com! As the candidate with the most UA experience, I have been able to foster the relationships with administrators and student groups necessary to ensure the execution of my platform. With your help in electing me as UA President, I will use this knowledge to advocate for the policies that will make Penn a better school not just for our class, but for generations to come!",
      "endorsements": "Penn Undergraduate Health Council, United Minorities Council, South Asia Society, Asian Pacific Student Coalition, Penn Association for Gender Equity, Student Athlete Advisory Committee, Radical South Asian Collective, Assembly of International Students",
      "image": {
        "src": "../../../images/2019/NEC/natasha-menon.jpeg"
      }
    },
    {
      "name": "Ozi Amuzie",
      "statement": "At Penn, we are champions of diversity. We’re the sort of school where you can come in wanting to do anything under the sun, and graduate one of the best in your field. No matter what you’re studying, we all have unique and infinitely valuable experiences to bring to the table. I want to ensure that our experience at Penn makes all our hard work worth it. Whether we have moved across state lines, across the country, or across the world, it should be worth it. All the nights of sleep we missed getting ourselves here, all the nights of sleep we’ll miss keeping ourselves here– it should all be worth it. I believe after working so hard to get here, we need policies that make our academic and campus life a positive experience. As your College representative, I will do everything in my power to ensure we have access to resources that relieve some of the pressure of being a student at this university. Whether that’s through increasing access to academic services or advocating for mental health initiatives, I’ll dedicate myself to making everyone’s experience at Penn one marked by equality, access, fairness, and success.<br><br>Because we’re worth it.",
      "endorsements": "Black Student League",
      "image": {
        "src": "../../../images/2019/NEC/ozi.jpeg"
      }
    },
    {
      "name": "Quinn Lawery",
      "statement": "I, Quinn Lawery Jr, want to be YOUR next College of Arts of Sciences Representative for the Undergraduate Assembly. Why me? Ever since I can remember, I have had the ability to be versatile in tough situations and represent and support others. To hold a leadership role in the world you must be able to be a hard worker that is versatile and patient.<br><br>Being a part of the UA is as an excellent way to be a part of a cooperative team that is involved not only in the current student’s lives, but also the bigger picture of providing a better place for future students.<br><br>I can’t help but desire to tack onto my armor a new badge; game changer. It is my goal to motivate our generation to take risks and be BOLD.<br><br>As a member of the UA<br>- I will lobby for YOUR needs and not stop until I see a change.<br>- I will focus on YOUR issues on campus and find a feasible way to solve them.<br>-I will represent YOU because we are the new minds of the future.<br><br>Don’t forget IF YOU WANT TO WIN VOTE FOR QUINN!",
      "endorsements": "Black Student League",
      "image": {
        "src": "../../../images/2019/NEC/quinn.jpeg"
      }
    },
    {
      "name": "Regan Mizrahi",
      "statement": "Hello, my name is Regan Mizrahi, and I am running to be a College Representative on the UA! I have loved working on the UA this past year as a current New Student Representative, and I am passionate about being a voice for student all across Penn. I want to make sure that students can have their problems listened to so that we can try and initiate positive change on Penn's campus as a whole. This past year, I have worked on reforming the Peer and Academic advising system. By both lobbying administrators and meeting with them to understand the current system, I have effectively finished my project and initiated changes to come for the incoming freshmen and students at Penn in the future. If I was elected, I would hope to expand the grasp of my projects to topics such as mental health and wellness so that I can address more problems that are being voiced by students. I am running a joint campaign with Dante Diggs, who is running to be a Wharton Representative, so please make sure to vote for us from April 1st-April 4th!",
      "endorsements": "",
      "image": {
        "src": "../../../images/2019/NEC/regan.jpeg"
      }
    },
    {
      "name": "Ryan Bush",
      "statement": "My time as an associate member on the UA this past year has been incredibly rewarding, and I would love to continue to serve the Penn community as much as I possibly can. As a member of the Equity and Inclusion Committee, I worked to ensure all students, regardless of background, race, ethnicity, gender, sexual orientation, or nationality, felt welcomed on campus. I completed a project to make real and tangible change to pre-major advising in the College, including an upcoming addition of a majors office hours subsection to the College website. In addition, I worked on an initiative to revise the lighting systems in the college houses, as well as on a project to institute reforms to the on-campus recruiting process on campus in conjunction with the career services office. Finally, as a member of the Communications Team, I was responsible for advertising events such as airport shuttles, for keeping the UA up-to-date on DP articles, and for increasing UA exec transparency with the Penn student body. I simply wish to continue to serve the student body at Penn, and to continue the work I have begun this year on behalf of the Penn community.",
      "endorsements": "Penn Democrats",
      "image": {
        "src": "../../../images/2019/NEC/ryan.jpeg"
      }
    },
    {
      "name": "Simon Miller",
      "statement": "For the last 3 years, I have been a member of the Undergraduate Assembly, a group that I've come to love and constantly can't stop talking about. Because of my position on student government, I've made a tangible change and been able to improve student life to the best of my abilities. I want to thank everyone for the experiences that have been granted to me, but I've come one last time for your help. Once again, it is election season, and I want your help in re-electing me once again to the Penn Undergraduate Assembly as a School of Arts and Science Representative.<br><br>Since I’ve joined the UA, I’ve worked on projects such as Fall and Spring Wellness Week, creating a UA/CAPS Advisory Board Liaison, passing Wellness Resources on Syllabi to the Faculty Senate, creating and updating the Penn Resource Wellness Guide, and working on the Penn Big Idea Project to promote wellness throughout the Penn Community. I want to continue working on these types of projects, and do what I can to improve all types of wellness at Penn, not just mental or physical. In the next year, I plan to work with other student organizations such as Penn Wellness to truly create a more cohesive alliance that focuses on tackling the problem of Wellness at Penn.<br><br>I love this community, and can't wait to serve it again. Vote Simon Miller for UA SAS Representative!",
      "endorsements": "UMOJA",
      "image": {
        "src": "../../../images/2019/NEC/simon.jpeg"
      }
    },
    {
      "name": "Tori Borlase",
      "statement": "Hi Y’all!<br><br>My name is Tori Borlase, and I’m a freshman in the College studying PPE.  In running for UA I hope to invest in Penn so that, in turn, Penn can more effectively invest in its students. In order to provide a break from the intense nature of the campaign trail, I have articulated my platform in the form of an acrostic poem.  Please feel free to check out my extended candidacy statement at http://bit.ly/toriforua or reach out to me at tborlase@sas.upenn.edu if you have any questions!<br><br>T-Transforming Pre-professionalism - Increasing accessibility to career-building opportunities, specifically for low-income and underrepresented students, while fostering healthy conversations about navigating Penn’s competitive culture.<br><br>O-Offering Better Mental Health Services – “Destigmatizing” mental health issues isn’t enough; I will push for more care and better access by trying to increase staff and improve online accessibility.<br><br>R-Redesigning the Academic Perspective – Implementing new ways of helping select classes, such as being able to access past syllabi online, and also expanding options for College requirements.<br><br>I-Investing in Our Future – Sustainability is critically important, especially for a large institution like Penn.  Implementing policies helping students understand their carbon footprint as well as becoming a more eco-cognizant establishment are critical.",
      "endorsements": "Penn Debate Society, Penn Democrats",
      "image": {
        "src": "../../../images/2019/NEC/tori.jpeg"
      }
    },
    {
      "name": "Edward Yisheng Jiang",
      "statement": "G’day! I’m Edward from Sydney, Australia and I’m here to help.<br><br>My policy platform is simple. It stems from a couple of things I’ve learned from my time as an international student and a Peer Advisor.<br><br>(1) Funding for internships and programs abroad are crucial in supporting qualified students pursue opportunities that otherwise lie beyond reach. It’s counterintuitive for these opportunities to be limited by school.<br><br>(2) Resources for exchange and transfer students should be expanded because these students play such an important role in cultivating Penn’s diversity and rich sense of community even if they can’t vote.<br><br>(3) Getting a good sense of University requirements helps folks - particularly international students - make important decisions on their academic path. More needs to be done to build transparency.<br><br>If you’d like to reach me, I’m all ears and never too far away from my University email at yishengj@sas.upenn. Cheers and best of luck to all the others running.",
      "endorsements": "Phi Chi Theta, Penn Undergraduate Law Journal, Australians and New Zealanders at Penn, Public Policy Initiative Student Group, Alpha Phi Omega, South Asia Society, SFCU",
      "image": {
        "src": "../../../images/2019/NEC/edward.jpeg"
      }
    }
  ],
  "Wharton Representative": [
    {
      "name": "Anannya Shandilya",
      "statement": "It is often claimed that as one of the top-ranked institutions, Wharton is already offering all a student needs, but only those who experience know how so many aspects need to be changed. As an International First-Generation-Low-Income Woman, I understand some of the challenges that Wharton still needs to overcome and I believe that as students, YOU are the experts who know the flaws and can help Wharton improve. Hence, my goal is to incorporate each and every voice in Wharton to make Wharton a better place. By implementing the much-needed changes like including students into the decision-making process, promoting cross-cultural communications, and developing a stress-free environment where we don't just walk on a set path but experiment, I hope to assist in creating a Happy Wharton Family where we place US above you and I. 'Be the change you wish to see in the world' - these words of Mahatma Gandhi are the driving force behind my decision to run for the Wharton Representative position in the UA, and IF YOU REALLY WANT TO SEE THE CHANGE AND BE THE CHANGE, VOTE FOR ANANNYA.",
      "endorsements": "Penn Thillana, Penn Wharton China Summit",
      "image": {
        "src": "../../../images/2019/NEC/anannya.jpeg"
      }
    },
    {
      "name": "Daniel Wittmer",
      "statement": "<i>No provided statement.</i>",
      "endorsements": "",
      "image": {
        "src": "../../../images/2019/NEC/daniel.jpeg"
      }
    },
    {
      "name": "Danny Dontoh",
      "statement": "During my time on the UA, I have had the opportunity to collaborate with administrators, faculty, and student leaders to create tangible change! As a member of the Equity and Inclusion committee, I have been working on creating concentration informational sessions to increase educational equity across all Wharton departments,  developing a Wharton Diversity Advisory board to represent the needs of Wharton students from all backgrounds, and facilitating access to transportation services for Fall and Spring breaks. As a Wharton Representative, I hope to not only further these initiatives, but also work alongside the bright-minds our student body to connect them with the resources to thrive at Penn!",
      "endorsements": "Black Student League, South Asia Society, Alpha Kappa Psi",
      "image": {
        "src": "../../../images/2019/NEC/danny.jpeg"
      }
    },
    {
      "name": "Dante Diggs",
      "statement": "Dear Wharton Family,<br><br>When you envision Penn’s future, what are some of the things you dream of? Is it a facilitator that provides you with more opportunities to engage with your fellow students and the local Philadelphia community? Or an institution with more opportunities to learn how to protect yourself and your classmates?<br><br>My name is Dante Diggs, and in order for us to ensure that the University reaches these goals and more, you need someone will ask pressing questions while also fostering a sense of community. As a previous New Student Representative, I will continue to work actively with partners such as the Netter Center and the Division of Public Safety to learn more about how we as students can learn more from each other and from the city. I will also ensure that our Wharton buildings continue to be lively and supportive hubs for students. Most importantly, I hope to explore ways that we as leaders can continue to create spaces and moments of inclusivity and growth.<br><br>Through leadership and advocacy, Penn will be the University of our dreams.<br><br>P.S.: Don’t be afraid to stop me on Locust! I love meeting new people.",
      "endorsements": "Black Student League, Penn Debate Society, UMOJA",
      "image": {
        "src": "../../../images/2019/NEC/dante.jpeg"
      }
    },
    {
      "name": "Janice Owusu",
      "statement": "Hi, my name is Janice Owusu, I am a Wharton freshman. As a New Student Representative for the past two semesters, I am made the UA my top priority. In my role, I set out to accomplish a lot when looking at my expectations I am glad to say that I met some but, I want to take them to the next level. With little time I have had on the UA, I began working with campus administrators such as Sal Cuputo and other UA members to pilot a project for improvement in Van Pelt. Specifically looking at student complaints about the ground floor's bathrooms and conditions. Another project I hope to continue is the creation of a subsidy program for FGLI Students. Meeting with the Deputy Executive Director of CAPS, Dr.Meeta Kumar, to learn about the CAPS model and partnering up to look for solutions for FGLI students.  The UA has been an integral part of my experience here at Penn, especially listening to students concerns about Penn and I would love to continue this conversation. The work I have begun in the UA is not yet finished. I would love another opportunity to continue lobbying for the students of Penn. Thanks so much for the continuing support.<br><br>Sincerely, Janice",
      "endorsements": "Black Student League",
      "image": {
        "src": "../../../images/2019/NEC/janice.jpeg"
      }
    },
    {
      "name": "John Casey",
      "statement": "We all know the issues facing Wharton students. From accelerating OCR schedules to the lack of CIS seats, there are problems that need to be fixed. Making things even more frustrating, it can seem that progress is slow at best and non-existent at worst.<br><br>To be honest, I sometimes get frustrated by how slowly student government operates. I was angry when the Trustees voted to increase tuition by 4% without ever consulting the student body. I was exasperated when Huntsman Hall decided to close at 2am, denying reliable study spaces to those who most need them. And I get tired of hearing from peers about how they want to take CIS classes, but simply can’t get enrolled.<br><br>I’m running because I have the energy and know-how to tackle big issues. Now, the UA and I are close to building a comprehensive web resource that includes information about all student groups on campus, and I’m proud to have voted for a UA resolution that condemned the accelerating OCR calendar. I want to be a part of solving the problems Wharton students face… elect me to another term so I can get to work!",
      "endorsements": "Penn Undergraduate Law Journal, Penn Democrats, Alpha Kappa Psi",
      "image": {
        "src": "../../../images/2019/NEC/john.jpeg"
      }
    },
    {
      "name": "Maria Curry",
      "statement": "Real change isn't achieved overnight, but there are concrete steps to get there. Throughout my past 3 years on the UA, I have shown that this tangible change is possible not just with passion, but with the correct ambition and determination to see it through. As UA President, I want to continue to challenge the status quo and challenge our members to support you, the student body, at a new level.<br><br>My joint-platform is based on 5 Pillars: Transparency, Equity & Representation, Sustainability, Wellness, and Modern Infrastructure. An overarching theme is student engagement, and as President I want to continue to build on forums like UA Steering, town halls and focus groups, to enhance collaboration among student leaders, and move from discussions to tangible actions items with administration.<br><br>Our record shows this works. From directly working with administrators on the creation of the new PennTransit-App that allows students to request transportation on and off-campus for free, to personally creating 360°-Views of Campus Dorms for Campus-Express, to implementing new signage in all Dining Halls on sustainable food disposal, and developing mindfulness-spaces in centralized locations like Houston Hall, I will continue to lead the UA to tangible change for you as UA President.",
      "endorsements": "Black Student League, Penn Model Congress, Fossil Free Penn, Penn Democrats, Student Sustainability Association at Penn, Penn Vegan Society, University of Pennsylvania Beekeeping Club, Climate Reality Project at Penn, Penn Eco-Reps, Penn Sustainability Undergraduate Advisory Board, Penn Environmental Group (PEG), Penn Vegan Society (PVS), Black Wharton Undergraduate Association, Earth and Environmental Science Undergraduate Advisory Board",
      "image": {
        "src": "../../../images/2019/NEC/maria-curry.jpeg"
      }
    },
    {
      "name": "Nikhil Gupta",
      "statement": "As a New Student Representative and Communications Representative this past year, I have prioritized the UA as my main campus commitment. I have led an initiative to increase access to free menstrual products in Penn’s restrooms and have made progress by having numerous meetings with administrators, speaking at University Council, collecting over 800 signatures for a petition I co-authored with GAPSA, conducting a survey of around 80 campus locations, and garnering support from the Vice Provost, President Gutmann, The Daily Pennsylvanian, and student groups. I have also worked with fellow UA members for my other projects; I advised the Division of Public Safety on their active shooter guide and advocated for improved triaging systems to reduce wait times with the Student Health Service. I have attended every weekly GBM and committee meeting, in which I contributed my insights on issues faced by the University community and advised my fellow UA members on their projects. Through my Communications role, I have managed social media, designed graphics, and created videos for transparency with the student body. If re-elected as Wharton Representative, I would also like to work on revamping exam policies and other academic initiatives in addition to continuing to advance equity.",
      "endorsements": "Penn Wharton China Summit, South Asia Society, South Asia Society, Wharton Asia Exchange",
      "image": {
        "src": "../../../images/2019/NEC/nikhil.jpeg"
      }
    },
    {
      "name": "Samidha Sane",
      "statement": "Hello, I am Samidha Sane! If elected as UA Wharton Representative, I will integrate my past experiences of advocating for women’s health, menstrual equity, and nutrition with my vision for an inclusive, healthy, and academically enriching future for all at Penn:<br><br>My campaign platform consists of three key areas:<br><br>1. Diversity/Inclusion: I aim to implement diversity trainings for faculty and student leaders to mitigate microaggressions concerning gender, race, and socioeconomic status in the classroom. I will also push to create more sustainable, affordable summer storage options for students.<br><br>2. Health and Safety: I will promote sexual violence prevention initiatives and Title IX rights/procedures on campus by working alongside organizations like Penn Violence Prevention and Office of the Sexual Violence Investigative to review and publicize an annual report on how cases are handled at Penn to assure that victims are offered extensive, timely support.<br><br>3. Academic Life: I would like to offer students greater accessibility to costly course materials, improve first-year Wharton advising, and table in Huntsman Hall to solicit suggestions from Wharton students so the UA can further support students’ academic endeavors.<br><br>If elected to the UA, I will advocate for safety and equity to ultimately prioritize student wellbeing at Penn.",
      "endorsements": "South Asia Society",
      "image": {
        "src": "../../../images/2019/NEC/samidha.jpeg"
      }
    }
  ],
  "Nursing Representative": [
    {
      "name": "Tess Doran",
      "statement": "Hi friends! I am so excited to announce my candidacy for Nursing Representative on the Undergraduate Assembly! For the past year, I have had the pleasure of serving as an Associate Member on the UA working on numerous projects to benefit student’s academic and social lives, as well as striving to improve mental health on campus through collaborations with the Tutoring Center, Weingarten Learning Center, and School of Nursing.<br><br>If I were to be elected as your Nursing Representative, I would continue to fight for change and students’ rights on campus with projects such as lobbying for standardized clinical costs, more transparent financial aid statements, and healthcare-specific mental health resources on campus. Penn Nursing prides itself on being the best, but there is so much more that needs to be done. Though we may be the smallest school on campus, there is no reason why we should not be equally represented, and I know I can be the liaison between the UA and School of Nursing needed to make your voices heard.<br><br>The Penn Nursing name might speak for itself, but don’t let anyone speak for you. I hope I can count on your support.",
      "endorsements": "Penn Improv Society, South Asia Society",
      "image": {
        "src": "../../../images/2019/NEC/tess-doran.jpeg"
      }
    }
  ]
}