[
  {
    "name": "Chase Serota",
    "statement": "My name is Chase Serota and I’m running for Vice President of the Undergraduate Assembly to create tangible change on campus and put student opinion at the forefront of administrator decisions. My joint-platform is based on 5 Pillars: Transparency, Equity & Representation, Sustainability, Wellness & Student Life, and Modern Infrastructure. Just within the past year, my record of both experience and impact proves how I will continue to follow through on projects that directly benefit students.<br><br>For example, beginning in January of this year, I personally directed the renovation of the basement of Van Pelt that will take place this summer in coordination with Penn Facilities and other UA members. Additionally, I’ve worked directly with CAPS, the Provost’s Office, and Penn’s Chief Wellness Officer to develop plans for a pilot program for a CAPS satellite office within Van Pelt Library that’s accessible to all students, regardless of school. Moreover, I have enjoyed promoting student focus groups with high-level administrators like those regarding the new Sophomore Experience or the replacement of Frontera to ensure that the student opinion is always represented. This is how we make the UA work for you—join us and vote Curry and Serota for UA President and VP.",
    "endorsements": "Penn Model Congress, Fossil Free Penn, Penn Democrats, Student Sustainability Association at Penn, Penn Vegan Society, University of Pennsylvania Beekeeping Club, Climate Reality Project at Penn, Penn Eco-Reps, Penn Sustainability Undergraduate Advisory Board, Penn Environmental Group (PEG), Penn Vegan Society (PVS), Earth and Environmental Science Undergraduate Advisory Board",
    "image": {
      "src": "../../../images/2019/NEC/chase-serota.jpeg"
    }
  },
  {
    "name": "Brian Goldstein",
    "statement": "Hi, my name is Brian Goldstein, and I am running for Vice President of the Undergraduate Assembly. If elected, my priorities next year would be transparency, inclusivity, accessibility, wellness, and academics. As Vice President I would look forward to collaborating with UA Steering groups to promote our common goals and initiatives. As the candidate with the most UA experience I look forward to utilizing the relationships that I have developed with administrators to affect tangible change. I will dedicate myself to both the Undergraduate Assembly and the student body in order to ensure that your priorities and concerns are heard.",
    "endorsements": "Penn Undergraduate Health Council, South Asia Society, Asian Pacific Student Coalition, Student Athlete Advisory Committee, Assembly of International Students",
    "image": {
      "src": "../../../images/2019/NEC/brian.jpeg"
    }
  }
]