[
  {
    "name": "Anannya Shandilya",
    "statement": "It is often claimed that as one of the top-ranked institutions, Wharton is already offering all a student needs, but only those who experience know how so many aspects need to be changed. As an International First-Generation-Low-Income Woman, I understand some of the challenges that Wharton still needs to overcome and I believe that as students, YOU are the experts who know the flaws and can help Wharton improve. Hence, my goal is to incorporate each and every voice in Wharton to make Wharton a better place. By implementing the much-needed changes like including students into the decision-making process, promoting cross-cultural communications, and developing a stress-free environment where we don't just walk on a set path but experiment, I hope to assist in creating a Happy Wharton Family where we place US above you and I. 'Be the change you wish to see in the world' - these words of Mahatma Gandhi are the driving force behind my decision to run for the Wharton Representative position in the UA, and IF YOU REALLY WANT TO SEE THE CHANGE AND BE THE CHANGE, VOTE FOR ANANNYA.",
    "endorsements": "Penn Thillana, Penn Wharton China Summit",
    "image": {
      "src": "../../../images/2019/NEC/anannya.jpeg"
    }
  },
  {
    "name": "Daniel Wittmer",
    "statement": "<i>No provided statement.</i>",
    "endorsements": "",
    "image": {
      "src": "../../../images/2019/NEC/daniel.jpeg"
    }
  },
  {
    "name": "Danny Dontoh",
    "statement": "During my time on the UA, I have had the opportunity to collaborate with administrators, faculty, and student leaders to create tangible change! As a member of the Equity and Inclusion committee, I have been working on creating concentration informational sessions to increase educational equity across all Wharton departments,  developing a Wharton Diversity Advisory board to represent the needs of Wharton students from all backgrounds, and facilitating access to transportation services for Fall and Spring breaks. As a Wharton Representative, I hope to not only further these initiatives, but also work alongside the bright-minds our student body to connect them with the resources to thrive at Penn!",
    "endorsements": "Black Student League, South Asia Society, Alpha Kappa Psi",
    "image": {
      "src": "../../../images/2019/NEC/danny.jpeg"
    }
  },
  {
    "name": "Dante Diggs",
    "statement": "Dear Wharton Family,<br><br>When you envision Penn’s future, what are some of the things you dream of? Is it a facilitator that provides you with more opportunities to engage with your fellow students and the local Philadelphia community? Or an institution with more opportunities to learn how to protect yourself and your classmates?<br><br>My name is Dante Diggs, and in order for us to ensure that the University reaches these goals and more, you need someone will ask pressing questions while also fostering a sense of community. As a previous New Student Representative, I will continue to work actively with partners such as the Netter Center and the Division of Public Safety to learn more about how we as students can learn more from each other and from the city. I will also ensure that our Wharton buildings continue to be lively and supportive hubs for students. Most importantly, I hope to explore ways that we as leaders can continue to create spaces and moments of inclusivity and growth.<br><br>Through leadership and advocacy, Penn will be the University of our dreams.<br><br>P.S.: Don’t be afraid to stop me on Locust! I love meeting new people.",
    "endorsements": "Black Student League, Penn Debate Society, UMOJA",
    "image": {
      "src": "../../../images/2019/NEC/dante.jpeg"
    }
  },
  {
    "name": "Janice Owusu",
    "statement": "Hi, my name is Janice Owusu, I am a Wharton freshman. As a New Student Representative for the past two semesters, I am made the UA my top priority. In my role, I set out to accomplish a lot when looking at my expectations I am glad to say that I met some but, I want to take them to the next level. With little time I have had on the UA, I began working with campus administrators such as Sal Cuputo and other UA members to pilot a project for improvement in Van Pelt. Specifically looking at student complaints about the ground floor's bathrooms and conditions. Another project I hope to continue is the creation of a subsidy program for FGLI Students. Meeting with the Deputy Executive Director of CAPS, Dr.Meeta Kumar, to learn about the CAPS model and partnering up to look for solutions for FGLI students.  The UA has been an integral part of my experience here at Penn, especially listening to students concerns about Penn and I would love to continue this conversation. The work I have begun in the UA is not yet finished. I would love another opportunity to continue lobbying for the students of Penn. Thanks so much for the continuing support.<br><br>Sincerely, Janice",
    "endorsements": "Black Student League",
    "image": {
      "src": "../../../images/2019/NEC/janice.jpeg"
    }
  },
  {
    "name": "John Casey",
    "statement": "We all know the issues facing Wharton students. From accelerating OCR schedules to the lack of CIS seats, there are problems that need to be fixed. Making things even more frustrating, it can seem that progress is slow at best and non-existent at worst.<br><br>To be honest, I sometimes get frustrated by how slowly student government operates. I was angry when the Trustees voted to increase tuition by 4% without ever consulting the student body. I was exasperated when Huntsman Hall decided to close at 2am, denying reliable study spaces to those who most need them. And I get tired of hearing from peers about how they want to take CIS classes, but simply can’t get enrolled.<br><br>I’m running because I have the energy and know-how to tackle big issues. Now, the UA and I are close to building a comprehensive web resource that includes information about all student groups on campus, and I’m proud to have voted for a UA resolution that condemned the accelerating OCR calendar. I want to be a part of solving the problems Wharton students face… elect me to another term so I can get to work!",
    "endorsements": "Penn Undergraduate Law Journal, Penn Democrats, Alpha Kappa Psi",
    "image": {
      "src": "../../../images/2019/NEC/john.jpeg"
    }
  },
  {
    "name": "Maria Curry",
    "statement": "Real change isn't achieved overnight, but there are concrete steps to get there. Throughout my past 3 years on the UA, I have shown that this tangible change is possible not just with passion, but with the correct ambition and determination to see it through. As UA President, I want to continue to challenge the status quo and challenge our members to support you, the student body, at a new level.<br><br>My joint-platform is based on 5 Pillars: Transparency, Equity & Representation, Sustainability, Wellness, and Modern Infrastructure. An overarching theme is student engagement, and as President I want to continue to build on forums like UA Steering, town halls and focus groups, to enhance collaboration among student leaders, and move from discussions to tangible actions items with administration.<br><br>Our record shows this works. From directly working with administrators on the creation of the new PennTransit-App that allows students to request transportation on and off-campus for free, to personally creating 360°-Views of Campus Dorms for Campus-Express, to implementing new signage in all Dining Halls on sustainable food disposal, and developing mindfulness-spaces in centralized locations like Houston Hall, I will continue to lead the UA to tangible change for you as UA President.",
    "endorsements": "Black Student League, Penn Model Congress, Fossil Free Penn, Penn Democrats, Student Sustainability Association at Penn, Penn Vegan Society, University of Pennsylvania Beekeeping Club, Climate Reality Project at Penn, Penn Eco-Reps, Penn Sustainability Undergraduate Advisory Board, Penn Environmental Group (PEG), Penn Vegan Society (PVS), Black Wharton Undergraduate Association, Earth and Environmental Science Undergraduate Advisory Board",
    "image": {
      "src": "../../../images/2019/NEC/maria-curry.jpeg"
    }
  },
  {
    "name": "Nikhil Gupta",
    "statement": "As a New Student Representative and Communications Representative this past year, I have prioritized the UA as my main campus commitment. I have led an initiative to increase access to free menstrual products in Penn’s restrooms and have made progress by having numerous meetings with administrators, speaking at University Council, collecting over 800 signatures for a petition I co-authored with GAPSA, conducting a survey of around 80 campus locations, and garnering support from the Vice Provost, President Gutmann, The Daily Pennsylvanian, and student groups. I have also worked with fellow UA members for my other projects; I advised the Division of Public Safety on their active shooter guide and advocated for improved triaging systems to reduce wait times with the Student Health Service. I have attended every weekly GBM and committee meeting, in which I contributed my insights on issues faced by the University community and advised my fellow UA members on their projects. Through my Communications role, I have managed social media, designed graphics, and created videos for transparency with the student body. If re-elected as Wharton Representative, I would also like to work on revamping exam policies and other academic initiatives in addition to continuing to advance equity.",
    "endorsements": "Penn Wharton China Summit, South Asia Society, South Asia Society, Wharton Asia Exchange",
    "image": {
      "src": "../../../images/2019/NEC/nikhil.jpeg"
    }
  },
  {
    "name": "Samidha Sane",
    "statement": "Hello, I am Samidha Sane! If elected as UA Wharton Representative, I will integrate my past experiences of advocating for women’s health, menstrual equity, and nutrition with my vision for an inclusive, healthy, and academically enriching future for all at Penn:<br><br>My campaign platform consists of three key areas:<br><br>1. Diversity/Inclusion: I aim to implement diversity trainings for faculty and student leaders to mitigate microaggressions concerning gender, race, and socioeconomic status in the classroom. I will also push to create more sustainable, affordable summer storage options for students.<br><br>2. Health and Safety: I will promote sexual violence prevention initiatives and Title IX rights/procedures on campus by working alongside organizations like Penn Violence Prevention and Office of the Sexual Violence Investigative to review and publicize an annual report on how cases are handled at Penn to assure that victims are offered extensive, timely support.<br><br>3. Academic Life: I would like to offer students greater accessibility to costly course materials, improve first-year Wharton advising, and table in Huntsman Hall to solicit suggestions from Wharton students so the UA can further support students’ academic endeavors.<br><br>If elected to the UA, I will advocate for safety and equity to ultimately prioritize student wellbeing at Penn.",
    "endorsements": "South Asia Society",
    "image": {
      "src": "../../../images/2019/NEC/samidha.jpeg"
    }
  }
]