{
    "President": [
      {
        "name": "Vedika Jawa",
        "introduction": "What a year we’ve had, ‘26! Serving as your Class President this past year has been an amazing experience. Thank you to all of you for making it so fun and for turning this class into a family through Econ Scream, Holi, and so much more. But more than anything — thank you for being the most spirited class, for all your warm hellos on Locust, smiles at events, and of course -- reading my overly colorful emails. Getting to know all of you has been the best part and I hope to continue to make our 26’ fam even closer sophomore year!",
        "platform points": [
          "Family - Continue to successfully organize traditions like U-Night, while also launching new events such as a class sleepover, puppy study break, and more that'll continue to bring our class together. ",
          "Advocacy  - Talk to students to understand their concerns and opinions on certain issues and convey these to the faculty who have the power to make a change. ",
          "Merch - Subsidizing costs for the upcoming merch drop (coming soon..) to make sure that students of all backgrounds have an equal opportunity to engage in class experiences"
        ],
        "instagram_handle": "https://www.instagram.com/vedikajawa4president/",
        "image": {
          "src": "../../../images/2023/nec/Vedika-Jawa.jpeg"
        }
      },
      {
        "name": "Sri Pinnamareddy",
        "introduction": "Hey, y’all! My name is Sri Pinnamareddy and I am running for President. As College Chair these past 2 years, I loved creating memorable events: Bloom Spring Formal, Love Pop-up, and Dining & Dashing. I’ve enjoyed being that person pouring you hot chocolate, running around campus with 1,000 donuts in residential carts, and handing out quarter-zips. I pride myself on being a doer. As Class President, I will build on this momentum by hosting more and better events. I want to throw bangers at Smoke's, plan fun events like Sports Tournaments and Pop-ups, and drop more fire merch. ",
        "platform points": [
          "Bussin’ Bangers: Let’s take over Smokes, Philly Bars, and Downtowns! With free drinks, food, and subsidized tickets, I will plan nights that you will never forget!",
          "Making Memories: Sports Tournaments, College Green Movie Nights, Farmers Market Pop-Ups, and Coffee Houses are just a few of the events I am planning to make happen. There is something for everyone and I want to bring the class together with fun events!",
          "Connecting Community: Spring Formal: Bloom raised $3,000 for Project HOME. Building off of that success, I will create fundraising and service initiatives to foster relationships with communities outside of Penn. ",
          "Welcoming Wellness: School is stressful. Who doesn’t love free halal during finals week (with a guest appearance from Rahim)? Whether it be dogs and donuts or working with Penn Wellness, I hope to add a little more joy in your day. :)",
          "More Merch: Liked your quarter-zip? Along with P-Sweaters, how about some sweatpants, hoodies, or hats? Working with our creative directors, I will create more frequent merch drops with fire designs.",
          "Increasing Inclusivity: Everyone should be part of creating their college experience. I will create open-forums for you to pitch your ideas and concerns to the Class Board. Let's make your vision happen!"
        ],
        "facebook_url": "https://www.facebook.com/sri.pinnamareddy.58/",
        "instagram_handle": "sri.pinn",
        "image": {
          "src": "../../../images/2023/nec/Sri-Pinnamareddy.jpeg"
        }
      },
      {
        "name": "Bruno Basner",
        "introduction": "Hi Class of ‘26!\n\nI’m Bruno Basner and I am running to make the Class of ‘26 a Movie. In fact, Oscar is my middle name so you know I’m qualified.\n\nA major responsibility of the class board is planning and executing events. I believe the experiences I have gained since being at Penn have given me ample experience to be a successful Class President. \n\nWith creativity, school spirit, and an open mind. We can make the Class of ‘26 an Oscar winner.\n",
        "platform points": [
          "As Class President, I aim to have continuous inter-school spirit  by having year long weekly objectives that give students the chance to represent their school and win prizes for their efforts",
          "As Social Chair of AIS I have experience planning events for hundreds of people. This means I have the experience to plan events and execute on them.",
          "My experience as Co-President of the Penn German Society means that I know how to lead a board and get things done.",
          "The Scare Games from the movie Monsters University is something I want to implement at Penn. A tournament where Fraternities compete is something everyone can get behind. ",
          " A dead event is one where no one is present. As marketing chair of the Wharton Sports Business Club, I know how to get people to show up. "
        ],
        "instagram_handle": "bbasner22",
        "image": {
          "src": "../../../images/2023/nec/Bruno-Basner.jpeg"
        }
      }
    ],
    "Executive VP": [
      {
        "name": "Juan Lopez",
        "introduction": "Hello Class of 2026, My name is Juan Lopez and I am excited to rerun for the Executive Vice President and UA CAS Rep position. I am majoring in Political Science and I’m from the Bay Area. I am running to be able to advocate for each and every student at Penn! I will continue contributing to ‘26s events and making them as fun as possible, getting to make sure these events target as many freshmen as possible. I absolutely enjoyed being on Class Board! Be sure to check my Instagram for more details. @lopez4viceprez",
        "platform points": [
          "I’ll make sure to encourage feedback on our board and our events and use that to better the class of ‘26!",
          "Will work collaboratively with other Class Board members to make our merch designs different and better every time! ",
          "I’ll listen to student voices and bring their ideas up on our meetings to have that be a possible event. ",
          "Make merch more affordable for not only FGLI students but also the whole class so we can all be united! "
        ],
        "instagram_handle": "lopez4viceprez",
        "image": {
          "src": "../../../images/2023/nec/Juan-Lopez.jpeg"
        }
      },
      {
        "name": "Juan Lopez",
        "introduction": "Hello Penn, My name is Juan Lopez and I am excited to run for UA CAS Representative. I am majoring in Political Science and I’m from the Bay Area. I was a New Student Rep for the UA and am working closely with the Equity and Inclusion committee. While being in UA, I worked closely with the FGLI community and helped there be more resources to help incoming FGLI students adjust to Penn better. I want to work more with Penn’s Math curriculum and hopefully I can continue that work.",
        "platform points": [
          "I’ll make sure to advocate for the needs of every student at Penn! You’ll all have my socials or email and can let me know of any questions or concerns.",
          "As I’ll be in the loop on most things, I will make sure to let everyone know of anything that might not be beneficial to the student body.",
          "Making Penn a more collaborative community rather than a competitive one!",
          "Work with Financial aid to have more free events on campus or have many things be more accessible to everyone.",
          "Support the FGLI community with more resources to succeed at Penn and create a  strong community within one another!",
          "I will make sure everyone has fun through it all. I believe not everything needs to be serious and more interactions with the student body is necessary! "
        ],
        "instagram_handle": "lopez4viceprez",
        "image": {
          "src": "../../../images/2023/nec/Juan-Lopez.jpeg"
        }
      },
      {
        "name": "Amaan Omer",
        "introduction": "Doritos, Cheerios, Flamingos. Now that I got your attention...HELLLLLO everyone, my name is Amaan Omer, the current Executive VP for the Class of '25. I'm a sophomore concentrating in HCMG and Biology with Wharton and the College. I love dancing with my team, Penn Raas, and objecting to Princeton's useless arguments in Mock Trial. I'm running again for Executive VP to continue hosting events that unite the student body, like the free halal cart and HOLI. It's my responsibility to make sure everyone is heard, and their ideas become incorporated in the two years we have left on campus.",
        "platform points": [
          "Support for Student Groups: I'll guarantee that CB can partner with and direct student groups to resources that curate successful events. I've done it before; I'll do it again. ",
          "The More the Merrier: Did you enjoy events like HOLI, Bloom, Econ Scream? Why stop there when we can have bigger, louder, and more frequent events? Time to get ready.",
          "Penn x Philadelphia: It's time for Penn to give back to Philly, whether that's organizing class-wide efforts to revitalize the city's communities to volunteering; let's show our brotherly love.",
          "Better Emails: Despise skimming over boring emails? I certainly do. I plan on taking over the class email for updates. Trust me when I say I will make them very...very...entertaining. ",
          "Resource Accessibility: I want to open resources for underrepresented and inexperienced communities trying to navigate Penn. Also, I need better WiFi to listen to SZA at 3:00 AM. ",
          "Personal Convenience: I work for you and will do my best to answer your questions. Forgot your Q-ZIP? No worries, I'll grab it and deliver it to your door."
        ],
        "instagram_handle": "https://www.instagram.com/amaanomer/",
        "image": {
          "src": "../../../images/2023/nec/Amaan-Omer.jpeg"
        }
      },
      {
        "name": "Cody Eskandarian",
        "introduction": "Hey! My name is Cody Eskandarian and I’m a junior studying chemistry and physics from New York. I’m running for re-election for Class Board and UA because I’ve got innovative ideas that I’m excited to bring to Penn that you can read about below! Outside of my initiatives, I bring a lot to the table; tenacity, creativity, enthusiasm, and most importantly, I make sure that the people around me have fun as we work together as a team. I’m here to make quality of life improvements through the UA, and cultivate an unforgettable senior year for the class of ‘24.",
        "platform points": [
          "Introduce shuttles that take students to home goods stores (Walmart/Target) during NSO (already in progress with Penn administration!!)",
          "Sports tournaments! If you enjoyed our dodgeball and basketball tournaments, I want to organize even more like volleyball, soccer, spikeball, etc.",
          "Bolster student voices on dining hall sanitation issues",
          "Develop more local service opportunities in West Philadelphia, such as beautifying schools and providing food for those in need",
          "Make Feb Club for the class of ‘24 an absolute movie"
        ],
        "instagram_handle": "codyesk",
        "image": {
          "src": "../../../images/2023/nec/Cody-Eskandarian.jpeg"
        }
      },
      {
        "name": "Isaac Tang",
        "introduction": "Hello! I’m Isaac Tang and I’m from Miami. I’m currently studying Math (that is the most boring fact about me, I promise). Outside of the classroom, I’m in Counterparts, one of Penn’s acapella groups, and my dream is to become a professor. I'm running to represent you because I’d love to get to know each of you good looking people, and bring our class and community together through fun, educational events because, as Mr. Worldwide once sang, “One’s company, two’s a crowd and three’s a party.” We have a little more than three students, but we’ll make it work.",
        "platform points": [
          "Create opportunities for students to get involved in local Philadelphia community by partnering with the Netter Center and diversifying ABCS (Academically Based Community Service Courses) to fulfill course requirements",
          "Host more classwide events to display Penn’s performing and visual arts, allowing groups to gain more publicity and opportunities to showcase their hard work",
          "Publicize and increase the capacity of Weingarten tutoring programs so more students can learn in smaller groups",
          "Expand our student body’s cultural knowledge through free food and culinary events",
          "Encourage our class to explore the greater Philadelphia community (and beyond Pennsylvania) through social events and parties downtown",
          "Promote class spirit through more free Penn merchandise"
        ],
        "instagram_handle": "iggstagraaam",
        "image": {
          "src": "../../../images/2023/nec/Isaac-Tang.jpeg"
        }
      }
    ],
    "VP Internal": [
      {
        "name": "Ria Ellendula",
        "introduction": "​​Hi! My name is Ria Ellendula, and I’m running to be re-elected as a UA College Representative and Class Board Vice President. This year, I served as the UA Equity and Inclusion Director. I have worked to establish the pilot program for free menstrual products in Hill and advocate for free menstrual products on campus. Through the Class Board, I have been able to facilitate events, such as Holi, Econ Scream, etc. I want to improve the student experience and would appreciate your vote for re-election! Please reach out to me at @riaell@sas.upenn.edu for any more questions! ",
        "platform points": [
          "Advocating for free menstrual products throughout campus and residential buildings.",
          "Supporting the vision and the values of various identity-based campus organizations. ",
          "Opening up channels of communication between students and student government representatives",
          "Facilitating class-wide spirit events that are both inclusive and exciting!"
        ],
        "instagram_handle": "ria.ellendula",
        "image": {
          "src": "../../../images/2023/nec/Ria-Ellendula.jpeg"
        }
      }
    ],
    "VP External": [
      {
        "name": "Yash Mahajan",
        "introduction": "Hi! I'm Yash Mahajan, and I'm running for re-election for the Undergraduate Assembly and to become the Class of 2025's VP External! I have really enjoyed my time at Penn and on the UA, and would love the opportunity to continue giving back to the Penn community by working on DEI, sustainability, and school spirit. As an international student, I have recognised the need to feel 'integrated' into the Penn community, and I want to ensure every student feels not only integrated, but seen, heard and accommodated for. To see my UA projects (sustainability/DEI), visit pennua.org/annual-reports",
        "platform points": [
          "Academic Wellness: • Ensure all courses release at least one grade prior to drop and P/F deadlines • Ensure all courses provide late days • Increase mid-semester feedback surveys",
          "Penn Dining: • Create reimbursement schemes for Dining Plans in face of health violations/closures • Survey students to modify dining hours • Create price-matching frameworks to make on-campus food more accessible",
          "DEI (Course Registration): • Create an opt-out lottery system to replace add-drop process—ensuring equal opportunity to enroll regardless of wifi, location or work schedule • Check UA annual report for full project proposal",
          "Accommodations: • Provide stipends for summer courses, textbooks etc through SRFS • Allow petitions for early move-in decisions • Modify dormitory air-conditioning policies • Increase RA and event funding",
          "Building Community: • Organise year-wide and major-wide study breaks with food and faculty • Support student groups by showcasing different organisations on weekly College Green exhibitions",
          "Sustainability: • Provide reusable cups for dining halls and discounts in on-campus cafes • Increase availability of compost bins and education • Increase accessibility to maps of on-campus water refill stations"
        ],
        "instagram_handle": "https://www.instagram.com/yashmahajan_/",
        "image": {
          "src": "../../../images/2023/nec/Yash-Mahajan.jpeg"
        }
      },
      {
        "name": "Michelle Chen",
        "introduction": "Hi! I’m running to be re-elected on Class Board and UA as the VP of External and a Wharton Rep. This past year, I’ve had the opportunity to work on many projects in both branches, ranging from Late Night Skate night to improving accessibility of resources for students. I hope to continue these initiatives in the following year, and maintain transparency, communication, and advocacy on behalf and for my class!",
        "platform points": [
          "Transparency- value class input through feedback via Social Media platforms",
          "Communication- update student body regularly regarding upcoming events",
          "Advocacy- represent the student body by tackling issues that are important to maintaining equity within the body"
        ],
        "instagram_handle": "michellee.chennn",
        "image": {
          "src": "../../../images/2023/nec/Michelle-Chen.jpeg"
        }
      },
      {
        "name": "Shan Shan Liang",
        "introduction": "Hi everyone, my name is Shan Shan Liang, and I am a junior in Wharton studying Finance and Business Analytics. I'm from Johnson City, Tennessee, and I have served on both Class Board and Undergraduate Assembly for 3 years. I love the people I have met and the work we have done! I hope to keep making an impact through student government in my senior at Penn. Please email me (shan9318@wharton.upenn.edu) if you have any thoughts for what you want to see in our last year. ",
        "platform points": [
          "Feb Club - the best Feb Club this school has seen in 4 years!",
          "DEI - focus on diversity and inclusion events, along with more partnerships with cultural groups on campus ",
          "Free events - free food, free merch, anything to make senior year the best!"
        ],
        "instagram_handle": "shanshanliang_",
        "image": {
          "src": "../../../images/2023/nec/Shan-Shan-Liang.jpeg"
        }
      }
    ],
    "VP Finance": [
      {
        "name": "Tiana Wang",
        "introduction": "Tiana is a Wharton student studying finance, running for re-election for Vice President of Finance (Class Board). She is passionate about providing all Penn students with access to financial resources, both academically and socially. From managing the class budget, negotiating for more funding, and working to provide accessible events to every member of the class, Tiana hopes that her previous experience handling the CB budget as VP of Finance this past year will allow her to continue serving the student body.",
        "platform points": [
          "Allocating class funds and resources to individual Penn students (unaffiliated with any club or organization) for the purpose of social/academic events, initiatives they want to start, accessible merchandise, etc.",
          "Encouraging student engagement by increasing the visibility and accessibility to class events, opportunities, and resources.",
          "Diversifying social and academic events to create a non-traditional university experience.",
          "Prioritizing student feedback before and after initiatives/events by establishing open communication channels via email, in-person, and through online forms.",
          "Emphasizing community engagement and branching out to planning class events beyond Penn’s campus.",
          "Creating a unified platform to access all student government resources, including necessary budgeting and financial information."
        ],
        "facebook_url": "https://www.facebook.com/tiana.wang.3386",
        "instagram_handle": "https://www.instagram.com/tianawxng/",
        "campaign_website": "https://sites.google.com/view/tiana-wang/home",
        "image": {
          "src": "../../../images/2023/nec/Tiana-Wang.jpeg"
        }
      },
      {
        "name": "Su Ah Kim",
        "introduction": "Hello, my name is Su Ah Kim, and I’m running to be your Class Board VP of Finance! I’m extremely passionate about creating tight-knit communities, and as your VP of Finance, I hope to make our college experience the absolute best that it can be. Through my diverse extracurricular commitments on campus, like serving on board for Wharton Women, I believe I possess the necessary, relevant skills to succeed in this position. As VP of Finance, I will ensure that our funds are allocated effectively so that we're able to host a wide range of meaningful events throughout the year.  ",
        "platform points": [
          "S: strategically analyze in-flows and out-flows to ensure that current and future events can be optimally funded  ",
          "C: foster community through consistent, engaging social programming ",
          "O: take an open-minded approach to generate novel ideas ",
          "R: be resourceful to maximize utility per dollar by sourcing most cost-effective vendors and suppliers",
          "E: establish a new standard of excellence for Class Board"
        ],
        "instagram_handle": "ssuahkim",
        "image": {
          "src": "../../../images/2023/nec/Su-Ah-Kim.jpeg"
        }
      }
    ],
    "College Chair": [
      {
        "name": "Hannah Kim ",
        "introduction": "Hi! My name is Hannah and I am running for College Chair to improve our experiences at Penn by introducing more enjoyable class activities. Having prior involvement in student government during high school, I aim to leverage my experience to benefit the Class Board. Thank you!",
        "platform points": [
          "More free merch/food",
          "Ensure there are various types of class activities "
        ],
        "instagram_handle": "hannahjkimm ",
        "image": {
          "src": "../../../images/2023/nec/Hannah-Kim-.jpeg"
        }
      },
      {
        "name": "Eric Lee",
        "introduction": "Eric is a freshman in the College studying biochemistry and biophysics. This past academic year, he enjoyed serving on both the Class Board and Undergraduate Assembly, where he helped to plan social programming for the Class of 2026 (he's grateful for \"Skate Night\" being a hit!) and worked with administrators such as the Netter Center coordinators to improve student life at Penn. He would love to continue his work and interact with classmates through Penn's student government. Outside of class and Penn Student Government, Eric enjoys running, playing the violin, and going to Chinatown for plump baozi buns. ",
        "platform points": [
          "Hosting class-wide \"office hours\" to hear the concerns and desires of the Class of 2026—we want to hear what you want to happen.",
          "Working with the Dining Advisory Board to create a more established dumpling bar at dining halls or partnering with a new dumpling vendor in dining cafes, as dumplings appear to be in high demand.",
          "Opening a more permanent merch store that sells apparel exclusive to the Class of 2026.",
          "Creating an external seat to the Netter Center to promote civic engagement and Community Service. The external seat holder will work on administrative tasks to support volunteering groups, such as providing SEPTA cards for transportation.",
          "Making Houston Hall the center of student socialization, especially for underclassmen, through a Houston Hall email list and new events like weekly cuisine sampling.",
          "Working with Penn Transit to include stops further off campus to promote exploration in Philadelphia and service to the community outside Penn's campus."
        ],
        "facebook_url": "https://www.facebook.com/ericaaaaaaaa912/",
        "instagram_handle": "Ericaaaaaaa912",
        "image": {
          "src": "../../../images/2023/nec/Eric-Lee.jpeg"
        }
      },
      {
        "name": "Pierre Collet",
        "introduction": "Hi, I'm Pierre and I'm excited to run for Class Board (CB). As a passionate and engaged member of the Penn community, I believe that serving as a CB representative would be a great way to give back and make a positive impact on my peers. I've always enjoyed working collaboratively to plan events and activities, and I believe that my creativity and leadership skills would make me an effective CB member. I'm committed to representing the needs and interests of my classmates, and I'm eager to work hard to ensure that our time at Penn is memorable and rewarding.",
        "platform points": [
          "Enhancing the sense of community and school spirit among students by organizing engaging events, such as social mixers, service projects, and cultural celebrations.",
          "Promoting mental health and wellness initiatives on campus, including workshops and events focused on stress reduction, self-care, and mindfulness.",
          "Advocating for increased sustainability efforts on campus, such as reducing single-use plastics and increasing recycling initiatives.",
          "Supporting academic success and career development opportunities for students, such as hosting alumni networking events and connecting students with internships and job opportunities.",
          "Facilitating open communication between the student body and university administration by hosting town hall meetings, gathering feedback from students, and advocating for student needs and interests.",
          "Supporting the arts on campus by organizing performances, exhibits, and workshops to showcase the talents of UPenn's student artists."
        ],
        "instagram_handle": "_pierre_collet",
        "image": {
          "src": "../../../images/2023/nec/Pierre-Collet.jpeg"
        }
      },
      {
        "name": "Alex Eapen",
        "introduction": "Hi! I'm Alex, a junior in the College studying HSOC, originally from the Baltimore-DC area. This past year I was UA VP which taught me a lot about Penn and our student body- I'm excited at the possibility of bringing that knowledge to a new role as Class Board 24 College Chair.",
        "platform points": [
          "Working with the President, Provost, VPUL, and Secretary's offices to plan a special commencement season for the Class of 2024.",
          "Continuing the UA x CB Light Up Locust event!",
          "Helping plan a Feb club that is inclusive and cost-productive."
        ],
        "instagram_handle": "alex.eapenn",
        "image": {
          "src": "../../../images/2023/nec/Alex-Eapen.jpeg"
        }
      },
      {
        "name": "Kevin Yang",
        "introduction": "Hello everyone! I'm Kevin Yang, a freshman in the College majoring in psychology. During this academic year, I've been thrilled and thankful to help Class Board '26 bring the class together through our events. As a College Class Chair, I worked on enhancing the availability of dining options by speaking with administration and planning enjoyable events such as Cram 'n' Jam and ice skating to improve the mental health of our class. I am running for College Class Chair once again because there are many improvements I wish to make to turn the Penn experience into something MORE.",
        "platform points": [
          "Manage your stress and anxiety with class board events prioritizing mental health",
          "Obtain improved living facilities and Penn dining options",
          "Recharge with longer breaks through arrangements with school officials",
          "End your scholarly struggles with increased accessibility of academic resources and writing centers"
        ],
        "instagram_handle": "y4ngsta",
        "image": {
          "src": "../../../images/2023/nec/Kevin-Yang.jpeg"
        }
      },
      {
        "name": "Camila Paranhos",
        "introduction": "My name is Camila Paranhos, and I'm from São Paulo, Brazil. I ran for the Class Board because I wanted to bring my perspective as an international student interested in exploring the best of school spirit and promoting new traditions. Over the past two years, I have accomplished that by pioneering a partnership with Career Services in PENNterships, leading the organization of U-Night, the largest sophomore event, and helping to make Spring Formal, ECON Scream, Intercultural Fair & our many Pop-Ups memorable. I would love to continue working in a community I care so much about with your support. ",
        "platform points": [
          "Celebrate the cultural diversity present in our class through continuing to promote events that give students the chance to share some aspect of their culture.",
          "Continue the partnership with career services to plan more events that showcase diverse and non-traditional career choices for College students and provide them with real opportunities for engagement.",
          "Expand the Fall Softball Tournament to wider athletic competitions for students to participate in. Those could be between college houses, majors or some other criteria. ",
          "Organize more wellness pop-up events, especially during stressful periods. Running into smiling peers that hand you hot chocolate and invite you to a fun activity can brighten someone’s day.",
          "Host at least one large social event per semester for the entire class, following the newly established traditions of the Spring Formal and U-Night.",
          "Hear what YOU want! Use the CB 25 instagram as an active platform to hear what the class wants through regular surveys for event ideas or just themes to be explored!"
        ],
        "instagram_handle": "https://www.instagram.com/cami_paranhos/",
        "image": {
          "src": "../../../images/2023/nec/Camila-Paranhos.jpeg"
        }
      },
      {
        "name": "Koustav Datta",
        "introduction": "Hey everyone! My name is Koustav Datta and I hope to serve as a CAS Representative for the UA and as a College Chair for the Class of 2026. I have always loved Student Government, so I would thoroughly appreciate it if I would be able to continue doing what I love. If elected, I promise to create a tighter-knit community within the Class of 2026 through planned social events, and introduce policy to ensure all students have equitable access to materials. I love meeting new people while playing soccer, the piano, and chess, so please introduce yourself if you see me around campus :). ",
        "platform points": [
          "Mental Health - More people need to be informed about mental health counseling opportunities present around Penn's Campus in order to reduce the presence of \"PennFace\", as this is closely intertwined with mental health. ",
          "Math and Science Workshops - Additional workshops will be presented before every Friday quiz for math classes and before science-related midterms/finals to bolster preparation for exams. ",
          "Penn Merch - If possible, more free Penn Class of 2026 merchandise should be available to students so that students can show off their school pride. Go Quakers!",
          "Diversity Days - Roughly once a month, students from different backgrounds would be asked create and showcase their culinary skills by having a potluck with food originating around the world. ",
          "Communication - Currently, there is a limited number of avenues for communication between students and administration regarding pressing issues. Improving and increasing the number of such avenues should be a priority for both groups of people.",
          "Volunteering Opportunities - More volunteering opportunities should be presented to Penn students around Penn's campus and in West Philadelphia, specifically in the form of academic opportunities or sustainability initiatives."
        ],
        "instagram_handle": "koustav.datta",
        "image": {
          "src": "../../../images/2023/nec/Koustav-Datta.jpeg"
        }
      },
      {
        "name": "Xandro Xu",
        "introduction": "My name is Xandro Xu and I am seeking your vote for re-election as a UA College Representative and Class of 2025 College Chair! As a queer person of color, I am passionate about building community and leading efforts in diversity, equity, and inclusion. This past year on the UA, I spearheaded an initiative with SHAC Counseling to better understand students' experiences with counseling and how well they feel their identities represented. I hope to continue to make positive impact through organizing events and offering students a safe space to address their concerns. Remember, Xu is the one for you! ",
        "platform points": [
          "Community - Organizing of events that are centered around building genuine connections with other students.",
          "Diversity, Equity, and Inclusion - Spearheading initiatives to increase student inclusion in various spaces on campus (i.e. clubs, research labs)",
          "Accessibility - Working to increase equitable and widespread access to opportunities across the student body, in particular FGLI and disabled populations.",
          "Accountability and Transparency - Improved transparency between Penn administration and the study body to establish a renewed compact of trust and legitimacy.",
          "Advocacy - Advocating for FGLI, URM, Disabled, and LGBTQIA+ members of the Penn community."
        ],
        "image": {
          "src": "../../../images/2023/nec/Xandro-Xu.jpeg"
        }
      }
    ],
    "Wharton Chair": [
      {
        "name": "Shivam Shah",
        "introduction": "Hello everyone, my name is Shivam Shah and I am running for Wharton Class Chair. For this year, I have many great ideas for events that the class board can hold. From networking events to group parties, I will ensure that these events are a good time and have something for everyone. I will ensure that the class of 2025 (goated) will start a new tradition that will cement our legacy.",
        "platform points": [],
        "image": {
          "src": "../../../images/2023/nec/Shivam-Shah.jpeg"
        }
      },
      {
        "name": "Akash George",
        "introduction": "Hello Wharton '26!\n\nThis past year has been hectic for us all, but I hope Class Board provided an opportunity to connect with your classmates in a casual environment. \n\nI am seeking reelection to continue being a direct line to student government for you while providing high-quality social programming for our class.\n\nExcited to EXCEL through our sophomore year together",
        "platform points": [
          "E - Enhance the quality of social programming events. Liked Econ Scream, Ice Skating, Cram & Jam or any of our many pop-up events? Let's take it to the next level!",
          "X- eXpand opportunities for professional development. Many Penn freshaman LinkedIn pages are adorned with headshots taken at Class Board events. I want to provide more professional resources that specifically align with the career ambitions of Wharton students.",
          "C - Connect the Wharton community. By hosting more inclusive events appealing to various communities, I aim to integrate student's from all background into the Wharton culture and family.",
          "E - Engage our Wharton class with more effective communication and better integration of feedback into future events.",
          "L - Lead with integrity, transparency, and a commitment to serving the best interests of our class. I will work collaboratively with the Wharton administration and other student groups to advocate for our class and represent our interests. "
        ],
        "instagram_handle": "akashgeorgee",
        "image": {
          "src": "../../../images/2023/nec/Akash-George.jpeg"
        }
      },
      {
        "name": "Claire Zhong",
        "introduction": "Hi everyone! My name is Claire Zhong, and I’m running for re-election for Wharton Chair on Class Board. Literally can’t believe it’s been two years since I first joined, but the experience has been incredible. I’ve loved every minute of it and deciding to run was one of my best decisions at Penn. My goal for senior year on Class Board is to make the absolute most out of our senior year events, and help plan an unreal spring.",
        "platform points": [
          "Plan an incredible Feb Club: the thing I was most excited for throughout being on Class Board has been Feb Club senior spring, and it's my top priority this year"
        ],
        "instagram_handle": "claireezhong",
        "image": {
          "src": "../../../images/2023/nec/Claire-Zhong.jpeg"
        }
      }
    ],
    "Engineering Chair": [
      {
        "name": "Nicholas Kuo",
        "introduction": "My name is Nicholas Kuo, and I have proudly served as your Class of 2024 Engineering Chair for the last 2 years. I am re-running for the position, determined and confident that I can help create a senior year to remember. As Engineering Chair, I have initiated countless merch drops (P sweaters, Q-zips, etc.), planned memorable social/cultural gatherings (Holi celebrations, Galas, formals), and started new Penn traditions (U-Night). I’m excited to continue delivering the highest quality Penn traditions, social events, and merch drops to the Class of 2024 as we venture into our last year.",
        "platform points": [
          "Direct fundraised money into well-executed, and well-funded large-scale events for the entire Class, such as a Senior Year Gala",
          "Increase accessibility to graduation festivities, such as Class Board sponsored graduation photography",
          "Consistently incorporate feedback from the Class of 2024 into our class-wide events",
          "Foster smaller (bi-weekly) social events for our Class, from open mic nights to sponsored coffee shop meetups",
          "Increase merch drops at Class Board events (expanding merch to items like scarves, sunglasses, etc.)",
          "Increase collaboration with cultural groups to integrate cultural awareness into Class Board events"
        ],
        "facebook_url": "https://www.facebook.com/nicholas.kuo.56/",
        "instagram_handle": "https://www.instagram.com/nicholasykuo/",
        "image": {
          "src": "../../../images/2023/nec/Nicholas-Kuo.jpeg"
        }
      },
      {
        "name": "Iniyaal Raguraj",
        "introduction": "From doing Bhangra until 4 AM to writing sketch comedy until I sleep, a lot of people tell me I'm an engineering student by name only. I'm wrapping up my freshman year as a CIS major, and it's been tough balancing my extracurricular interests with my (unfortunate) affinity toward engineering. I also really struggle with anxiety, and I've experienced first-hand how overwhelming things can get here in the eQuad when you also want to engage with all the things that bring you joy. But–I don't think all hope is lost. Let's break the stereotype and find some balance together. ",
        "platform points": [
          "Workload: I want to build in 2 resources: course contacts & stress guides. We need tools that can show us how to ask for help and deal with falling behind.",
          "Campus-wide printing access: we're not always in Towne–SEAS printing dollars & services should work across campus regardless of a building's school affiliation. ",
          "Interdisciplinary coursework & opportunities: I want to encourage the development of mini-courses or concentrations in majors that allow us to engage more easily with interests that complement our majors. ",
          "Priority GSR booking access: we don't have enough study spaces, let alone for Engineering students on campus. We need increased and 24-hour access to safe, comfortable study spaces."
        ],
        "facebook_url": "https://www.facebook.com/profile.php?viewas=100000686899395&id=100086020039916",
        "instagram_handle": "iniyaalraguraj",
        "image": {
          "src": "../../../images/2023/nec/Iniyaal-Raguraj.jpeg"
        }
      },
      {
        "name": "Faraz Rahman",
        "introduction": "Hi my name is Faraz and I am the incumbent candidate for the Class Board engineering chair. During Class Board, I have been responsible for a number of events including Econ Scream and Skate Nights.\n\nThis year, I will also be running for Undergraduate Assembly. I have experience with UA adjacent committees including Dining Advisory Board and Residential Services Advisory Board. Some of my accomplishments on these boards include\n\n\n- producing videos for accepted seniors to learn about housing on campus.\n- expanding KCECHs/Mclelands dining hours\n- increasing to Halal/Kosher availability at places such as Gourmet Grocer and Accenture Cafe",
        "platform points": [
          "Increasing Equity of Food Plans for those with food restrictions (ie Vegan/Halal/Kosher/etc.)",
          "Providing Engineering clubs better access to social funds so students can pay less out of pocket."
        ],
        "instagram_handle": "farazrahman121",
        "image": {
          "src": "../../../images/2023/nec/Faraz-Rahman.jpeg"
        }
      },
      {
        "name": "Fiona Wu",
        "introduction": "My name's Fiona Wu and I'm re-running for Engineering Class Chair. I'm a computer science major, but I also love design, medicine, photography and more! My favorite part about Penn is the people and I love being able to create events where people can take the time to relax in the busyness of Penn! I'm here to represent your needs, wants, and who you are. Follow my campaign on @fiona.wu_ . Love, FWU - Fiona With You",
        "platform points": [
          "PAST EXPERIENCE - In the last 2 years, I have worked on social media on @upenn_2025, social events from bloom formal and spikeball, wellness events like our valentines and food events, and professional events! This year, I even helped spearhead Celebration of Cultures: a large culture fair with 30+ groups by United Minorities Council and Class Board. ",
          "COMMUNICATION - I want to streamline the currently existing system where students can submit events for the week to be highlighted on @upenn_2025 ! let's highlight the talents and the efforts of the class!",
          "INCLUSIVITY & DIVERSITY - As a minority growing up in Missouri, I recognize the importance of representation and creating inclusive spaces. This ranges from proper accomodation at events (i.e. allergen and dietary information) to making sure that the graphics we post are easily accessible and readable. It also means creating a broad range of events so that everyone has a Class Board event that they like. "
        ],
        "instagram_handle": "https://www.instagram.com/fiona.wu_/",
        "image": {
          "src": "../../../images/2023/nec/Fiona-Wu.jpeg"
        }
      }
    ],
    "Nursing Chair": [
      {
        "name": "Siddiqa Faruki",
        "introduction": "Hi, I’m Siddiqa from New Orleans. I’m a nursing major from the class of 2026 with a minor in global health. In my free time, I love to write poetry and spend time with my friends.I am running for Nursing Chair because I feel that it is important for us, as a class, to develop public health initiatives within the school and local Philadelphia community. As nursing chair, I would work to: (Platform points)",
        "platform points": [
          "Destigamatize Nursing- Gain more recognition for nurses hard work ",
          "Implement Diversity Programs- Educate minority communities on the benefits of nursing ",
          "Have Menstrual Products Readily Available- Organize donations of products so bathrooms will always be stocked ",
          "Create Community Engagement Opportunities- Reach out to Penn and local Philadelphia organizations on service opportunities ",
          "Plan Public Health Events with SAS, SEAS, and Wharton- Build relationships with all schools to create a supportive community ",
          "Advocate for Financial Resources including textbook, transport, and program access"
        ],
        "instagram_handle": "quesiddiqa ",
        "image": {
          "src": "../../../images/2023/nec/Siddiqa-Faruki.jpeg"
        }
      },
      {
        "name": "Benita Cui",
        "introduction": "Hey hey! I’m Benita Cui, and it has been an honor to serve as your Nursing Class Chair the past two years. It has been an incredible experience to help bring back traditional events with the Class Board of 2025. From secretly screaming about microbio at the Econ Scream, sharing what we appreciate at the LOVE Valentine’s day pop up event, to organizing study breaks, I will continue creating these special highlights in our junior year as your Nursing Class Chair for all you cuties!",
        "platform points": [
          "Student Wellness: Advocating to improve students' experience throughout our transition, easing club application deadlines, inviting emotional support animals, and organizing self-care, bonding and fun events for our class.",
          "Penn Nursing 2025 Instagram: A student-run social media platform just for our class to share relevant academic and upcoming event information, and snapshots from the lives of our fellow classmates!",
          "Student Unity: Let's build the tight-knit community Nursing students are renowned for, and also collaborate with other schools and student organizations."
        ],
        "instagram_handle": "benita_cui",
        "image": {
          "src": "../../../images/2023/nec/Benita-Cui.jpeg"
        }
      },
      {
        "name": "Leslie Njingang",
        "introduction": "Hi everyone! My name is Leslie Njingang and\nI'm a nursing student with a minor in American\nSign Language. I'm passionate about the Penn\nUndergraduate experience and creating a\ndiverse and enriching experience for all\nstudents. As nursing chair I hope to increase\nthe integration of nursing students into the\nwider Penn community through student-led\nteaching sessions, career panels, and social\nactivities.",
        "platform points": [
          "Increasing the integration of nursing students into the wider Penn community through student-led teaching sessions.",
          "Promoting Diversity, Equity, and Inclusion by encouraging attendance to events sponsored by mintoriy groups in the nursing department.",
          "Creating more affordable nursing merchandise through a sponsorship & grant club.",
          "Creating nursing emails on gmail platforms. "
        ],
        "image": {
          "src": "../../../images/2023/nec/Leslie-Njingang.jpeg"
        }
      }
    ]
  }